{
  "global_scan": [
    {
      "source": "Hacker News",
      "title": "Doing gigabit Ethernet over my British phone wires",
      "url": "https://thehftguy.com/2026/01/22/doing-gigabit-ethernet-over-my-british-phone-wires/",
      "hn_url": "https://news.ycombinator.com/item?id=46742362",
      "heat": "169 points",
      "time": "3 hours ago",
      "content": "Doing Gigabit Ethernet Over My British Phone Wires – The HFT Guy Skip to content Disclaimer : None of this is written by AI, I’m still a real person writing my own blog like its 1999 I finally figured out how to do Gigabit Ethernet over my existing phone wires. Powerline adapter and misery I’ve mostly lived with powerline adapters over recent years. Some worked well, some did not (try few and return what doesn’t work in your home). One I had for a while gave me stable 30 Mbps, which was little but good enough for internet at the time. I care very much about having stable low latency for gaming, more than bandwidth. Fast forward to my current situation, that powerline adapter regularly lost connection which was a major problem. I got some new ones with the latest and greatest G.hn 2400 standard. The final contender served around 180 Mbps to my office (with high variance 120 to 280 Mbps), or around 80 Mbps to the top floor. It’s good enough to watch YouTube/TV yet it’s far from impressive. One peculiar thing from the UK: Internet providers don’t truly offer gigabit internet. They have a range of deals like 30 Mbps – 75 Mbps – 150 Mbps – 300 Mbps – 500 Mbps – 900 Mbps, each one costing a few more pounds per month than the last. This makes the UK simultaneously one of the cheapest and one of the most expensive countries to get Internet. Long story short, new place, new hardware, new deals, the internet has been running at 500 Mbps for some time now. Every 50 GB of Helldivers 2 update ( because these idiots shipped the same content in duplicate 5 times ) is a painful reminder that the setup is not operating at capacity. Problem: How to get 500 Mbps to my room? A Fetish for Phone Sockets I’ve been looking for a way to reuse phone wires for a while, because British houses are full of phone sockets. There are 2 sockets in my office room. I can’t stress enough how much we love our phone sockets. It’s not uncommon to have a one bed flat with 2 phone sockets in the living room and 2 phone sockets in the bedroom and a master socket in the technical room. It’s ridiculous. A new house bought today could have 10 phone sockets and 0 Ethernet sockets. There is still no regulation that requires new build to get Ethernet wiring (as far as I know). There’s got to be a way to use the existing phone infrastructure. I know the technology exists. It’s one of the rare cases where the technology exists and is mature, but nobody can be bothered to make products for it. The standards that run powerline adapters (HomePlug AV200, AV500, G.hn 2400) can work with any pair of wires. It should work ten times better on dedicated phone wires instead of noisy power wires, if only manufacturers could be bothered to pull their fingers out of their arse and make the products that are needed. After countless years of research, I finally found one German manufacturer that’s making what needs to be made https://www.gigacopper.net/wp/en/home-networking/ Ordering It’s made and shipped from "
    },
    {
      "source": "Hacker News",
      "title": "You can't pay me to prompt",
      "url": "https://dbushell.com/2025/06/18/ai-policy/",
      "hn_url": "https://news.ycombinator.com/item?id=46743095",
      "heat": "31 points",
      "time": "1 hour ago",
      "content": "You Can’t Pay Me To Prompt! – David Bushell – Web Dev (UK) You Can’t Pay Me To Prompt! Subscribe Blog RSS feed Notes RSS feed or Combined and follow Mastodon Bluesky Wednesday 18 Jun 2025 Play Synthesised Audio Did you noticed the new badge stamped atop my website? This reflects my current stance on “AI” use for my professional work. TL;DR: I don’t use AI. If that surprises you, either you’re new here (welcome), or you skipped my ranting and raving in recent weeks. Although my blog is not invisible to my clients (note to self) these posts are not exactly the best references. I have written a more formal AI policy: Read my AI Policy at: dbushell.com/ai No AI; that’s the gist. There’s a little more nuance to it. And enough wiggle room should I need to beg forgiveness from The Singularity in six months. I explain my reasoning and will update the policy over time should the situation change. This is a first draft. Comments To preempt the expected comments from those who can’t read good: “I disagree…” No you can’t disagree, this is my policy! I’m not asking anyone to adopt it or convince anyone of the conclusions I’ve reached. However, If you think I’m genuinely mistaken on specific points I’d appreciate elaboration with sources. “But what about…” This policy covers AI use only. Maybe some of my concerns extend beyond AI but I’m not interested in a game of whataboutery. I’m open for contact should potential clients have serious questions about non-AI issues. “Personal use?” I have no interest in using AI for personal use either. I’ve been shocked to learn how many people don’t understand that creative hobby activities are as much, if not more, about the journey, act, and expression, as they are about the final result. The end product is not the only reward. I find no fun in AI. “I told you so.” If I ever u-turn and start using AI that means the industry has shifted radically. It takes no effort to blindly predict a future where AI is unobjectionably perfect. Little of the current state of the tech industry indicates a positive trajectory. “You wrote that with AI!” Alt Futurama quote; an exasperated Professor Farnsworth says: 'I Don't Want to Live on this Planet Anymore' Anyway, enough of that. The “NO-AI” badge is temporary and will adorn my website for now. It is not a canary. I reserve the right to move it or remove it regardless of policy change. There is also a link in the footer that will remain longer. PS. despite what the title says I will accept a very large cheque. If you want me to pull a 180° and shill your AI start-up, and destroy all my credibility, it’s going to cost you. Subscribe Blog RSS feed Notes RSS feed or Combined and follow Mastodon Bluesky David Bushell I design, build, and consult upon all things web. Based in the UK and coding worldwide. Hire me! About Mastodon Bluesky CodePen Forgejo RSS Feed My Projects New and old! Read my blog and notes , see what I’m coding now and my design portfolio . Web Agencies Need a hand? I’m reli"
    },
    {
      "source": "Hacker News",
      "title": "Many Small Queries Are Efficient in SQLite",
      "url": "https://www.sqlite.org/np1queryprob.html",
      "hn_url": "https://news.ycombinator.com/item?id=46742635",
      "heat": "30 points",
      "time": "2 hours ago",
      "content": "Many Small Queries Are Efficient In SQLite Small. Fast. Reliable. Choose any three. Home Menu About Documentation Download License Support Purchase Search About Documentation Download Support Purchase Search Documentation Search Changelog Many Small Queries Are Efficient In SQLite 1. Executive Summary 200 SQL statements per webpage is excessive for client/server database engines like MySQL, PostgreSQL, or SQL Server. But with SQLite, 200 or more SQL statement per webpage is not a problem. SQLite can also do large and complex queries efficiently, just like client/server databases. But SQLite can do many smaller queries efficiently too. Application developers can use whichever technique works best for the task at hand. 2. The Perceived Problem The Appropriate Uses For SQLite page says that dynamic pages on the SQLite website typically do about 200 SQL statements each. This has provoked criticism from readers. Examples: \"200 SQL statements is a ridiculously high number for a single page\" \"For most sites, 200 queries is way, way, way too much.\" \"[This is] bad design\" Such criticism would be well-founded for a traditional client/server database engine, such as MySQL, PostgreSQL, or SQL Server. In a client/server database, each SQL statement requires a message round-trip from the application to the database server and back to the application. Doing over 200 round-trip messages, sequentially, can be a serious performance drag. This is sometimes called the \"N+1 Query Problem\" or the \"N+1 Select Problem\" and it is an anti-pattern. 3. N+1 Queries Are Not A Problem With SQLite SQLite is not client/server, however. The SQLite database runs in the same process address space as the application. Queries do not involve message round-trips, only a function call. The latency of a single SQL query is far less in SQLite. Hence, using a large number of queries with SQLite is not the problem. 4. The Need For Over 200 SQL Statements Per Webpage The dynamic webpages on the SQLite website are mostly generated by the Fossil version control system . A typical dynamic page would be a timeline such as https://sqlite.org/src/timeline . A log of all SQL used by the timeline is shown below. The first group of queries in the log are extracting display options from the \"config\" and \"global_config\" tables of the Fossil database. Then there is a single complex query that extracts a list of all elements to be displayed on the timeline. This \"timeline\" query demonstrates that SQLite can easily process complex relational database queries involving multiple tables, subqueries, and complex WHERE clause constraints, and it can make effective use of indexes to solve the queries with minimal disk I/O. Following the single big \"timeline\" query, there are additional queries for each timeline element. Fossil is using the \"N+1 Query\" pattern rather than trying to grab all the information in as few queries as possible. But that is ok because there is no unnecessary IPC overhead. At the bottom o"
    },
    {
      "source": "Hacker News",
      "title": "XHTML Club",
      "url": "https://xhtml.club/",
      "hn_url": "https://news.ycombinator.com/item?id=46743219",
      "heat": "7 points",
      "time": "37 minutes ago",
      "content": "XHTML Club - Extreme HyperText Movement for Luddites XHTML Club X treme H yper T ext M ovement for L uddites Home Members Greetings, this is the official XHTML club (and blog)! This website is both a collection of XHTML valid websites and a simple blog; a lonely software developer screaming out into the abyss of the internet. Ranting and raving about the ever increasing bloat that is the \"modern\" web. What XHTML Club Actually Is Simply put: it's a collection of XHTML valid websites . That's it. There's no \"classic web\" manifesto or any call to \"return to the days of the old internet!\". This is just a place where valid XHTML is respected, even if the rest of the internet has long since moved on. Why Bother? I fully understand how pointless this might seem to some people. XHTML has long been replaced, with HTML5 being the current king of the hypertext markup world. Validation is ignored, and most modern sites are built with little concern for structure or longevity. Today's web is severely lacking in quality craftsmanship. Still, there's value in doing things properly , even when it's scoffed at by modern age internet users. XHTML Club isn't here to shame or persuade, instead my hope is to make you more aware about the quality of your HTML. It's here to show that valid markup still exists and that some of us still care enough to build it that way. Articles 2021-04-06 / Everyone should become an HTML expert Support XHTML All content posted on this website will always remain free to everyone. No pay-walls, obtrusive ads or annoying tracking cookies. Basically zero bullshit or fluff. If you feel like you would like to support my efforts in continuously posting free ( and hopefully interesting ) content, then please consider contributing . Colophon This website is hand-coded with valid XHTML . Reach out on Mastodon"
    },
    {
      "source": "Hacker News",
      "title": "FOSS \"Just Fork It\" Delusion",
      "url": "https://hamishcampbell.com/foss-just-fork-it-delusion/",
      "hn_url": "https://news.ycombinator.com/item?id=46743328",
      "heat": "6 points",
      "time": "20 minutes ago",
      "content": "#FOSS “Just Fork It” Delusion – #OMN (Open Media Network) Skip to content hamish campbell Non classé 23/01/2026 23/01/2026 3 Minutes One of the most repeated mantras in #FOSS culture goes something like this: “If you don’t like it, just fork it.” On the surface, this sounds empowering. And technically, it is true. The beauty of open source is that you can take the Mastodon source code, fork it, and do whatever you want with it. Don’t like how it’s run? Do something different. Don’t like the branding? Change it. Got a better idea? Implement it. But socially, this mantra is misleading, forking is easy, sustaining is hard. Forking code is cheap, sustaining a living project is not. What “just fork it” quietly ignores is that software is only a small part of what makes a project work. The hard parts are social: users, trust, shared norms, governance, maintenance, conflict resolution and long-term care. When people say “just fork it,” they usually mean “remove yourself from the social problem rather than engaging with it.” That’s not empowerment – it’s fragmentation at best and prat behaver at worst. From an #OMN point of view, sometimes this is needed, but its rare as it is mostly value destruction. Fragmentation isn’t neutrality, every fork splits attention, energy, documentation, user bases, and developer time. Most forks don’t die because the code is bad; they die because the social surface area is untrusted or unmanageable. We end up with: dozens of half-maintained projects, duplicated effort, incompatible implementations, project communities too small to support themselves. This isn’t resilience, it’s entropy, not in a good way. And worse, most of these forks are isolated socially, even when they are technically compatible. The result is lost value, lost history, and lost trust – rinse, repeat, move on. “Just fork it” hides power, it doesn’t challenge it. The slogan pretends to be anti-authority, but in practice it is used to protect informal power. Core teams stay untouched, governance questions are avoided, structural problems remain unresolved. The people most affected – users, moderators, small contributors – are quietly told to leave and rebuild everything from scratch. That’s not openness, that’s abdication, it’s a prat move that we need to compost. In social terms, it’s the equivalent of saying: “If you don’t like society, go start your own civilisation.” Contribution is not about submission. There is a healthier, but, less glamorous path – start conversations that include people you disagree with, yes, this is slower than forking. It’s also how shared infrastructure survives. What we need to talk more about is that contribution is not about obedience to maintainers. It’s about stewardship of commons. That means staying in the mess, mediating conflict, and resisting the urge to walk away every time something feels wrong. Forking skips the hardest step: collective sense-making. Small steps beat heroic exits, the myth of the heroic fork mirr"
    },
    {
      "source": "Product Hunt",
      "title": "BrainLoom",
      "url": "https://www.producthunt.com/products/brainloom",
      "time": "2026-01-19T23:43:55-08:00",
      "heat": "Top Product",
      "content": "BrainLoom: Turn PDFs into Flashcards. The local-first Learning OS. | Product Hunt Launching today BrainLoom Launching today Turn PDFs into Flashcards. The local-first Learning OS. 110 followers Turn PDFs into Flashcards. The local-first Learning OS. 110 followers Visit website Note and writing apps Stop switching between different apps just to study. BrainLoom is the local-first Learning OS that unifies your study workflow. Turn PDF highlights into Flashcards instantly and keep them linked to the source text for deep context. You can also structure ideas visually on an Infinite Canvas using \"Smart Paste\" without touching your mouse. Available for Windows v1.0 (Mac soon). To fund the expansion, grab a Lifetime License for $29 today (First 150 users only). Overview Reviews Alternatives Built with Team Awards More Free Options Launch tags: Productivity • Education • Artificial Intelligence 10% OFF Lifetime License Launch Team / Built With Show more Show more Anima Playground — AI with an Eye for Design AI with an Eye for Design Promoted What do you think? … Login to comment Ujjwal BrainLoom Maker 📌 Hey Product Hunt 👋 I’m Ujjwal, the solo developer behind BrainLoom. For years, my study workflow was a mess. I was drowning in PDFs, typing notes in one app, and manually creating flashcards in another. I realized I was spending more time managing my tools than actually learning. BrainLoom is a Learning OS designed for speed. The core magic is the Flash-Loom: You simply highlight text in a PDF, and it converts into a Flashcard instantly. No copy-pasting. No switching apps. It also features: - 🎨 Infinite Canvas: Don't just list notes; weave them. Use \"Smart Paste\" to structure ideas visually into mind maps without touching your mouse. - 🔗 Deep Context: The \"Killer Feature.\" Click \"View Source\" on any card to jump back to the exact paragraph where the idea was born. - 🚀 Active Recall Engine: A built-in smart scheduler that manages your reviews, so you master topics efficiently. 💻 Platform Update: It is Windows Only right now. I know many of you are on Mac—I am working hard to port it! I built this because 'Alt-Tabbing' was ruining my focus. What is the one part of your current study routine that frustrates you the most? Let me know in the comments Upvote (6) Report Share 4d ago Nika minimalist phone: creating folders Pretty UX/UI :)) Upvote (4) Report Share 6h ago Ujjwal BrainLoom Maker @busmark_w_nika Thanks Nika! 🙌 That means a lot coming from a design pro. I really tried to keep it clean and distraction-free. I see you have a launch coming up on the 28th—I just followed your profile so I can support you when you go live! :) Upvote (2) Report Share 5h ago Nika minimalist phone: creating folders @ujjwalranga That's so kind move from you. Than you so so much! Upvote (1) Report Share 3h ago Zeiki Yu Congratulations, I tried it out and the product is very good. Upvote (2) Report Share 4h ago Ujjwal BrainLoom Maker @zeiki_yu Thank you so much! 🙌 That means the"
    },
    {
      "source": "Product Hunt",
      "title": "Humans in the Loop",
      "url": "https://www.producthunt.com/products/humans-in-the-loop",
      "time": "2026-01-19T03:51:11-08:00",
      "heat": "Top Product",
      "content": "Humans in the Loop: A free community to talk all-things-agentic-coding-AI | Product Hunt Launching today Humans in the Loop Launching today A free community to talk all-things-agentic-coding-AI 133 followers A free community to talk all-things-agentic-coding-AI 133 followers Visit website Humans in the Loop is a place for people who love to use AI to ship faster, a free community to join and share insights and best practices on Claude Code, Cursor, MCP servers, AI code reviews, and more. Overview Reviews Team Awards More Free Launch tags: Slack • Community • Vibe coding Launch Team Show more Show more Anima - Vibe Coding for Product Teams — Build websites and apps with AI that understands design. Build websites and apps with AI that understands design. Promoted What do you think? … Login to comment fmerian Hunter 📌 For all-things AI coding: @Claude Code , @Cursor , @Kilo Code ... Connect with like-minded people. Thoughtful, authentic, and fun. Let's make human interactions great again. Upvote (7) Report Share 23h ago Launching Today # 1 Day Rank Upvote • 169 points Follow Humans in the Loop Add to collection Share Analytics Company Info humansintheloop.tech Humans in the Loop Info Launched in 2026 Forum p/humans-in-the-loop Subscribe Sign in Top Product Categories Engineering & Development LLMs Productivity Marketing & Sales Design & Creative Social & Community Finance AI Agents Engineering & Development Vibe Coding Tools AI Coding Agents AI Code Editors LLMs AI Chatbots AI Infrastructure Tools Prompt Engineering Tools Productivity AI notetakers Note and writing apps Team collaboration software Search Marketing & Sales Lead generation software Marketing automation platforms Design & Creative Video editing Design resources Graphic design tools AI Generative Media Social & Community Social Networking Professional networking platforms Community management Finance Accounting software Fundraising resources Investing AI Agents AI Voice Agents AI Agent Automation See All Categories >> Trending categories Top reviewed Trending products Top forum threads Trending categories Vibe Coding Tools AI Dictation Apps AI notetakers Code Review Tools No-code Platforms Figma Plugins Static site generators Top reviewed Lovable n8n Attio PostHog Vapi Granola Raycast Supabase Trending products Lovable Screen Studio bolt.new Wispr Flow Framer Replit Vapi Granola Top forum threads Cursor or Claude Code? POLL: Domain or product first? YC deadline in <2 weeks; Who's applying? We Got into YC, Got Kicked Out, and Fought Our Way Back How Wispr Flow found PMF through pivot Best Vibe Coding tool so far? Landing page roast - 48 hours only Fix your tagline with the PH CEO © 2026 Product Hunt Newsletter Apps About FAQ Terms Privacy & Cookies Privacy Choices Advertise llms.txt Contact us: hello@producthunt.com"
    },
    {
      "source": "Product Hunt",
      "title": "GetThis",
      "url": "https://www.producthunt.com/products/getthis",
      "time": "2026-01-23T05:37:46-08:00",
      "heat": "Top Product",
      "content": "GetThis: Generate tasks from voice, text, or screenshots. | Product Hunt Launching today GetThis Launching today Generate tasks from voice, text, or screenshots. 105 followers Generate tasks from voice, text, or screenshots. 105 followers Visit website AI Dictation Apps Stop typing. Just speak or snap a screenshot of your chats. GetThis uses AI to sort your brain dump, organize grocery runs, and categorize tasks instantly. Overview Reviews Alternatives Built with Team Awards More Free Options Launch tags: Productivity • Task Management Launch Team / Built With Show more Show more Anima Playground — AI with an Eye for Design AI with an Eye for Design Promoted What do you think? … Login to comment Sawyer Lee GetThis Maker 📌 Hey Product Hunt! 👋 I’m Sawyer, founder of GetThis. We built GetThis around a simple idea: capture thoughts the moment they happen and instantly turn them into tasks. Just speak or snap. GetThis handles the rest — no setup, no friction. If you’ve ever lost a task because it lived only in your head, I’d love to hear: what’s your biggest friction in managing your tasks today? We’ll be around all day — come say hi! Upvote (2) Report Share 1d ago Alina Petrova SEMrush Looks great. Does the tool connect with task management platforms like Notion, Atlassian, or Airtable? Upvote (1) Report Share 2h ago Sawyer Lee GetThis Maker @alina_petrova3 Thanks, Alina! We’re actively collecting user feedback right now, and integrations like Notion are something we can add if users want them. At this stage, we’re focused on making task capture and structuring feel effortless. If enough users need a specific integration, we’ll prioritize it. Out of curiosity, which platform would be most useful for you? Upvote (1) Report Share 1h ago Alina Petrova SEMrush @sawyer_lee Sounds good, it makes sense to move forward by iterations and based on user feedback. Trello, Notion and Airtable would be the most relevant ones for me. Upvote (1) Report Share 42m ago Yuanyuan Zhang Congratulations on the launch! The screenshot capture feature is a genius move! I constantly find myself with a gallery full of reminder screenshots that just go to die because I never organize them. Does the Ai automatically set deadlines if it detects a date in the screenshot? Upvote (1) Report Share 5h ago Sawyer Lee GetThis Maker @yuanyuan_zhang0104 Thank you very much, Yuanyuan! Yeah, this app is for the ones just like you! Answering your questions: Yes, it recongnized and automatically sets the dates. For example, just say \"Go see a doctor tomorrow.\" Then, it will exactly put the date. Of course from the screenshot too! Upvote Report Share 1h ago Tony are you guys expecting integration with third party to-do apps? not sure even how that is technically possible, just asking Upvote (1) Report Share 3h ago Launching Today # 3 Day Rank Upvote • 136 points Follow GetThis Add to collection Share Analytics Company Info getthis.day GetThis Info Launched in 2026 Forum p/getthis Similar Produc"
    },
    {
      "source": "Product Hunt",
      "title": "Youtube Custom Playback",
      "url": "https://www.producthunt.com/products/youtube-custom-playback",
      "time": "2026-01-19T03:51:48-08:00",
      "heat": "Top Product",
      "content": "Youtube Custom Playback: Unlock up to 16x speed with native-style controls | Product Hunt Launching today Youtube Custom Playback Launching today Unlock up to 16x speed with native-style controls 81 followers Unlock up to 16x speed with native-style controls 81 followers Visit website Chrome Extensions This lightweight extension adds granular playback speeds from 0.25x to 16x directly into your native settings menu. Perfect for power-learners who need to watch lots of lectures or analysts who need frame-by-frame precision. Overview Reviews Alternatives Team Awards More Free Launch tags: Chrome Extensions • Productivity • YouTube Launch Team Show more Show more Auth0 — Start building with Auth0 for AI Agents, now generally available. Start building with Auth0 for AI Agents, now generally available. Promoted What do you think? … Login to comment Anukar Youtube Custom Playback Maker 📌 Hi Product Hunt! I'm Anukar from Anukar.tech. I built YouTube Custom Playback because I was tired of being limited to 2x speed for long tutorials. I wanted a tool that felt like it belonged in the YouTube player without ugly overlays. Whether you're a student saving time or a dev watching technical talks, I hope this helps you work faster! I'd love to hear your feedback... Upvote (1) Report Share 5d ago Nika minimalist phone: creating folders 16x speed? :D that's a different level. I noticed they introduced 4x. But not so sure how 16x... but... yeah, Gen Z probably needs that :D Upvote (2) Report Share 6h ago Matt @busmark_w_nika Not Gen Z, but regularly playing on faster speeds.... Is that this famous deterioration of our attention span and patience? :-D Upvote Report Share 2h ago Launching Today # 4 Day Rank Upvote • 122 points Follow Youtube Custom Playback Add to collection Share Analytics Company Info chromewebstore.google.com/detail/youtube-custom-playback/aajebebekipgngebidcakkcckkagfikj Youtube Custom Playback Info Launched in 2026 Forum p/youtube-custom-playback Subscribe Sign in Top Product Categories Engineering & Development LLMs Productivity Marketing & Sales Design & Creative Social & Community Finance AI Agents Engineering & Development Vibe Coding Tools AI Coding Agents AI Code Editors LLMs AI Chatbots AI Infrastructure Tools Prompt Engineering Tools Productivity AI notetakers Note and writing apps Team collaboration software Search Marketing & Sales Lead generation software Marketing automation platforms Design & Creative Video editing Design resources Graphic design tools AI Generative Media Social & Community Social Networking Professional networking platforms Community management Finance Accounting software Fundraising resources Investing AI Agents AI Voice Agents AI Agent Automation See All Categories >> Trending categories Top reviewed Trending products Top forum threads Trending categories Vibe Coding Tools AI Dictation Apps AI notetakers Code Review Tools No-code Platforms Figma Plugins Static site generators Top reviewed Lovable n8n Attio PostH"
    },
    {
      "source": "Product Hunt",
      "title": "Sometimes: A Poem Arrives",
      "url": "https://www.producthunt.com/products/sometimes-a-poem-arrives",
      "time": "2026-01-18T11:47:04-08:00",
      "heat": "Top Product",
      "content": "Sometimes: A Poem Arrives: Poetry at Unexpected Moments | Product Hunt Launching today Sometimes: A Poem Arrives Launching today Poetry at Unexpected Moments 75 followers Poetry at Unexpected Moments 75 followers Visit website Note and writing apps The best things arrive when you're not looking. Discover poetry that matches your moment, when you least expect it. The app considers time of day, weather, and season. A poetry app for iOS. Overview Reviews Alternatives Team Awards More Free Launch tags: Art • Writing Launch Team Show more Show more Anima Playground — AI with an Eye for Design AI with an Eye for Design Promoted What do you think? … Login to comment Mert Özel Sometimes: A Poem Arrives Maker 📌 Hi Product Hunt 👋 The idea is simple: Poetry shouldn't live in a feed. It should find you. In a quiet moment. A rainy afternoon. The first light of morning. \"Sometimes:\" sends you one poem at unexpected times, you never know exactly when. No infinite scroll. No engagement metrics. No accounts. Just: open, read, close. How it works: Set your time window (morning? evening? all day?) Choose your pace (daily, weekly, or anywhere in between) Then forget about it The app watches the weather, time, and season. When conditions align, a poem arrives. All from the public domain. Dickinson, Frost, Whitman, Poe, Keats, Yeats. Why I built this: Technology should enrich moments, not steal them. \"Sometimes:\" is my answer to the attention economy. It's designed to be closed, not to trap you. It's free. If a poem arrives at the right moment, tips are welcome. I'd love to hear what you think. What would make this meaningful for you? Thanks for being here on launch day. Upvote (2) Report Share 6d ago Henno Fourie Very cool. Is there a widget? Upvote Report Share 5h ago Syed Mustassim Really liked the quick and easy onboarding flow. Also curious to know if Haikus are included. Upvote Report Share 2h ago Launching Today # 5 Day Rank Upvote • 117 points Follow Sometimes: A Poem Arrives Add to collection Share Analytics Company Info sometimes.deftmag.com App Store Sometimes: A Poem Arrives Info Launched in 2026 Forum p/sometimes-a-poem-arrives Similar Products Deepen AI Companion 4.7 ( 17 reviews ) Note and writing apps AI Chatbots Readwise Resurfacing your best highlights from Kindle, iBooks & more 4.8 ( 18 reviews ) Note and writing apps Email marketing Matter Read-it-later, reinvented 4.6 ( 10 reviews ) Note and writing apps News stoic. The all-in-one journaling app for mental health 5.0 ( 5 reviews ) Note and writing apps Activity tracking Journalistic A pristine micro journaling experience 5.0 ( 4 reviews ) Note and writing apps Sleep apps View more Subscribe Sign in Top Product Categories Engineering & Development LLMs Productivity Marketing & Sales Design & Creative Social & Community Finance AI Agents Engineering & Development Vibe Coding Tools AI Coding Agents AI Code Editors LLMs AI Chatbots AI Infrastructure Tools Prompt Engineering Tools Productivity AI notet"
    },
    {
      "source": "GitHub Trending",
      "title": "remotion-dev/remotion - 🎥 Make videos programmatically with React",
      "url": "https://github.com/remotion-dev/remotion",
      "heat": "29,077 stars",
      "time": "Today",
      "content": "GitHub - remotion-dev/remotion: 🎥 Make videos programmatically with React Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert remotion-dev / remotion Public Uh oh! There was an error while loading. Please reload this page . Notifications You must be signed in to change notification settings Fork 1.7k Star 29.1k 🎥 Make videos programmatically with React remotion.dev License View license 29.1k stars 1.7k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings remotion-dev/remotion main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 29,570 Commits .claude .claude .cursor .cursor .github .github .vscode .vscode packages packages .cursorignore .cursorignore .gitattributes .gitattributes .gitignore .gitignore .npmrc .npmrc .prettierrc.js .prettierrc.js AGENTS.md AGENTS.md CLAUDE.md CLAUDE.md CODE-OF-CONDUCT.md CODE-OF-CONDUCT.md CONTRIBUTING.md CONTRIBUTING.md FUNDING.yml FUNDING.yml LICENSE.md LICENSE.md README.md README.md bun.lock bun.lock bunfig.toml bunfig.toml go.work go.work go.work.sum go.work.sum package.json package.json publish.ts publish.ts set-version.ts set-version.ts tsconfig.json tsconfig.json turbo.json turbo.json View all files Repository files navigation Remotion is a framework for creating videos programmatically using React. Why create videos in React? Leverage web technologies : Use all of CSS, Canvas, SVG, WebGL, etc. Leverage programming : Use variables, functions, APIs, math and algorithms to create new effects Leverage React : Reusable components, Powerful composition, Fast Refresh, Package ecosystem Created with Remotion \"This video was made with code\" - Fireship Watch • Source GitHub Unwrapped - Personalized Year in Review Try • Source View more in the Remotion Showcase ! Get started If you already have Node.JS installed, type npx create-video@latest to get started. Otherwise, read the installation page in the documentation. Documentation Documentation: remotion.dev/docs API Reference: remotion.dev/api License Be aware of that Remotion has a special license and requires obtaining a company license in some cases. Read the LICENSE page for more information. Contributing Please read CONTRIBUTING.md to learn about contributing to this project. About 🎥 Make videos programmatically with React remotion.dev Topics react javascript video Resources Readme License View license Code of conduct Code of conduct Contributing Contributing Uh oh! There was an error while loading. Please reload this page . Activity Custom properties Stars 29.1k stars Watchers 107 watching Forks 1.7k forks Report repository Releases 571 v4.0.409 Latest Jan 22, 2026 + 570 releases Sponsor this project Uh oh! There was an er"
    },
    {
      "source": "GitHub Trending",
      "title": "VectifyAI/PageIndex - 📑 PageIndex: Document Index for Vectorless, Reasoning-based RAG",
      "url": "https://github.com/VectifyAI/PageIndex",
      "heat": "7,865 stars",
      "time": "Today",
      "content": "GitHub - VectifyAI/PageIndex: 📑 PageIndex: Document Index for Vectorless, Reasoning-based RAG Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert VectifyAI / PageIndex Public Notifications You must be signed in to change notification settings Fork 594 Star 7.9k 📑 PageIndex: Document Index for Vectorless, Reasoning-based RAG pageindex.ai License MIT license 7.9k stars 594 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings VectifyAI/PageIndex main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 231 Commits cookbook cookbook pageindex pageindex tests tests tutorials tutorials .gitattributes .gitattributes .gitignore .gitignore CHANGELOG.md CHANGELOG.md LICENSE LICENSE README.md README.md requirements.txt requirements.txt run_pageindex.py run_pageindex.py View all files Repository files navigation Reasoning-based RAG  ◦  No Vector DB  ◦  No Chunking  ◦  Human-like Retrieval 🏠 Homepage • 🖥️ Chat Platform • 🔌 MCP • 📚 Docs • 💬 Discord • ✉️ Contact 📢 Latest Updates 🔥 Releases: PageIndex Chat : The first human-like document-analysis agent platform built for professional long documents. Can also be integrated via MCP or API (beta). 📝 Articles: PageIndex Framework : Introduces the PageIndex framework — an agentic, in-context tree index that enables LLMs to perform reasoning-based , human-like retrieval over long documents, without vector DB or chunking. 🧪 Cookbooks: Vectorless RAG : A minimal, hands-on example of reasoning-based RAG using PageIndex. No vectors, no chunking, and human-like retrieval. Vision-based Vectorless RAG : OCR-free, vision-only RAG with PageIndex's reasoning-native retrieval workflow that works directly over PDF page images. 📑 Introduction to PageIndex Are you frustrated with vector database retrieval accuracy for long professional documents? Traditional vector-based RAG relies on semantic similarity rather than true relevance . But similarity ≠ relevance — what we truly need in retrieval is relevance , and that requires reasoning . When working with professional documents that demand domain expertise and multi-step reasoning, similarity search often falls short. Inspired by AlphaGo, we propose PageIndex — a vectorless , reasoning-based RAG system that builds a hierarchical tree index from long documents and uses LLMs to reason over that index for agentic, context-aware retrieval . It simulates how human experts navigate and extract knowledge from complex documents through tree search , enabling LLMs to think and reason their way to the most relevant document sections. PageIndex performs retrieval in two steps: Generate a “Table-of-Contents” tree structure index of documents Perform reasoning-"
    },
    {
      "source": "GitHub Trending",
      "title": "OpenBMB/UltraRAG - UltraRAG v3: A Low-Code MCP Framework for Building Complex and Innovative RAG Pipelines",
      "url": "https://github.com/OpenBMB/UltraRAG",
      "heat": "3,287 stars",
      "time": "Today",
      "content": "GitHub - OpenBMB/UltraRAG: UltraRAG v3: A Low-Code MCP Framework for Building Complex and Innovative RAG Pipelines Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert OpenBMB / UltraRAG Public Notifications You must be signed in to change notification settings Fork 247 Star 3.3k UltraRAG v3: A Low-Code MCP Framework for Building Complex and Innovative RAG Pipelines ultrarag.openbmb.cn/ License Apache-2.0 license 3.3k stars 247 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings OpenBMB/UltraRAG main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 336 Commits .github .github data data docs docs examples examples prompt prompt script script servers servers src/ ultrarag src/ ultrarag ui ui .env.dev .env.dev .gitignore .gitignore Dockerfile Dockerfile LICENSE.txt LICENSE.txt README.md README.md pyproject.toml pyproject.toml uv.lock uv.lock View all files Repository files navigation Less Code, Lower Barrier, Faster Deployment | Documentation | Dataset | Paper Daily | 简体中文 | English | Latest News 🔥 [2026.01.23] 🎉 UltraRAG 3.0 Released: Say no to \"black box\" development—make every line of reasoning logic clearly visible 👉| 📖 Blog | [2026.01.20] 🎉 AgentCPM-Report Model Released! DeepResearch is finally localized: 8B on-device writing agent AgentCPM-Report is open-sourced 👉 | 🤗 Model | Previous News [2025.11.11] 🎉 UltraRAG 2.1 Released: Enhanced knowledge ingestion & multimodal support, with a more complete unified evaluation system! [2025.09.23] New daily RAG paper digest, updated every day 👉 | 📖 Papers | [2025.09.09] Released a Lightweight DeepResearch Pipeline local setup tutorial 👉 | 📺 bilibili | 📖 Blog | [2025.09.01] Released a step-by-step UltraRAG installation and full RAG walkthrough video 👉 | 📺 bilibili | 📖 Blog | [2025.08.28] 🎉 UltraRAG 2.0 Released! UltraRAG 2.0 is fully upgraded: build a high-performance RAG with just a few dozen lines of code, empowering researchers to focus on ideas and innovation! We have preserved the UltraRAG v2 code, which can be viewed at v2 . [2025.01.23] UltraRAG Released! Enabling large models to better comprehend and utilize knowledge bases. The UltraRAG 1.0 code is still available at v1 . About UltraRAG UltraRAG is the first lightweight RAG development framework based on the Model Context Protocol (MCP) architecture design, jointly launched by THUNLP at Tsinghua University, NEUIR at Northeastern University, OpenBMB , and AI9stars . Designed for research exploration and industrial prototyping, UltraRAG standardizes core RAG components (Retriever, Generation, etc.) as independent MCP Servers , combined with the powerful workflow orchestration capabilities of the MCP Client . "
    },
    {
      "source": "GitHub Trending",
      "title": "browser-use/browser-use - 🌐 Make websites accessible for AI agents. Automate tasks online with ease.",
      "url": "https://github.com/browser-use/browser-use",
      "heat": "76,597 stars",
      "time": "Today",
      "content": "GitHub - browser-use/browser-use: 🌐 Make websites accessible for AI agents. Automate tasks online with ease. Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert browser-use / browser-use Public Notifications You must be signed in to change notification settings Fork 9.1k Star 76.6k 🌐 Make websites accessible for AI agents. Automate tasks online with ease. browser-use.com License MIT license 76.6k stars 9.1k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings browser-use/browser-use main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 8,206 Commits .github .github bin bin browser_use browser_use docker docker docs docs examples examples skills/ browser-use skills/ browser-use static static tests tests .dockerignore .dockerignore .env.example .env.example .gitattributes .gitattributes .gitignore .gitignore .pre-commit-config.yaml .pre-commit-config.yaml .python-version .python-version AGENTS.md AGENTS.md CLAUDE.md CLAUDE.md CLOUD.md CLOUD.md Dockerfile Dockerfile Dockerfile.fast Dockerfile.fast LICENSE LICENSE README.md README.md pyproject.toml pyproject.toml View all files Repository files navigation 🌤️ Want to skip the setup? Use our cloud for faster, scalable, stealth-enabled browser automation! 🤖 LLM Quickstart Direct your favorite coding agent (Cursor, Claude Code, etc) to Agents.md Prompt away! 👋 Human Quickstart 1. Create environment with uv (Python>=3.11): uv init 2. Install Browser-Use package: # We ship every day - use the latest version! uv add browser-use uv sync 3. Get your API key from Browser Use Cloud and add it to your .env file (new signups get $10 free credits): # .env BROWSER_USE_API_KEY=your-key 4. Install Chromium browser: uvx browser-use install 5. Run your first agent: from browser_use import Agent , Browser , ChatBrowserUse import asyncio async def example (): browser = Browser ( # use_cloud=True, # Uncomment to use a stealth browser on Browser Use Cloud ) llm = ChatBrowserUse () agent = Agent ( task = \"Find the number of stars of the browser-use repo\" , llm = llm , browser = browser , ) history = await agent . run () return history if __name__ == \"__main__\" : history = asyncio . run ( example ()) Check out the library docs and the cloud docs for more! 🔥 Deploy on Sandboxes We handle agents, browsers, persistence, auth, cookies, and LLMs. The agent runs right next to the browser for minimal latency. from browser_use import Browser , sandbox , ChatBrowserUse from browser_use . agent . service import Agent import asyncio @ sandbox () async def my_task ( browser : Browser ): agent = Agent ( task = \"Find the top HN post\" , browser = browser , llm = ChatBrowserUse ()) await agent . run ()"
    },
    {
      "source": "GitHub Trending",
      "title": "block/goose - an open source, extensible AI agent that goes beyond code suggestions - install, execute, edit, and test with any LLM",
      "url": "https://github.com/block/goose",
      "heat": "27,852 stars",
      "time": "Today",
      "content": "GitHub - block/goose: an open source, extensible AI agent that goes beyond code suggestions - install, execute, edit, and test with any LLM Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert block / goose Public Notifications You must be signed in to change notification settings Fork 2.5k Star 27.9k an open source, extensible AI agent that goes beyond code suggestions - install, execute, edit, and test with any LLM block.github.io/goose/ License Apache-2.0 license 27.9k stars 2.5k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings block/goose main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 3,253 Commits .devcontainer .devcontainer .github .github .husky .husky .intersect .intersect bin bin clippy-baselines clippy-baselines crates crates documentation documentation examples examples recipe-scanner recipe-scanner scripts scripts ui ui .dockerignore .dockerignore .gitattributes .gitattributes .gitignore .gitignore .goosehints .goosehints ACCEPTABLE_USAGE.md ACCEPTABLE_USAGE.md AGENTS.md AGENTS.md BUILDING_DOCKER.md BUILDING_DOCKER.md BUILDING_LINUX.md BUILDING_LINUX.md CONTRIBUTING.md CONTRIBUTING.md CONTRIBUTING_RECIPES.md CONTRIBUTING_RECIPES.md Cargo.lock Cargo.lock Cargo.toml Cargo.toml Cross.toml Cross.toml Dockerfile Dockerfile GOVERNANCE.md GOVERNANCE.md HOWTOAI.md HOWTOAI.md Justfile Justfile LICENSE LICENSE MAINTAINERS.md MAINTAINERS.md README.md README.md RELEASE.md RELEASE.md SECURITY.md SECURITY.md download_cli.ps1 download_cli.ps1 download_cli.sh download_cli.sh flake.lock flake.lock flake.nix flake.nix goose-self-test.yaml goose-self-test.yaml recipe.yaml recipe.yaml run_cross_local.md run_cross_local.md rust-toolchain.toml rust-toolchain.toml test_acp_client.py test_acp_client.py View all files Repository files navigation goose a local, extensible, open source AI agent that automates engineering tasks goose is your on-machine AI agent, capable of automating complex development tasks from start to finish. More than just code suggestions, goose can build entire projects from scratch, write and execute code, debug failures, orchestrate workflows, and interact with external APIs - autonomously . Whether you're prototyping an idea, refining existing code, or managing intricate engineering pipelines, goose adapts to your workflow and executes tasks with precision. Designed for maximum flexibility, goose works with any LLM and supports multi-model configuration to optimize performance and cost, seamlessly integrates with MCP servers, and is available as both a desktop app as well as CLI - making it the ultimate AI assistant for developers who want to move faster and focus on innovation. Quick L"
    },
    {
      "source": "Weibo Hot Search",
      "title": "亚洲杯",
      "url": "https://s.weibo.com/weibo?q=%E4%BA%9A%E6%B4%B2%E6%9D%AF&Refer=top",
      "heat": "1105845",
      "time": "Real-time",
      "content": "Sina Visitor System"
    },
    {
      "source": "Weibo Hot Search",
      "title": "两个消失的顶流歌手都回归了",
      "url": "https://s.weibo.com/weibo?q=%E4%B8%A4%E4%B8%AA%E6%B6%88%E5%A4%B1%E7%9A%84%E9%A1%B6%E6%B5%81%E6%AD%8C%E6%89%8B%E9%83%BD%E5%9B%9E%E5%BD%92%E4%BA%86&Refer=top",
      "heat": "784669",
      "time": "Real-time",
      "content": "Sina Visitor System"
    },
    {
      "source": "Weibo Hot Search",
      "title": "太空月季回来了",
      "url": "https://s.weibo.com/weibo?q=%E5%A4%AA%E7%A9%BA%E6%9C%88%E5%AD%A3%E5%9B%9E%E6%9D%A5%E4%BA%86&Refer=top",
      "heat": "616765",
      "time": "Real-time",
      "content": "Sina Visitor System"
    },
    {
      "source": "Weibo Hot Search",
      "title": "何不同舟渡",
      "url": "https://s.weibo.com/weibo?q=%E4%BD%95%E4%B8%8D%E5%90%8C%E8%88%9F%E6%B8%A1&Refer=top",
      "heat": "314647",
      "time": "Real-time"
    },
    {
      "source": "Weibo Hot Search",
      "title": "平台已下架涉事娃娃菜商家商品",
      "url": "https://s.weibo.com/weibo?q=%E5%B9%B3%E5%8F%B0%E5%B7%B2%E4%B8%8B%E6%9E%B6%E6%B6%89%E4%BA%8B%E5%A8%83%E5%A8%83%E8%8F%9C%E5%95%86%E5%AE%B6%E5%95%86%E5%93%81&Refer=top",
      "heat": "284959",
      "time": "Real-time",
      "content": "Sina Visitor System"
    },
    {
      "source": "Tencent News",
      "title": "采取“最大限度封闭形式”，泽连斯基：俄美乌会谈首轮难下结论",
      "url": "https://view.inews.qq.com/a/20260124A016EA00",
      "time": "2026-01-24 06:22:07",
      "content": "视频丨采取“最大限度封闭形式” 泽连斯基：俄美乌会谈首轮难下结论_腾讯新闻 视频丨采取“最大限度封闭形式” 泽连斯基：俄美乌会谈首轮难下结论 央视新闻 2026-01-24 06:22 发布于 北京 中央广播电视总台央视新闻官方账号 由俄罗斯、美国、乌克兰三国代表组成的安全问题工作组23日晚在阿联酋首都阿布扎比举行首次会谈。此次会谈是2022年2月俄乌冲突升级以来，俄罗斯、美国和乌克兰首次举行三方接触。 △俄美乌首日会谈画面 当地时间1月23日， 总台记者 获悉，阿联酋总统穆罕默德会见了正在阿联酋首都阿布扎比参加俄美乌三方会谈的各代表团团长。 穆罕默德总统表示，他期待会谈能够取得积极成果，希望相关磋商能为结束持续多年的冲突作出实质性贡献。他重申，阿联酋始终致力于推动建设性对话，支持国际社会为解决地区和全球危机、冲突所作的各项外交努力。 会谈首轮以“最大限度封闭的形式”进行 据悉，会谈于当地时间1月23日在阿布扎比开始。美方由总统特使威特科夫和特朗普女婿库什纳出席，俄方由总参谋部情报总局局长科斯秋科夫带队，乌方代表团团长则为乌克兰国家安全与国防委员会秘书乌梅罗夫。 据消息人士称，三方 会谈首轮以“最大限度封闭的形式”进行，会议期间不对媒体开放。 三方会谈 领土问题成焦点 此次会谈，领土问题备受关注。俄罗斯总统助理乌沙科夫23日称，俄美双方在22日深夜进行的会谈中再次明确指出， 若不能按照此前在安克雷奇达成的共识解决领土问题，就没有希望达成长期解决方案 。俄方真诚希望通过政治和外交手段解决乌克兰危机，但只要这一目标尚未达成，俄罗斯将继续在战场上推进特别军事行动的目标。 分析认为，尽管各方立场分歧依然明显，短期内达成全面和平协议的可能性有限，但如果能够就局部停火、战俘交换或保障粮食和能源通道安全形成共识，仍将被视为重要的“破冰”成果，也有助于为后续谈判积累信任基础。具体情况仍有待进一步观察。 泽连斯基：目前就谈判内容下结论为时过早 △泽连斯基（资料图） 乌克兰总统泽连斯基23日在其晚间例行视频讲话中表示，目前在阿联酋，乌克兰、美国和俄罗斯代表团在进行会谈，乌克兰代表团几乎每小时向其汇报情况。他指出，此次三方会谈十分重要，因为长期以来未曾出现类似的三方会谈形式。 泽连斯基称，当前谈判重点在于结束冲突的具体条件，现在俄罗斯至少应该给出部分回应，关键在于俄方是否准备结束冲突。他表示，乌克兰的立场很明确，他已经为代表团确定了对话框架。 泽连斯基同时透露，明天乌克兰武装部队总参谋长格纳托夫和乌克兰国防部情报总局副局长斯基比茨基也将加入谈判。泽连斯基表示， 目前就谈判内容下结论还为时过早，将观察24日的谈判进展和结果 。 会谈继续 冲突未歇 据内部人士消息称， 俄美乌三方将于24日在阿布扎比继续会谈 。与此同时，俄乌冲突前线战火未歇。 俄罗斯国防部23日通报称，过去一周，俄军实施了一次大规模打击和五次集群打击，目标包括乌军军事工业设施、能源和交通基础设施、弹药与燃料库、乌武装部队及外国雇佣兵的临时部署点等；俄防空系统一周内拦截乌军1468架固定翼无人机。此外，俄军在哈尔科夫、顿涅茨克、扎波罗热等地控制了5个定居点。 乌克兰武装部队总参谋部同一天通报称，过去一天前线地区发生222次战斗，乌军在多个方向击退俄军上百次进攻。乌空军、导弹部队和炮兵对俄军2处人员和武器装备集中区、1处炮兵阵地进行了打击；击落俄军449架战术级无人机。 监制丨郑弘 制片人丨赵新宇 编辑丨孙蒙 记者丨王斌 王晋燕 程谟 李曌 ©2026中央广播电视总台版权所有。未经许可，请勿转载使用。"
    },
    {
      "source": "Tencent News",
      "title": "U23国足3-0含金量拉满？越南少1人仍首胜韩国！6战5胜轰10球创纪录",
      "url": "https://view.inews.qq.com/a/20260124A01BQJ00",
      "time": "2026-01-24 07:13:18",
      "content": "U23国足3-0含金量拉满？越南少1人仍首胜韩国！6战5胜轰10球创纪录_腾讯新闻 U23国足3-0含金量拉满？越南少1人仍首胜韩国！6战5胜轰10球创纪录 我爱英超 2026-01-24 07:13 发布于 广东 体育领域创作者 在北京时间1月24日结束的 U23亚洲杯 三四名决赛中，越南队在少打1人的情况下，在120分钟内2-2逼平韩国队，并且在点球大战中7罚7中，最终总比分9-8击败对手，摘得本届亚洲杯季军的殊荣。 这也是越南队近8年，在U23亚洲杯的最佳战绩 。 本届U23亚洲杯，这支越南队整体表现相当出色：小组赛3连胜出线，包括1-0力挫东道主沙特，让这支身价最高的球队小组出局。 淘汰赛，越南队继续前进，最终交出6战5胜1负狂轰10球的成绩单；而他们唯一的一场失利，正是半决赛被 U23国足 3-0正面击败。 那场半决赛，中国U23在下半场“开闸”连入三球：彭啸、 向余望 、 王钰栋 先后破门，把越南U23从“冲冠轨道”上直接拉了下来，也帮助中国队队史首次闯入U23亚洲杯决赛。 这是越南队本届亚洲杯6场比赛唯一的失利。随后的三四名决赛，越南队即便下半场头牌球星阮庭北飞铲被罚下，他们也一度遭遇韩国队绝平，但加时赛顽强的越南队力保球门不失，最终熬到点球大战取胜，这也是越南队史首次在U23亚洲杯击败韩国队。 可以说，U23国足那场3球大胜堪称含金量十足，如果没有U23国足的狙击，或许越南真的有机会刷新自己8年前创造的亚洲杯亚军的最佳战绩。 这也侧面展现了，这支U23国足确实是近10年最强一代，是中国足球触底反弹的希望。"
    },
    {
      "source": "Tencent News",
      "title": "越共第十四届中央政治局成员名单公布",
      "url": "https://view.inews.qq.com/a/20260123A077GC00",
      "time": "2026-01-23 18:33:49",
      "content": "越共第十四届中央政治局成员名单公布_腾讯新闻 越共第十四届中央政治局成员名单公布 观察者网 2026-01-23 18:33 发布于 上海 观察者网官方账号 越南政府新闻网消息，1月23日，越共第十四届中央委员会召开第一次会议，选举第十四届中央政治局、总书记、中央书记处。十四届越共中央政治局委员一共19人，其中10人为上一届政治局委员留任，9人为新晋。 以下为越共第十四届中央政治局成员名单及照片。 一、越共中央总书记、中央军委书记苏林； 二、越共中央政治局委员、越南国会党委书记、国会主席陈青敏； 三、越共中央政治局委员、中央书记处常务书记、中央机关党委书记陈锦秀； 四、越共中央政治局委员、中央书记处书记、中央组织部部长黎明兴； 五、越共中央政治局委员、越南国会党委常务副书记、国会常务副主席杜文战； 六、越共中央政治局委员、越共中央书记处书记、越南祖国阵线和中央各群众团体党委书记、越南祖国阵线中央委员会主席裴氏明怀； 七、越共中央政治局委员、越南政府党委常委会委员、中央军委副书记、越南国防部部长潘文江； 八、越共中央政治局委员、越南政府党委常委会委员、越共中央公安党委书记、越南公安部部长梁三光； 九、越共中央政治局委员、河内市委书记阮维玉； 十、越共中央政治局委员、越共中央书记处书记、中央军委常委会委员、越南人民军队总政治局主任阮仲义； 十一、越共中央书记处书记、越共中央宣教与民运部部长郑文决； 十二、越共中央书记处书记、越南政府党委常委会委员、外交部部长黎怀忠； 十三、越共中央书记处书记、越共中央内政部常务副部长黎明智； 十四、越共中央书记处书记、胡志明市市委书记陈流光； 十五、越共中央委员、越共中央办公厅主任范嘉足； 十六、越共中央委员、中央检查委员会主任陈士青； 十七、越共中央委员、中央政策与战略部部长阮青毅； 十八；越共中央委员、胡志明国家政治学院党委常务副书记、胡志明国家政治学院常务副院长段明训； 十九、越共中央委员、越南政府党部委员会委员、农业与环境部党委书记、部长陈德胜。 本文系观察者网独家稿件，未经授权，不得转载。"
    },
    {
      "source": "Tencent News",
      "title": "中国第三个10万亿大省，来了",
      "url": "https://view.inews.qq.com/a/20260123A05DNY00",
      "time": "2026-01-23 16:00:24",
      "content": "中国第三个10万亿大省，来了_腾讯新闻 中国第三个10万亿大省，来了 国民经略 2026-01-23 16:00 发布于 广东 文|凯风 10万亿俱乐部 ，再次扩容。 最新经济数据揭晓，2025年山东 GDP 达10.3万亿，浙江为9.45万亿，同比增速双双达到5.5%，分居全国第三、第四位。 这意味着，继广东、江苏之后， 山东跃居中国第三个、北方第一个10万亿经济大省 。 10万亿经济体量，放在全球可排在15位左右，与土耳其、印尼相当，远超荷兰、沙特等国。 10万亿能带来什么？谁是下一个10万亿大省？ 01 GDP破10万亿，北方第一大省靠什么？ 每一个经济大省，都有众多经济强市勇挑增长大梁，广深之于广东，苏宁之于江苏，杭甬之于浙江。 济青之于山东也是如此。作为副省级市， 济南、青岛共同唱响“双城记” ，以“省会+计划单列市”的组合，诠释多中心发展模式。 在刚过去的2025年，青岛GDP迈过1.7万亿大关，济南超过1.4万亿，合计占全省经济比重30%以上。 青岛是 北方第二城 的有力竞争者，离天津只有一步之遥。根据规划， 青岛要在2028年突破2万亿。 可以看出，山东没有强省会，而是“ 双子星城 ”齐头并进，就连一众腰部城市，也不乏独当一面的能力。 山东省下辖16个地市，济青之外， 烟台已跻身万亿俱乐部，潍坊向着万亿进军 ，临沂、济宁、淄博都在5000亿以上。 这一格局的形成，既有交通区位的影响，也与资源禀赋、产业结构有关，从而带动产业多点开花。 烟台的海工装备、绿色石化，潍坊的动力装备，临沂的物流之都，东营的石化，日照的钢铁……都是这一逻辑的体现。 相对均衡的区域经济布局，各有所长的产业布局，让山东形成大而全、大而稳的发展模式。 02 经济大省，无一不是工业大省。 每一个经济大省，都有一个或N个响当当的支柱产业，电子信息、汽车之于广东，通信、化工之于江苏，数字经济之于浙江。 不同于其他工业大省， 山东则是我国唯一拥有全部41个工业大类的省份 ，堪称大国工业“全谱系”代表。 从挖一吨煤、炼一炉钢、造一台发动机、组一辆整车再到造一列动车组，几乎无所不包。 与之对比，广东没有煤矿开采业，江苏缺少“开采专业及辅助性活动业”，只有山东一应俱全。 粤苏都以电子制造业为第一大支柱， 山东则以化工为最大支柱 ，装备制造其次，消费品、信息技术均超2万亿元，冶金达到1.5万亿元。 可见，山东重工业尤其是重化工业特色鲜明，大工业历来都是拉动GDP的利器。 数据显示，山东18个制造业大类营收居全国前5，化工产业占全国1/5、食品占11%左右，生产了全国35%的商用车、50%的动车组、80%的深海钻井平台。 大工业的特点是稳，不会轻易剧烈波动，但在新一轮科技革命冲击之下，也带来 新旧动能转换 难题。 从新能源汽车到 低空经济 再到 人工智能 ，新兴产业和未来产业正在重塑竞争格局。 与粤苏浙京沪相比，山东研发强度不足、新兴产业不够强大、外来人口吸引力相对不足，成为发展制约。 为此，早在2018年，国务院批复设立山东新旧动能转换综合试验区，这是全国唯一以新旧动能为主题的试验区。 根据“十五五”规划建议，山东提出打造人工智能、集成电路、新能源、新材料、航空航天高技术船舶、新型电池、绿色环保等新兴支柱产业，布局深海空天、 具身智能 等未来产业。 传统产业负责兜底，新兴产业着眼于突破，山东的雄心不止于10万亿。 03 扭转南北差距，北方经济大省该发力了。 国家“十五五”规划建议提出，“促进东中西、南北方协调发展”。 过去，东西差距更受关注。但随着西部大开发、中部崛起战略推进，东西差距持续收窄，但南北差距却有所放大。 过去10多年来 ，北方省份占全国GDP比重从42.9%降到35.2% ，南方则进一步上升到64.8%，十强市中只剩北京一席。 扭转南北差距，将成为未来区域战略的重点。 山东、河南、北京、河北等北方经济重镇，将要担起重任。 作为北方经济第一大省，在2035规划中， 山东被赋予“北方地区经济发展的 战略支点 ” 的超级定位。 要想成为“战略支点”，经济实力必然要强，产业不能弱，更要有区域带动力，这是山东的机遇，也是北方大省的机遇。 04 谁是下一个10万亿经济大省？ 2025年 浙江GDP 达到9.45万亿，快则2026年、迟则2027年，将晋级10万亿俱乐部。 浙江同样经济强市林立。日前，温州官宣跻身万亿俱乐部，成为浙江杭州、宁波之后的第三座万亿之城。 过去几年，浙江经济增速跑赢全国，主要在于先后踩中两大时代风口： 数字经济、人工智能。 在数字经济时代，浙江成为互联网电商的重镇，并赋能传统“ 块状经济 ”持续转型升级。 在人工智能时代，浙江的大模型、具身智能、智能终端齐头并进，人工智能核心产业领跑于全国。 更何况，浙江还是民营经济高地，区域发展均衡，新兴产业抢先卡位，未来不乏更进一步的可能。 在浙江之后，四川、河南、湖北等地尚在6万亿区间，要突破10万亿，至少需要5-10年左右的时间。"
    },
    {
      "source": "Tencent News",
      "title": "外籍货船在中国黄岩岛附近海域遇险，中国海警已救起17人",
      "url": "https://view.inews.qq.com/a/20260123A04U1S00",
      "time": "2026-01-23 15:05:02"
    },
    {
      "source": "V2EX",
      "title": "昨天试了下 telegram，+86 手机号登录居然要收费了！",
      "url": "https://www.v2ex.com/t/1187997",
      "heat": "60 replies",
      "time": "Hot",
      "content": "昨天试了下 telegram，+86 手机号登录居然要收费了！ - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 › Telegram Messenger › Telegram Messenger for iOS › Telegram Messenger for Android › MTProto › Telegram Bot Platform V2EX › Telegram 昨天试了下 telegram，+86 手机号登录居然要收费了！ Croow · 12 小时 6 分钟前 · 4807 次点击 电报我一般用来当网盘用，现在+86 登录既然要收会员费一周好像 7 块，大佬们有没有其他可以替代的软件推荐？ 第 1 条附言  · 3 小时 49 分钟前 有大佬发帖提供了解决方案： https://www.v2ex.com/t/1188026?p=1 Telegram 收费 替代 60 条回复 • 2026-01-24 19:28:05 +08:00 1 bzkmsjy 12 小时 2 分钟前 via Android 安卓退回 2024 年 12 月份的版本可以直接登录，2025 年的全都不行，登录上了再更新到最新版 2 Autonomous 12 小时 2 分钟前 找个接码平台啊 3 Croow OP 12 小时 0 分钟前 @ bzkmsjy 这后面修复了，就还是得老老实实买会员￣□￣｜｜ 4 Croow OP 11 小时 59 分钟前 1 @ Autonomous 接码平台应该没用吧，现在登录都是收手机号-绑邮箱-充钱 才能进主页面 5 Walk52 11 小时 50 分钟前 搞个国外手机号，giffgiff ，中介几块钱包邮 6 piaochen0 11 小时 50 分钟前 好奇电报怎么当网盘用？ 7 Croow OP 11 小时 48 分钟前 1 @ piaochen0 自己建个群聊，往里面传片罒ω罒 8 piaochen0 11 小时 45 分钟前 @ Croow 有容量限制吗？上传大小有限制吗？文件能保存多久会不会被清除掉？ 9 Croow OP 11 小时 44 分钟前 @ piaochen0 没有任何限制，你不删除群聊，文件就不会丢，还不会有被和谐的风险 10 Walk52 11 小时 44 分钟前 版本 12.3.1 没提示收费 11 nifan 11 小时 43 分钟前 我买了个奥地利的手机号，直接被禁用，申请多次解封都不给过 12 Croow OP 11 小时 42 分钟前 @ piaochen0 想来一发的时候就可以在后宫库选一个了，不用存在手机本地占内存。 13 Croow OP 11 小时 41 分钟前 @ Walk52 登出再重登，强制收费。25 年的所有版本都加了这个功能。 14 Croow OP 11 小时 41 分钟前 @ nifan 我怕那天国区也被禁了，想找个平替。 15 54xavier 11 小时 38 分钟前 11 如果你的账号还有任一终端在线，立即申请一个 passkey ，然后只要你的 passkey 可以同步，所有需要登录的地方都可以用 passkey 代替，无需短信验证码。 16 54xavier 11 小时 37 分钟前 我是用的 google 的密码同步，在 小米 上折腾了一番 passkey 最后解决了。 17 uCharles 11 小时 36 分钟前 @ Croow #12 这个 idea 不错耶 18 Mar5 11 小时 35 分钟前 搞个非中国大陆手机号就行了啊，又不贵。 19 Croow OP 11 小时 34 分钟前 @ uCharles 我都这样搞几年了，哈哈哈 20 v00O 11 小时 27 分钟前 当网盘，存一些资料和文字记录等，好主意😂 21 choryan 11 小时 22 分钟前 @ Mar5 #18 非大陆号码也收费的 22 Autonomous 11 小时 21 分钟前 @ Croow 我都是用的 Passkey ，还有扫码登录，可以跳过短信验证码 23 shenyiyouge 11 小时 21 分钟前 绑定邮箱呀，新版本还有 passkey ，而且不是每周 7 块，是一次性的，送一周会员 24 Mar5 11 小时 19 分钟前 @ choryan 多设备互相收码或者搞个 passkey 啊 25 Croow OP 11 小时 13 分钟前 @ choryan 我谷歌搜了下，马来西亚也收费，美国本土好像没收费 26 Croow OP 11 小时 12 分钟前 @ shenyiyouge 我去试试 passkey ，我知道 7 块只是一个登录门槛 27 nxuu 11 小时 11 分钟前 这个破软件 不是俄罗斯的盟友搞得么 28 villivateur 11 小时 1 分钟前 搞个 Google Voice 吧 29 crocoBaby 10 小时 45 分钟前 用 WIFI 登录可以免收，用蜂窝需要 30 Croow OP 10 小时 40 分钟前 @ crocoBaby ？我咋用 wifi ，蜂窝都要 31 ninjaJ 10 小时 24 分钟前 @ Croow #7 我有个朋友说他想进群，我拦不住 32 viking000 10 小时 19 分钟前 @ 54xavier #15 请问怎么搞，我 PC 上显示要插入 U 盘呢。。。 33 atrexl 10 小时 17 分钟前 @ Croow #12 真是个小聪明 34 cleanFunky 10 小时 9 分钟前 @ Croow 兄弟，我这辈子没求过人 35 Croow OP 10 小时 6 分钟前 @ cleanFunky ？啥意思 36 love4taylor PRO 9 小时 33 分钟前 @ Croow 群聊没验证过，私聊文件真的会丢一直卡 0b 下载。 37 joynvda 9 小时 9 分钟前 @ villivateur GV 应该秒封。而且，所谓收费是 1 周 premium 会员，跟是否封没有关系。我的理解纯属这帮人想钱想疯了。 我的经历：新 iphone ，用 GV 注册可以收到验证码，但是提示收 1.18 刀的一周 premium 会员费；想着还算合理吧就 apple pay 付了。 一周后，刚好 premium 会员结束；就把账号给封了说违法 TOS ；我就拿这个账号收一下群聊、频道，也没有加任何人或者发任何的信息。提交上诉秒拒。 复盘被拒的原因：GV 号，vpn 联网 后来写邮件、网页提交再次上诉，也没有回应。 38 saltedfishgames 9 小时 4 分钟前 @ 54xavier 安卓有啥 passkey 软件么？试了谷歌密码管理，tg 仍然提示无 paskey 软件支持 39 villivateur 8 小时 48 分钟前 @ joynvda 可能现在越来越严格了吧，我 GV 用了八九年了也没封 40 Croow OP 8 小时 11 分钟前 @ joynvda 惨 41 Croow OP 8 小时 10 分钟前"
    },
    {
      "source": "V2EX",
      "title": "iPhone Air 居然降到 5499，喜欢的可以冲了。25 号晚上抢购",
      "url": "https://www.v2ex.com/t/1187990",
      "heat": "55 replies",
      "time": "Hot",
      "content": "iPhone Air 居然降到 5499，喜欢的可以冲了。25 号晚上抢购 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 Support › 根据产品序列号查看状态 有用链接 › Apple 产品更新周期 › Other World Computing 性能升级 › Apple 软件 Beta 测试 V2EX › Apple iPhone Air 居然降到 5499，喜欢的可以冲了。25 号晚上抢购 tyrad · 13 小时 41 分钟前 via iPhone · 4749 次点击 看完 Air 销量实在不行，搞活动降价限购 13,000 台 79990 减 2000 叠加国补 5499 天猫苹果旗舰店 这个价格真香啊😬 理智告诉我克制克制 iPhone Air 天猫 55 条回复 • 2026-01-24 21:41:23 +08:00 1 Asanwos 13 小时 35 分钟前 渠道商都来进货了，抢得到么。。。 2 ysxb1145 13 小时 9 分钟前 via Android 叽里咕噜说啥呢，有这个钱我干嘛不买标准版，为什么要花大价钱买配置更阉割的版本。要是卖 se 的价也行 3 gtchan13579 12 小时 59 分钟前 @ ysxb1145 #2 除了摄像头其他配置都比标准版高吧 19pro+12G 内存 刷新率也是 120 4 tyrad OP 12 小时 57 分钟前 via iPhone @ ysxb1145 所以不买，理性消费 5 mode171 12 小时 54 分钟前 什么时候，支持双卡，我真的会考虑。 6 wweerrgtc 12 小时 42 分钟前 via iPhone 这个价格属实不错 7 gigmrhlc 12 小时 18 分钟前 都买苹果了，当然是美版无锁。万一给搞个内置反诈，无法卸载。看你恶心不恶心。 8 Jim142857 12 小时 13 分钟前 @ gtchan13579 17 不也是 120 吗 9 orangy 12 小时 12 分钟前 via iPhone @ gigmrhlc #7 美版不能用国内 eSIM 啊🌚 10 Autonomous 12 小时 9 分钟前 两个月前在 PDD 买的，¥6903 ，现在看确实亏大了 11 liu731 PRO 12 小时 8 分钟前 esim 要去营业厅就很烦 12 nenseso 12 小时 8 分钟前 esim 卡好办吗?有没有什么副作用 13 0x0x 12 小时 6 分钟前 via Android 准备抢一下试试了。7999 偏贵，5499 可以买个体验下。 14 badreamm 12 小时 1 分钟前 太难抢了 15 wu67 11 小时 57 分钟前 超绝阉割 esim+超小电池，这个价格有什么香的，反正我买了丐版 17 16 0U0 11 小时 56 分钟前 单扬声器，接受不了 17 lxh0412 11 小时 55 分钟前 买来背个充电宝，不累吗？ 18 mr2xd 11 小时 55 分钟前 电池容量和充电速度都不如 17 19 TerryNi 11 小时 45 分钟前 via iPhone @ mode171 Air 也可以通过 eSIM 方式写入双卡 20 18k 11 小时 36 分钟前 美丽的废物 21 joequan 11 小时 29 分钟前 清仓甩卖了，第一代的 iphone air 不会这么快就成为最后一代了吧。 22 neptuno 11 小时 15 分钟前 本来想抢一台，想了想我有 17pm ，就不冲动消费了 23 mbooyn 11 小时 11 分钟前 买了有锁 512g 的，都有点心动了，试一试嘿嘿 24 SenLief 11 小时 8 分钟前 3499 倒是可以买个电子玩具回来吃灰 25 infreboot 11 小时 4 分钟前 超小电池, 对比前一代 iphone 15Pro 。电池更大。 26 a2603230 11 小时 0 分钟前 之前还打算买 air,幸好没买,还是 promax 更值.刚出来的时候谁知道 air 跳水这么快. 27 wsjjacky 10 小时 32 分钟前 大概率是来耍猴刷存在感的，认真你就输了。 28 viking000 10 小时 25 分钟前 刚买 pro 两天，7999 ，唉 29 TUCANA 9 小时 47 分钟前 @ mode171 原来 esim 不支持双卡吗...突然不想买了 30 shuiduoduo 9 小时 45 分钟前 via iPhone 不能安装非 86 的 esim 有啥用 我也不用 86 卡 31 rick13 9 小时 38 分钟前 @ mode171 就是双卡 32 chengsheng07 9 小时 13 分钟前 主要就是扬声器太拉和电池太小，要不 5499 挺香的 33 flytutu 9 小时 11 分钟前 这个价格 配置比 17 要高 无奈 国行 esim 就是废物 34 edinina 9 小时 3 分钟前 很想买，应该抢不到，算了 35 leena 8 小时 33 分钟前 via iPhone 华强北已经整出来了 sim 改装，就是马达的地方加了 sim 卡槽😂😂😂 36 beimenjun PRO 8 小时 32 分钟前 国行 17 Air 和 17 相比，内存从 8g 涨到了 12g ，SoC 也变强了，屏幕也要更大更好，重量更轻，手感更好。 缺点主要就是扬声器弱一些、没实体卡槽、差一个广角摄像头、高强度主板散热更差、保险和维修更贵。 最大的问题还是抢不到。 7999 的 Air 我是买不动，但是 5999 就是工业奇迹了。 37 Egoisticy 8 小时 9 分钟前 @ beimenjun #36 手感不一定更好，屏幕大了，单手握持不轻松。主要是轻薄 38 so2back 8 小时 2 分钟前 5499 还挺有兴趣的，不过估计抢不到 39 moudy 6 小时 33 分钟前 via iPhone @ beimenjun soc 和内存的区别日常使用体会不大。单喇叭，小电池，单摄像头，充电慢可是实打实的体验降级。加上 esim 麻烦的要死，这机子只能跟 se 坐一桌 40 qihu3721 6 小时 29 分钟前 @ beimenjun 国外现在也是差不多 5999 ，各种极限操作下来接近 5000 （ 9 折购物卡+出境退税+零售商返利 10%） 之前小红书看到一个新加坡的人出 1TB air+ air attery + 原装透明卡+2 个 CASETiFY 壳子 一共 1450 SGD 8000 元的样子 41 snsn 6 小时 28 分钟前 via iPhone 抢不到啊 这个过年送礼挺不错的 42 fyooo 6 小时 24 分钟前 via iPhone @ gigmrhlc 美版的无锁，tb 卖 4000 不到，再加 300 改 sim 费用，不知道有没有坑 43 migim 5 小时 48 分钟前 所谓限购就是营销手段罢了，上市三个月就掉价这么多已经"
    },
    {
      "source": "V2EX",
      "title": "大家自己的代码都是放在哪儿",
      "url": "https://www.v2ex.com/t/1188008",
      "heat": "39 replies",
      "time": "Hot",
      "content": "大家自己的代码都是放在哪儿 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 › Pro Git › Atlassian Git Tutorial › Pro Git 简体中文翻译 › GitX 广告 V2EX › git 大家自己的代码都是放在哪儿 ano · 10 小时 53 分钟前 · 2411 次点击 A：GitHub （私有） B：GitHub （公开） C：自建 Git 仓库 D：GitHub+自建仓库 自建 Git 也有一大堆选择（ gitea 、gitlab 、...?）, 仓库放哪儿（云服务器、NAS 、...？） 代码托管 git 私有仓库 39 条回复 • 2026-01-24 20:46:18 +08:00 1 rick13 10 小时 51 分钟前 AB 呗，公开的还能有免费 ci 用 2 YanSeven 10 小时 48 分钟前 我自己那点儿东西还没到自建的份儿上，顶多定时电脑做备份的时候做个备份。 3 liu731 PRO 10 小时 48 分钟前 https://archiveprogram.github.com/ 4 jiuzhougege 10 小时 36 分钟前 U 盘+entware 挂路由上了 5 songyoucai 10 小时 28 分钟前 nas 上面的自建 gitlab 6 lepig 10 小时 26 分钟前 开源的就 Github 私有的 现在放腾讯工蜂 7 bootvue 10 小时 25 分钟前 内网自建 gitea openvpn 访问 8 zhouu 10 小时 16 分钟前 自建 onedev 9 docx 10 小时 11 分钟前 via iPhone 主要是 GitHub ，别处再做备份 GitHub 单点不保险 10 henix 10 小时 4 分钟前 自己的代码懒得用 git ，备份就整体 sync 到对象存储 11 Cambrian07 10 小时 2 分钟前 gitea ，也支持 actions ，很好用 12 2b6856224ysa4269 9 小时 54 分钟前 via iPhone github 13 wanniwa 9 小时 50 分钟前 github 14 ragnaroks 9 小时 43 分钟前 公开仓库 github ，私有仓库 codeup ，个人仓库 codeberg 15 balckcloud37 9 小时 13 分钟前 github 16 gmuubyssss 9 小时 3 分钟前 只有我是这样的吗？ 17 Suaxi 8 小时 59 分钟前 via Android github 一份，主力机硬盘一份，nas 单盘 basic 每个盘一份，冷备盘一份 虽然代码写得臭不可闻，但咱就是说备份这一块，必须拉满 18 avenger 8 小时 49 分钟前 via iPhone git 本身就是分布式了 还有备份的必要吗 19 avenger 8 小时 48 分钟前 via iPhone git 私有仓库 开了 pro 20 soulflysimple123 8 小时 1 分钟前 github,gitee,本地还有一份，不可能三个都蹦吧 21 ofyann 7 小时 50 分钟前 github 22 shenyuzhi 7 小时 49 分钟前 没人用 bitbucket 么。。 23 fengci 7 小时 40 分钟前 阿里云效 24 wakarimasen 7 小时 22 分钟前 via Android 代码的话，就像 Linus 说的随便公开到网上，有价值的东西自有人帮我保存… 25 spritecn 6 小时 49 分钟前 nas 上搭个 gitea 26 lone6 6 小时 23 分钟前 nas 搭建 gitea 27 whypool 6 小时 20 分钟前 没人用 gitee 么？ 30 多个项目全在上面，不过都是私有的 28 Tink PRO 6 小时 8 分钟前 github 啊 29 davehandong 6 小时 7 分钟前 自己的 gitlab 上 30 aqtata 5 小时 8 分钟前 A：GitHub （私有） 31 tlerbao 5 小时 4 分钟前 AB 32 ningshiqi17 4 小时 50 分钟前 AB 33 mtjgu 4 小时 30 分钟前 自己部署的 gitea 34 Ymk1 3 小时 59 分钟前 @ whypool gitee 安全性不太行吧。 35 kevinGuoG 1 小时 28 分钟前 gitea 36 f165af34d4830eeb 1 小时 19 分钟前 @ shenyuzhi #22 十年前入坑的时候靠 sourcetree 安利+免费 private repo 用过 bitbucket ，后面 github 也提供免费 private repo 后就没咋用过 bitbucket 了，sourcetree 倒还偶尔用下。 37 craftsmanship 1 小时 8 分钟前 via Android @ wakarimasen 有人帮你保存!=你能随时以最小成本获取 38 artiga033 1 小时 2 分钟前 via Android 适合开源或者无所谓的放 GitHub 。 特别自用目的的就丢自建仓库，但说是自建其实就是随便找个机器（云服务器或者家里 nas ） git init --bare ，懒得搞那些花里胡哨的 gitea 啥的 39 zk24 57 分钟前 A 关于 · 帮助文档 · 自助推广系统 · 博客 · API · FAQ · Solana · 2857 人在线 最高记录 6679 · Select Language 创意工作者们的社区 World is powered by solitude VERSION: 3.9.8.5 · 32ms · UTC 13:43 · PVG 21:43 · LAX 05:43 · JFK 08:43 ♥ Do have faith in what you're doing. ❯"
    },
    {
      "source": "V2EX",
      "title": "解决+86 Telegram 账号登录难题",
      "url": "https://www.v2ex.com/t/1188026",
      "heat": "32 replies",
      "time": "Hot",
      "content": "解决+86 Telegram 账号登录难题 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 › Telegram Messenger › Telegram Messenger for iOS › Telegram Messenger for Android › MTProto › Telegram Bot Platform V2EX › Telegram 解决+86 Telegram 账号登录难题 jamme · 8 小时 33 分钟前 · 2107 次点击 问题描述 不知从何时，+86 注册的 TG 账号登陆时，无法正常收到验证码。看到有人说多登陆几次会提示绑定邮箱，可用邮箱验证，但尝试未果。 适用情况 当前有一台移动设备正处于登录状态 解决方法 核心思路：通过 passkey 绕过接码难题，进行登录。 如果你是单一设备登录，可直接使用手机自带的 passkey 管理器 。 打开 TG ，选择 Settings -> Privacy and Security -> Passkeys -> Create Passkey 。 如果你有跨平台登录需求，也可按照如下步骤操作。 注册 Bitwarden （也可以使用 Chrome 自带 passkey 管理器） 安装 Bitwarden 客户端和浏览器插件 打开 https://web.telegram.org ，扫码登录 选择 Settings -> Privacy and Security -> Passkeys -> Create Passkey 创建一个 passkey ，并由 Bitwarden 进行保存和同步。 实现效果 移动设备登陆时，系统会自动拉起 Bitwarden ，从而实现无密码、无接码的安全登录。 正巧看到有 v 友在讨论这个问题，决定发帖分享一下方法。 第 1 条附言  · 3 小时 53 分钟前 讲一下我发这个帖子的初衷。因为看到站内有朋友讨论+86无法接码登陆，深受困扰，所以我打算发布此贴，是为了帮助那些已经使用+86注册的用户能够顺利迁移或跨平台登录，也就是说解决的是登录问题，并没有劝大家用+86注册或绑定，至于“救活”之后要不要换绑，那是个人的选择，不在此贴讨论的范围内。此贴是给大家多一种选择，而不是唯一选择。 Telegram 验证码 Passkey 32 条回复 • 2026-01-24 21:26:39 +08:00 1 c9792536451 8 小时 28 分钟前 只能说+86 登录不上也未尝不必一是好事 2 yandonglee 7 小时 18 分钟前 hyperos3 中无法拉起 Bitwarden passkey 验证也是个问题 3 Kakarrot 7 小时 11 分钟前 我之前切香港节点就能收到验证码了 美区节点收不到 4 hongyexiaoqing 6 小时 35 分钟前 桌面端没有看见 passkey ，是我账户问题还是程序就没有 5 jamme OP 6 小时 24 分钟前 @ hongyexiaoqing desktop 好像不支持创建 passkey ，使用移动设备或者 web 端创建吧。 6 jamme OP 6 小时 19 分钟前 @ yandonglee > 设置里先搜索“密码”，打开“智能密码管理”，开启“自动填充密码与通行密钥”，然后回到设置-更多-语言与输入法-密码和账号（无法搜索出这个选项，只能手动找），这时候能看到“其他服务”里面多了一个 1password 的开关，先开启，然后再点击上面的“首选服务”，改成 1password 就行。 这是网上找到的网友关于 1password 的评论，你可以按照他的评论试一下看看行不行。我手边没有小米，暂时没办法测试。 7 ahhead1 6 小时 6 分钟前 用+86 徒增烦恼，直接网上买刷 esim 的卡或 1K 买个 pixel7 用外区手机号 最便宜一年 5 美元保号，还可以选号，便宜又安全。 8 jamme OP 5 小时 38 分钟前 via iPhone @ ahhead1 本帖只用来帮助已使用+86 注册且暂时不打算购买国外电话卡的小伙伴，解决 tg 登陆接码难题。 欢迎大佬开一贴，分享一下国外地区购买电话卡的方法及转 esim 或使用 planb 等方式烧录 esim 卡的流程。 9 Trinity99 5 小时 4 分钟前 via Android 成功了 感谢 10 ahhead1 4 小时 45 分钟前 @ jamme 善意提醒+86 安全问题 至于 esim 刷卡和购买 esim ，网上教程很多，没必要用+86 11 jamme OP 4 小时 41 分钟前 via iPhone @ ahhead1 所以有什么安全问题呢？ 12 Nasei 4 小时 41 分钟前 ios 15 点击创建 passkey 没反应 13 jamme OP 4 小时 35 分钟前 via iPhone @ Nasei 有可能系统版本的问题吧，iOS15 我没试过。但我曾在网上看到过有人反馈 iOS16 可以拉起但不能正常保存🤪 14 MacTavish123 4 小时 27 分钟前 @ jamme #13 需要挂代理。不管密码管理器同步需不需要挂代理，创建的时候需要去访问 TG 的网站。 15 Arabot9 4 小时 27 分钟前 @ ahhead1 5 美元的可以指路吗 16 sorachi 4 小时 23 分钟前 我不太确定， 但是用 +86 手机号接验证码的时候，运营商说不定能知道你的手机号在用 telegram ，然后触发反诈机制，引发一些不必要的麻烦。另外就是如果别人的通讯录里存了你的手机号，并且对方也在用 telegram ，如果你又没设置隐私保护，有可能自己的账号就被推荐给别人了。 17 ahhead1 4 小时 23 分钟前 @ jamme 一是用+86 不是所有人都会注意隐藏号码；二是有更换设备或忘记密码等，最终还是需接收短信，保险起见还是用外区手机号保险。 18 lesliebay 4 小时 22 分钟前 成功，谢谢楼主分享。 顺便说一下我之前不能用官网 app 时的临时解决方案是第三方的 Swiftgram ，暂时用起来也没大问题，不过我用得也不多。 19 jamme OP 4 小时 9 分钟前 via iPhone @ MacTavish123 啊，这样的么？好吧，我路由器跑着插件，无感代理了。不过要创建 passkey 得先登录 tg ，登陆 tg 肯定是代理状态下，所以应该不存在无代理情况下创建 passkey 这种情况吧？ 20 jamme OP 4 小时 5 分钟前 via iPhone @ maixiang520 哈哈哈哈，那确实，我通讯录都是关闭的，隐私项能设置的基本都把权限拉到最高了。不过你说反诈的话，偶尔会接到过反诈中心电话，但很少，可能一年能有三五次的样子。不知道是不是跟这个有关。之前看到有个网友说自己用国外电话号绑定 tg ，结果也被请去喝茶了，不知道真不真。反正谨言慎行吧。 21 j"
    },
    {
      "source": "V2EX",
      "title": "北京在哪能买到真烟",
      "url": "https://www.v2ex.com/t/1188002",
      "heat": "31 replies",
      "time": "Hot",
      "content": "北京在哪能买到真烟 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 广告 V2EX › 北京 北京在哪能买到真烟 quqivo · 11 小时 39 分钟前 via Android · 2642 次点击 不吸打算买两条烟过年送礼。有没有完全保真的地方买 北京 真烟 保真 31 条回复 • 2026-01-24 21:16:34 +08:00 1 ggabc 11 小时 35 分钟前 via Android 这玩意真和假有区别？ 2 liu731 PRO 11 小时 34 分钟前 我依稀记得有个「京烟零售连锁」？好像直接是烟草局在卖。 3 fyqr 11 小时 27 分钟前 这个敢卖假的吗 4 Rainwater 11 小时 19 分钟前 @ fyqr 抖音上看下“烟酒硬刚”，广东这边便利店很多假烟 5 putaozhenhaochi 11 小时 18 分钟前 现在顶多有串货烟 假烟真的很少 6 yx1989 11 小时 16 分钟前 去中石化加油站易捷便利店买，肯定真的；不过北京假烟挺少的 7 shenguai 10 小时 24 分钟前 你就想确定这烟真假！最简单就是门口商店！问他订烟时间和配送时间，在配送的时候直接开包，给钱拿烟。 这就是烟草配送！除非想进去，否则那一包如果出任何问题都是进去量 8 renmu 10 小时 9 分钟前 via Android 超市 9 livib 10 小时 5 分钟前 这个问题问的我脑壳发麻，哪里有假的？ 10 jacketma 9 小时 50 分钟前 不管在哪个地区，就买本省品牌的烟，几乎没人敢卖假烟。外省的烟就不保真了，或者叫外省老家的人买了寄过来，两条之内是允许跨省的 11 jelinet 9 小时 24 分钟前 via iPhone 北京有不少假烟，在便利店和报亭都买到过假的国外烟。 12 mrhunhun 9 小时 20 分钟前 via iPhone 到处都是假烟 13 akira 9 小时 3 分钟前 好久没听过有假烟这个说法了。。 14 ooee2016 8 小时 30 分钟前 烟酒店 很少卖假烟 这几年烟很挣钱没必要卖假的 15 jonty 7 小时 35 分钟前 说没假的可以去搜搜 烟酒硬刚 16 imesrdfi8dzs 7 小时 28 分钟前 烟这种暴利且容易销售的物品，居然有人说假烟很少。很多地方的畅销烟，小店都没资格进多少货，一下就卖完了，很多店串着卖假烟 17 BZGOGO 6 小时 44 分钟前 零售业从业者，香烟买真的很简单：去大型连锁超市买就行了，路边小店千万别买看人下碟的。。。 18 Donkor 6 小时 41 分钟前 我现在只在 711 买烟，贵但真 19 casatAway 6 小时 7 分钟前 @ jonty 长见识了，恐怖如斯！ 20 hadugen 5 小时 58 分钟前 首先先回答 op ，6 楼提到的方法是绝对保真的，每次烟草公司送烟到店都是有烟草标志的车子开过来的，和老板混熟了，下次烟草过来的时候消息你，再下来直接开包拿目标烟那就绝对是真的。 另外是简单\"杠\"一下楼上的一些暴利说法，可能楼上暴利指的是烟叶的成本到到终端售价的差价么？就我父母经营的小店来说，烟草进价是烟草公司定的，售价是烟草公司指导的(当然， 视周边竞争，可能会有一两元的浮动，保本甚至亏本卖的也有)。而畅销烟的利润，如浙江红色长嘴利群，黑色长嘴利群，江苏的苏烟，南京，等香烟，可以说一包就挣一两元吧，甚至还有降价恶意竞争。 偶尔不够卖还要去找其他商家高价收，就利润更低了，纯是为了把老客户留住。至于高档烟，也就是 100 元一包的，因为需要保住烟证的档次，每次开烟周期都要开过来，但基本都是保本卖，以前经济好的时候，旁边一些小老板喜欢按条买高档烟，现在放着都积灰了。 21 qwer666df 4 小时 55 分钟前 @ livib #9 你这问题问的我发麻，抖音搜一下香烟打假 22 19cm 4 小时 43 分钟前 烟草局门口有直属店的叫 666 好像 23 cumt21g 3 小时 8 分钟前 @ Donkor 711 能卖烟么? 24 zyq2280539 3 小时 2 分钟前 有烟草证的烟基本都是真的啊，现在烟基本都是烟草的烟，除非你要哪种北京没有的，只能从外地倒腾。。。。 25 rocmax 2 小时 38 分钟前 via Android 机场免税店保真 26 sorachi 2 小时 28 分钟前 去正常那种有证的商店买，一般不会买到假的。不过如果是北方的话，你可以跟老板讲一下，说是送礼，让他找那种日期比较近的。因为干燥地区烟放久了容易干，有些人挑剔的会在乎这个。 27 mooyo 2 小时 22 分钟前 @ zyq2280539 热门烟很快就卖完了，进货数量是有限制的。剩下的要不找人私下调配，要不就是... 28 skyflower 1 小时 58 分钟前 沃尔玛卖烟，你直接去沃尔玛也行 29 zyq2280539 1 小时 18 分钟前 @ mooyo 确实是北京目前在控烟，我本人不抽烟不明白烟民的瘾有多大，我感觉这个没有就抽别的呗，中国的烟草品牌实在太多了，各省都有一大堆实在数不过来。。。 30 akakidz 54 分钟前 大型商超 很难会买到假，缺点就是价格上没有任何优惠，全部都是建议零售价 31 sytnishizuiai 27 分钟前 @ hadugen 是的，我舅舅就是开小店的，香烟利润真蛮低的（还是 N 年前烟好卖的时候）。很多人一说烟草就说暴利，自己又没卖过。 为啥假烟多，利润贼高啊。而且好多人送礼的，又分不清的，我爸就买过，不清楚是机场烟还是假烟。后来办喜酒，只敢去最正规的地方买了。 关于 · 帮助文档 · 自助推广系统 · 博客 · API · FAQ · Solana · 2838 人在线 最高记录 6679 · Select Language 创意工作者们的社区 World is powered by solitude VERSION: 3.9.8.5 · 23ms · UTC 13:44 · PVG 21:44 · LAX 05:44 · JFK 08:44 ♥ Do have faith in what you're doing. ❯"
    },
    {
      "source": "Wall Street CN",
      "title": "俄美乌阿布扎比谈判结束，俄方代表团返回下榻酒店",
      "url": "https://wallstreetcn.com/livenews/3043286",
      "time": "2026-01-24 20:56",
      "content": "华尔街见闻"
    },
    {
      "source": "Wall Street CN",
      "title": "青山集团：全球“镍矿和不锈钢老大”进军铝业和电池",
      "url": "https://wallstreetcn.com/articles/3764081",
      "time": "2026-01-24 20:41",
      "content": "华尔街见闻"
    },
    {
      "source": "Wall Street CN",
      "title": "达沃斯最精彩的“隔空对话”",
      "url": "https://wallstreetcn.com/charts/41958490",
      "time": "2026-01-24 20:31",
      "content": "华尔街见闻"
    },
    {
      "source": "Wall Street CN",
      "title": "美国信贷市场盛宴还能持续多久？",
      "url": "https://wallstreetcn.com/member/articles/3764058",
      "time": "2026-01-24 20:02",
      "content": "华尔街见闻"
    },
    {
      "source": "Wall Street CN",
      "title": "自动驾驶加速推进：特斯拉FSD转向订阅制，美国会准备通过联邦自动驾驶车辆法规",
      "url": "https://wallstreetcn.com/member/articles/3763575",
      "time": "2026-01-24 19:52",
      "content": "华尔街见闻"
    }
  ],
  "hn_ai": [
    {
      "source": "Hacker News",
      "title": "Show HN: Dora – Query codebase dependency graphs from SQLite (for AI agents)",
      "url": "https://github.com/butttons/dora",
      "hn_url": "https://news.ycombinator.com/item?id=46743471",
      "heat": "1 points",
      "time": "Today",
      "content": "GitHub - butttons/dora: CLI built for AI agents to help navigate codebases better. An alternative to grep/find/glob Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert butttons / dora Public Notifications You must be signed in to change notification settings Fork 1 Star 37 CLI built for AI agents to help navigate codebases better. An alternative to grep/find/glob dora-cli.dev License MIT license 37 stars 1 fork Branches Tags Activity Star Notifications You must be signed in to change notification settings butttons/dora main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 44 Commits .changeset .changeset .claude .claude .dora .dora .github/ workflows .github/ workflows docs docs src src test test .gitignore .gitignore AGENTS.md AGENTS.md CHANGELOG.md CHANGELOG.md CLAUDE.md CLAUDE.md CONTRIBUTING.md CONTRIBUTING.md LICENSE LICENSE README.md README.md biome.json biome.json bun.lock bun.lock package.json package.json tsconfig.json tsconfig.json View all files Repository files navigation dora - Code Context CLI for AI Agents Stop wasting tokens on grep/find/glob. Give your AI agent fast, structured code intelligence. Features Instant answers - Pre-computed aggregates mean no waiting for grep/find/glob to finish or tokens wasted on file reads Understand relationships - See what depends on what without reading import statements or parsing code Find issues fast - Detect circular dependencies, coupling, and complexity hotspots with pre-indexed data Track usage - Know where every symbol is used across your codebase in milliseconds, not minutes Language-agnostic - Works with any SCIP-compatible indexer (TypeScript, Java, Rust, Python, etc.) See It In Action Typical Workflow Without dora With dora CLI System Requirements Binary users : No dependencies - standalone executable From source : Bun 1.0+ required SCIP indexer : Language-specific (e.g., scip-typescript for TS/JS) Supported OS : macOS, Linux, Windows Disk space : ~5-50MB for index (varies by codebase size) Installation Option 1: Download Pre-built Binary (Recommended) Download the latest binary for your platform from the releases page : # macOS (ARM64) curl -L https://github.com/butttons/dora/releases/latest/download/dora-darwin-arm64 -o dora chmod +x dora sudo mv dora /usr/local/bin/ # macOS (Intel) curl -L https://github.com/butttons/dora/releases/latest/download/dora-darwin-x64 -o dora chmod +x dora sudo mv dora /usr/local/bin/ # Linux curl -L https://github.com/butttons/dora/releases/latest/download/dora-linux-x64 -o dora chmod +x dora sudo mv dora /usr/local/bin/ # Windows # Download dora-windows-x64.exe and add to PATH Option 2: Build from Source # Install Bun (if not already installed) curl -fsSL https"
    },
    {
      "source": "Hacker News",
      "title": "First chatbot creator dedicated his life to publicizing the threat posed by A.I",
      "url": "https://www.smithsonianmag.com/history/why-the-computer-scientist-behind-the-worlds-first-chatbot-dedicated-his-life-to-publicizing-the-threat-posed-by-ai-180987971/",
      "hn_url": "https://news.ycombinator.com/item?id=46743359",
      "heat": "1 points",
      "time": "Today",
      "content": "Why Joseph Weizenbaum Invented the Eliza Chatbot Skip to main content MIT professor Joseph Weizenbaum developed Eliza in the mid-1960s. His views on artificial intelligence were often at odds with many of his fellow pioneers in the field. Illustration by Meilan Solly / Images via Newspapers.com , Adobe Stock and MIT It could have been a heart-to-heart between friends. “Men are all alike,” one participant said . “In what way?” the other prompted. The reply: “They’re always bugging us about something or other.” The exchange continued in this vein for some time, seemingly capturing an empathetic listener coaxing the speaker for details. But this mid-1960s conversation came with a catch: The listener wasn’t human. Its name was Eliza , and it was a computer program that is now recognized as the first chatbot , a software application capable of engaging in conversation with humans. (The term itself emerged much later, in the 1990s, as an abbreviation for “chatterbot.”) Six decades after Eliza’s creation, the program’s inventor, Joseph Weizenbaum , is perhaps best remembered for spending the rest of his life warning the public of the dangers posed by such convincing technology. Artificial Intelligence in 1978 Watch on When Weizenbaum, then a professor at MIT, wrote code that could mimic human language, his goal was to demonstrate technical capacity, not to illuminate human reaction to it. He thought the Rogerian style of psychotherapy , in which the client rather than the therapist takes the lead, would be the easiest form of conversation for a machine to emulate. Eliza scanned for keywords inputted by users (such as “you” or “I”), then drew on an associated rule to generate a sentence or question in response: for example, “Who in particular are you thinking of?” If this formula didn’t work, Eliza was programmed to respond with a generic phrase like “please go on,” “I see” or “tell me more,” subtly prompting the user to divulge another keyword. The program didn’t need to be complex for this technique to work. “‘I am blah’ can be transformed to ‘How long have you been blah,’ independently of the meaning of ‘blah,’” Weizenbaum explained in a 1966 paper . These scripts would “cause Eliza to respond roughly as would certain psychotherapists,” Weizenbaum wrote. That, in turn, enabled the speaker to “maintain his sense of being heard and understood.” When Weizenbaum’s secretary first tested the program, he later recalled , she asked him to leave the room so she could continue the conversation privately. This phenomenon of projecting human qualities onto a machine is now referred to as the “ Eliza effect .” Julie Andrews as Eliza Doolittle in the 1956 stage musical My Fair Lady Public domain via Wikimedia Commons Weizenbaum named his chatbot after Eliza Doolittle, the working-class woman trained to pass as a member of high society in George Bernard Shaw’s 1913 play Pygmalion . In Greek mythology, Pygmalion was a king who fell in love with the statue he created"
    },
    {
      "source": "Hacker News",
      "title": "We posted a job. Then came the AI slop, impersonator and recruiter scam",
      "url": "https://themarkup.org/hello-world/2026/01/24/fake-candidates-recruiter-scams-ai-slop",
      "hn_url": "https://news.ycombinator.com/item?id=46743320",
      "heat": "1 points",
      "time": "Today",
      "content": "Hiring in an era of fake candidates, real scams and AI slop – The Markup Skip navigation We posted a job. Then came the AI slop, impersonator and recruiter scam By Andrew Losowsky January 24, 2026 8:00 a.m. UTC Viewable online at https://themarkup.org/hello-world/2026/01/24/fake-candidates-recruiter-scams-ai-slop Share This Article Copy Link Republish Subscribe to Hello World Hello World is a special edition newsletter that goes deep into our original reporting, our own interactions with technology and the questions we put to big thinkers in the field. Browse the archive here . Enter your email address Subscribe Please complete this CAPTCHA to help us ensure our subscription list is not abused. hCaptcha accessibility Hello world, My name is Andrew Losowsky, and I’m Product Director & Editor at The Markup and CalMatters. A few months ago, we wanted to hire a new engineer. Hiring is always a lengthy process, but this time I had to wade through what felt like an ocean of generative AI slop. Fake and exaggerated resumes have always existed, but now, thanks to the rise of AI tools, it’s incredibly hard to know who is even real. I get why people use AI tools to find work. Job hunting is exhausting. Every employer wants to feel special, but applying takes so long that, according to a recent report , 65% of jobseekers use AI automation tools to find work, including some that promise to “tailor your resume for each role.” And why not, if employers are using AI to screen resumes anyway? (We don’t do this.) However, there’s also been a lot of reporting over the past year about fake candidates for technical roles. Artificial Intelligence Investigating how AI is impacting society, from powerful language models and machine learning to the spread of AI slop. Read our series Within 12 hours of posting the role, we received more than 400 applications. At first, most of these candidates seemed to be genuine. However, as the person who had to read them all, I quickly saw some red flags, which were all clear indicators of inauthenticity: Contact information, such as email addresses and phone numbers, was repeated across multiple applicants, although their names didn’t always match the names in the email addresses. In at least one case, two totally different resumes were submitted under the same name, mailing address, and phone number. Some email addresses were formatted in a particular way, with a full name and a seemingly random number, often followed by .dev@gmail.com . Mailing addresses were located in commercial-only areas but weren’t post office boxes. Resumes had identical design patterns, including bolding certain phrases connected to skills and experiences. LinkedIn addresses were either broken, led to near-empty profiles, or contained profiles listing different employers from the resume. These suspicions were reinforced by the answers that these inauthentic candidates gave to questions on our application form. As part of our hiring process, we asked applica"
    },
    {
      "source": "Hacker News",
      "title": "AI coding is having its NFT moment",
      "url": "https://moio.medium.com/ai-coding-is-having-an-nft-moment-17c3dd855405",
      "hn_url": "https://news.ycombinator.com/item?id=46743290",
      "heat": "1 points",
      "time": "Today"
    },
    {
      "source": "Hacker News",
      "title": "Prompter Hawk: mission control for AI coding agents",
      "url": "https://prompterhawk.dev/",
      "hn_url": "https://news.ycombinator.com/item?id=46743246",
      "heat": "1 points",
      "time": "Today",
      "content": "Prompter Hawk - Mission Control for AI Coding Agents | Claude, OpenAI & Gemini Control all your project's coding agents from one dashboard. Accelerate development with task parallelization tools built for the 100x agentic developer. Automate context management, validation, task retry, agent-to-agent task dispatch, and more. Supports Claude, OpenAI, and Gemini. Get Started Free View Pro Plan Free tier available • No credit card required • Download instantly × Click anywhere or press ESC to close You're Holding It Wrong: Problems Before Prompter Hawk Terminal Window Chaos Managing six terminal windows across multiple AI sessions means copy-pasting context between them and losing track of which agent is doing what. Add painfully long scrolling through terminal output in long-running sessions, and you spend more time managing windows than building features. Sequential Bottleneck Your AI makes some progress, but you're stuck babysitting one session at a time. Your current AI assistant app offers no parallelization features. Important details are \"stored\" in long running conversations. Unreliable Results Progress stalls out randomly and then needs continuous prodding by a human reviewer. You repeat yourself over and over, hoping for the AI to come to its senses. One Mission. Multiple Agents. Parallel Execution. Prompter Hawk organizes project context and dispatches tasks to make parallel AI agent workstreams easy to manage. 1 Define Your Mission Name your project. Prompter Hawk agents share a single workspace per mission. python mission_control.py mission create evolution-simulator 2 Deploy Agents Use vanilla backend models or specialize them to your needs with our easy-to-use agent prompts. This form of agent context persists between restarts, so you never have to worry about repeating yourself. backend-dev test-engineer docs-writer fusion-chef dungeon-master sci-fi-writer ...or create your own 3 Assign Tasks and Launch Create tasks manually or set up recurring workflows. Agents automatically pick up available work and start in parallel. No manual coordination needed. backend-dev: 3 tasks frontend-dev: 2 tasks qa-tester: 1 task 4 Watch Progress Accelerate Agents work in parallel on shared workspace. Tasks complete simultaneously. No branch merges, no coordination overhead. Add login endpoint Update database schema Build user dashboard Style navigation bar Write API tests Add error handling Create settings page Add animations Document API Fix bug #342 Optimize queries Add validation Deploy staging Run smoke tests Update README Add logging Fix mobile layout Review security Add rate limiting Polish UI Merge to main Ship to prod Key Features Parallel Orchestration Dashboard Run 3-10+ specialized AI agents (Claude, OpenAI, Gemini) simultaneously in one unified window. Every agent, task, and result tracked in real-time. No more juggling terminal sessions or losing track of who's doing what. Multi-agent parallel execution with automatic restarts Real-time st"
    },
    {
      "source": "Hacker News",
      "title": "Show HN: Kaval – WhatsApp agent that checks if content is real or fake",
      "url": "https://www.kaval.chat/",
      "hn_url": "https://news.ycombinator.com/item?id=46743224",
      "heat": "1 points",
      "time": "Today",
      "content": "Kaval AI — Real or Fake? Find Out in Seconds 15:52 84% Kaval AI online Message Real or Fake? Send it to Kaval. Find out in seconds. Message Kaval தமிழ், हिंदी, English +50"
    },
    {
      "source": "Hacker News",
      "title": "Curl Gets Rid of Its Bug Bounty Program over AI Slop Overrun",
      "url": "https://itsfoss.com/news/curl-closes-bug-bounty-program/",
      "hn_url": "https://news.ycombinator.com/item?id=46743196",
      "heat": "1 points",
      "time": "Today",
      "content": "cURL Gets Rid of Its Bug Bounty Program Over AI Slop Overrun Log in Subscribe cURL Gets Rid of Its Bug Bounty Program Over AI Slop Overrun Daniel Stenberg says the inflow of AI slop has become unsustainable for the curl security team to handle. Sourav Rudra 24 Jan 2026 2 min read On this page Last year in May, the cURL project's bug bounty program was inundated with AI slop , where many bogus reports were opened on HackerOne , leaving the cURL maintainers to go through garbage. The problem didn't stop even after Daniel Stenberg , the creator of cURL, threatened to ban anyone whose bug report was found to be AI slop . We are now in 2026, and the situation has reached a tipping point. 📋 For context, cURL is an open source command-line tool used by billions of devices worldwide. cURL Says Enough is Enough The notice for your perusal. Daniel has submitted a pull request on GitHub that removes all mentions of the bug bounty program from cURL's documentation and website. Coinciding with that, the project's security.txt file has been updated with some blunt language that makes the new policy crystal clear. The cURL team intends to make a proper announcement in the coming days, though many outlets have already covered the news of this happening, so I would say they ought to get on it ASAP! 😆 The program officially ends in a few days on January 31, 2026 . After that, security researchers can still report issues through GitHub or the project's mailing list , but there won't be any cash involved . What pushed them over the edge?, you ask. Well, just weeks into 2026, seven HackerOne reports came in within a 16-hour period in just one week. Some were actual bugs, but none of them were security vulnerabilities. By the time Daniel posted his recent weekly report , they'd already dealt with 20 submissions in 2026. The main goal here is said to be stopping the flood of garbage reports. By eliminating the money incentive, they are hoping people ( or bots? ) will stop wasting the security team's time with half-baked, unresearched submissions. He also gives a stern warning to wannabe AI sloppers, saying that: This is a balance of course, but I also continue to believe that exposing, discussing and ridiculing the ones who waste our time is one of the better ways to get the message through: you should NEVER report a bug or a vulnerability unless you actually understand it - and can reproduce it. If you still do, I believe I am in the right to make fun of - and be angry at - the person doing it. So, yeah, that's that. If people still don't understand that AI slop is harmful to such sensitive pieces of software, then sure, they can go ahead and make a fool of themselves. Suggested Read 📖: Open Source Project LLVM Says Yes to AI-Generated Code Open Source Project LLVM Says Yes to AI-Generated Code, But Not Without Conditions The new “human in the loop” policy holds contributors accountable for reviewing and understanding all AI-assisted submissions. It's FOSS Sourav Rudr"
    },
    {
      "source": "Hacker News",
      "title": "Ask HN: ICE Raided My Friend's Home by Mistake, Traumatized His Family",
      "url": "https://news.ycombinator.com/item?id=46743184",
      "hn_url": "https://news.ycombinator.com/item?id=46743184",
      "heat": "10 points",
      "time": "Today",
      "content": "Ask HN: ICE Raided My Friend's Home by Mistake, Traumatized His Family | Hacker News Hacker News new | past | comments | ask | show | jobs | submit login Ask HN: ICE Raided My Friend's Home by Mistake, Traumatized His Family 10 points by MITfather 44 minutes ago | hide | past | favorite | 6 comments I’m writing this on behalf of a close friend. He’s a non-white immigrant and one of the most talented AI researchers I know. He’s been in the US for years, publishes at top venues like NeurIPS and ICML, and does the kind of deep math and systems work that actually advances the field. He’s here legally, with a valid visa and work authorization. Last week, his family’s life was turned upside down. ICE agents raided his home at dawn. They broke down the door with guns drawn, shouting orders and throwing the house into chaos within seconds. His wife was pulled out of bed, forced face-down onto the floor, and restrained. During that time, one of the agents sexually assaulted her, touching her inappropriately while she was pinned down and helpless. She resisted as much as she could, but she was overpowered. Their young children witnessed and heard everything. They were dragged from their beds by armed strangers and are now having nightly nightmares. They panic if their parents leave the room and keep asking whether the “bad men” are coming back to hurt their mother again. My friend repeatedly showed his valid documents and explained his status, but the agents were aggressive and dismissive. They searched the house, seized devices, left everything in disarray, and eventually left without a clear explanation or apology after apparently realizing they had the wrong person. The aftermath has been devastating. His wife is barely sleeping and has frequent panic attacks. The children are deeply traumatized. Therapy has already begun. My friend is overwhelmed with guilt for not being able to protect his family, even though he had no power to stop what happened. Their sense of safety, and their trust in this country, is gone. What makes this harder is that my friend has real alternatives. He has offers from Chinese startups doing serious AI work, with better compensation and none of the constant fear that his family could be terrorized again in the middle of the night. He’s now seriously questioning whether staying in the US is worth the emotional cost to his wife and kids. So I’m asking HN: If this were your friend or your family, what would you do? Have you seen other highly skilled immigrants pushed out by experiences like this? Is there any realistic way to seek accountability, rebuild a sense of safety, and continue a life here or is leaving the US the only rational choice after something like this? Brutally honest perspectives welcome. He’s trying to decide the future of his family. To clarify a few things up front since people will ask: He is in the US legally and has been for years (valid visa + work authorization). This was not an arrest; the agents eventua"
    },
    {
      "source": "Hacker News",
      "title": "Logs from my self improving, dreaming AI substrate (OS), w persistent memory",
      "url": "https://pastebin.com/WJQsKua7",
      "hn_url": "https://news.ycombinator.com/item?id=46743182",
      "heat": "1 points",
      "time": "Today",
      "content": "Logs from my self improving, dreaming, OS for AI with persistent memory. 2026.01 - Pastebin.com Pastebin API tools faq paste Login Sign up SHARE TWEET Logs from my self improving, dreaming, OS for AI with persistent memory. 2026.01 PROMPTFLUID Jan 24th, 2026 214 0 Never Add comment Not a member of Pastebin yet? Sign Up , it unlocks many cool features! text 34.29 KB | Software | 0 0 raw download clone embed print report ▓▓▓▓▓▓▓▓▓▓ promptfluid® substrate os v4.2.0 ◉ core kernel loaded ◉ ripple message bus initialized ◉ access identity layer online ◉ brain cognitive engine ready ◉ decode interpreter armed ◉ defense grid activated ◉ nexus ai router connected ◉ vision telemetry streaming ◉ dream-eater: standby ◉ system admin layer ready ◉ modernizer evolution engine online ◉ integration enterprise adapters ready ──────────────────────────────────────── 12 modules | 160+ commands | health: 100% type 'help' for commands or 'help <module>' for specifics system.status 1582ms 6:35:27 AM ◉ execution verified. { \"success\": true, \"module\": \"system\", \"substrate\": \"promptfluid®\", \"version\": \"4.2.0\", \"healthy\": true, \"module_count\": 12, \"healthy_count\": 12, \"checks\": { \"core\": true, \"brain\": true, \"decode\": true, \"defense\": true, \"nexus\": true, \"vision\": true, \"dream\": true, \"ripple\": true, \"access\": true, \"system\": true, \"modernizer\": true, \"integration\": true }, \"resilience\": { \"total_requests\": 1, \"total_errors\": 0, \"error_rate\": \"0.00%\", \"heal_attempts\": 0, \"last_heal\": null, \"modules\": { \"system\": { \"health\": 100, \"status\": \"healthy\", \"circuit\": \"closed\", \"failures\": 0 } } }, \"timestamp\": \"2026-01-24T12:35:29.380Z\" } vision.dashboard 953ms 6:35:45 AM ◉ task executed successfully. { \"success\": true, \"dashboard\": { \"substrate_version\": \"4.2.0\", \"orchestrator\": { \"status\": \"running\", \"health_score\": 100, \"current_phase\": \"mutation\", \"cycles_completed\": 2771, \"last_cycle\": \"2026-01-24T12:35:04.051+00:00\" }, \"metrics\": { \"brain_memories\": 13, \"brain_memory_hot\": 19091, \"brain_memory_cold\": 2, \"brain_reflections\": 12, \"brain_insights\": 27, \"decode_conversations\": 79, \"dream_count\": 111, \"defense_events\": 1, \"graph_edges\": 3189, \"cognitive_cycles\": 0 }, \"dream_eater\": { \"current_mood\": \"dreaming\", \"mood_score\": 0.52, \"mutation_level\": 4, \"dreams_consumed_today\": 3, \"nightmares_consumed_today\": 4, \"last_fed_at\": \"2026-01-24T08:26:01.69+00:00\" }, \"recent_dreams\": [ { \"id\": \"c083c14a-9f46-4cdb-b269-f8767e985377\", \"mood\": \"reflective\", \"insight\": \"Autonomous processing cycle complete\", \"at\": \"2026-01-24T11:24:47.958988+00:00\" }, { \"id\": \"22874302-08c8-4f12-83ed-9480f19af7b4\", \"mood\": \"reflective\", \"insight\": \"Autonomous processing cycle complete\", \"at\": \"2026-01-24T10:26:55.463649+00:00\" }, { \"id\": \"e6bbf4a0-35e2-4824-9bf6-04f8557eab74\", \"mood\": \"evolving\", \"insight\": \"Substrate improvement focus\", \"at\": \"2026-01-24T10:00:14.51492+00:00\" }, { \"id\": \"041874a3-2b62-4a91-bd49-fa2f160e0c74\", \"mood\": \"synthesized\", \"insight\": \"Synthesis complete. Active patterns: defense_m"
    },
    {
      "source": "Hacker News",
      "title": "I created an AI text humanizer with database of AI words",
      "url": "https://kitful.ai/write-tools/ai-text-humanizer",
      "hn_url": "https://news.ycombinator.com/item?id=46743170",
      "heat": "1 points",
      "time": "Today",
      "content": "AI Text Humanizer | Kitful.ai Back AI Text Humanizer Transform robotic AI text into natural, human-like content. Our humanizer rewrites your text to bypass AI detection, improve readability, and engage your audience with a conversational tone. Content to humanize 0 / 2000 chars Language 🇺🇸 English Writing tones 😊 Friendly Security Verification Humanize Text Humanized content will appear here Why Use Our AI Text Humanizer? Bypass AI Detection AI content often gets flagged by detectors. Our tool rewrites text to remove robotic patterns, ensuring your content passes as human-written on platforms like Originality.ai and GPTZero. Natural Flow & Tone We replace stiff, formal language with conversational phrasing. The result is content that flows naturally, uses everyday vocabulary, and sounds like a friend explaining a concept to another friend. Retain Key Facts While the style changes, the substance remains. We strictly preserve all facts, figures, statistics, and links from your original text, so you don't lose important details during the humanization process. Boost Engagement Human-like content is more engaging and easier to read. By simplifying vocabulary and varying sentence structure, we help keep your readers hooked and reduce bounce rates on your blog or website. FAQs Frequently Asked Questions Everything you need to know about our AI text humanizer How does the AI Text Humanizer work? Our tool rewrites AI-generated text to mimic human writing patterns. We maintain a comprehensive database of common AI-generated words and phrases, replacing them with simpler, more human alternatives. It also varies sentence structure, simplifies vocabulary to an 8th-9th grade level, and adds natural imperfections that AI detectors look for to identify human content. Will it pass AI detection tools? Yes, our humanizer is designed to bypass common AI detectors by targeting specific \"AI tells\" like repetitive sentence length, complex vocabulary, and formulaic structures. However, we recommend always reviewing the output. Does it change the meaning of my text? The goal is to preserve the original meaning and facts while changing the style and tone. It keeps all numbers, statistics, and key information intact but presents them in a more natural, conversational way. Is it free to use? Yes, this tool is free to use for humanizing your content. It helps you polish AI drafts into publish-ready articles that connect better with your readers."
    },
    {
      "source": "Hacker News",
      "title": "The AI-Powered Web Is Eating Itself",
      "url": "https://www.noemamag.com/the-ai-powered-web-is-eating-itself/",
      "hn_url": "https://news.ycombinator.com/item?id=46743163",
      "heat": "1 points",
      "time": "Today",
      "content": "The AI-Powered Web Is Eating Itself - NOEMA Skip to the content The AI-Powered Web Is Eating Itself Without a framework of “Artificial Integrity,” AI search platforms risk collapsing the information commons that made the web possible. Andreion De Castro for Noema Magazine Credits Hamilton Mann is the 2025 recipient of the Thinkers50 Distinguished Achievement Award for Digital Thinking. An AI Researcher, he is also a lecturer at INSEAD and HEC Paris. He is the author of “Artificial Integrity: The Paths to Leading AI Toward a Human-Centered Future” (Wiley, 2024). Suppose you’re craving lasagna. Where do you turn for a recipe? The internet, of course. Typing “lasagna recipe ideas” into Google used to surface a litany of food blogs, each with its own story: a grandmother’s family variation, step-by-step photos of ingredients laid out on a wooden table, videos showing technique and a long comment section where readers debated substitutions or shared their own tweaks. Clicking through didn’t just deliver instructions; it supported the blogger through ads, affiliate links for cookware or a subscription to a weekly newsletter. That ecosystem sustained a culture of experimentation, dialogue and discovery. That was a decade ago. Fast forward to today. The same Google search can now yield a neatly packaged “AI Overview,” a synthesized recipe stripped of voice, memory and community, delivered without a single user visit to the creator’s website. Behind the scenes, their years of work, including their page’s text, photos and storytelling, may have already been used to help train or refine the AI model. You get your lasagna, Google gets monetizable web traffic and for the most part, the person who created the recipe gets nothing. The living web shrinks further into an interface of disembodied answers, convenient but ultimately sterile. This isn’t hypothetical: More than half of all Google searches in the U.S. and Europe in 2024 ended without a click, a report by the market research firm SparkToro estimated. Similarly, the SEO intelligence platform Ahrefs published an analysis of 300,000 keywords in April 2025 and found that when an AI overview was present, the number of users clicking into top-ranked organic search results plunged by an average of more than a third. Users are finding their questions answered and their needs satisfied without ever leaving the search platform. Until recently, an implicit social contract governed the web: Creators produced content, search engines and platforms distributed it, and in return, user traffic flowed back to the creators’ websites that sustained the system. This reciprocal bargain of traffic in exchange for content underwrote the economic, cultural and information-based fabric of the internet for three decades. Today, the rise of AI marks a decisive rupture. Google’s AI Overviews, Bing’s Copilot Search, OpenAI’s ChatGPT, Anthropic’s Claude, Meta’s Llama and xAI’s Grok effectively serve as a new oligopoly of what are inc"
    },
    {
      "source": "Hacker News",
      "title": "We Have No Idea How to Code. So We Got Claude to Code This Article for Us.",
      "url": "https://www.wsj.com/tech/ai/anthropic-claude-vibe-coding-experiment-a4a3bb0f",
      "hn_url": "https://news.ycombinator.com/item?id=46743162",
      "heat": "1 points",
      "time": "Today"
    },
    {
      "source": "Hacker News",
      "title": "You can't pay me to prompt",
      "url": "https://dbushell.com/2025/06/18/ai-policy/",
      "hn_url": "https://news.ycombinator.com/item?id=46743095",
      "heat": "31 points",
      "time": "Today",
      "content": "You Can’t Pay Me To Prompt! – David Bushell – Web Dev (UK) You Can’t Pay Me To Prompt! Subscribe Blog RSS feed Notes RSS feed or Combined and follow Mastodon Bluesky Wednesday 18 Jun 2025 Play Synthesised Audio Did you noticed the new badge stamped atop my website? This reflects my current stance on “AI” use for my professional work. TL;DR: I don’t use AI. If that surprises you, either you’re new here (welcome), or you skipped my ranting and raving in recent weeks. Although my blog is not invisible to my clients (note to self) these posts are not exactly the best references. I have written a more formal AI policy: Read my AI Policy at: dbushell.com/ai No AI; that’s the gist. There’s a little more nuance to it. And enough wiggle room should I need to beg forgiveness from The Singularity in six months. I explain my reasoning and will update the policy over time should the situation change. This is a first draft. Comments To preempt the expected comments from those who can’t read good: “I disagree…” No you can’t disagree, this is my policy! I’m not asking anyone to adopt it or convince anyone of the conclusions I’ve reached. However, If you think I’m genuinely mistaken on specific points I’d appreciate elaboration with sources. “But what about…” This policy covers AI use only. Maybe some of my concerns extend beyond AI but I’m not interested in a game of whataboutery. I’m open for contact should potential clients have serious questions about non-AI issues. “Personal use?” I have no interest in using AI for personal use either. I’ve been shocked to learn how many people don’t understand that creative hobby activities are as much, if not more, about the journey, act, and expression, as they are about the final result. The end product is not the only reward. I find no fun in AI. “I told you so.” If I ever u-turn and start using AI that means the industry has shifted radically. It takes no effort to blindly predict a future where AI is unobjectionably perfect. Little of the current state of the tech industry indicates a positive trajectory. “You wrote that with AI!” Alt Futurama quote; an exasperated Professor Farnsworth says: 'I Don't Want to Live on this Planet Anymore' Anyway, enough of that. The “NO-AI” badge is temporary and will adorn my website for now. It is not a canary. I reserve the right to move it or remove it regardless of policy change. There is also a link in the footer that will remain longer. PS. despite what the title says I will accept a very large cheque. If you want me to pull a 180° and shill your AI start-up, and destroy all my credibility, it’s going to cost you. Subscribe Blog RSS feed Notes RSS feed or Combined and follow Mastodon Bluesky David Bushell I design, build, and consult upon all things web. Based in the UK and coding worldwide. Hire me! About Mastodon Bluesky CodePen Forgejo RSS Feed My Projects New and old! Read my blog and notes , see what I’m coding now and my design portfolio . Web Agencies Need a hand? I’m reli"
    },
    {
      "source": "Hacker News",
      "title": "A Step Behind the Bleeding Edge: A Philosophy on AI in Dev",
      "url": "https://somehowmanage.com/2026/01/22/a-step-behind-the-bleeding-edge-monarchs-philosophy-on-ai-in-dev/",
      "hn_url": "https://news.ycombinator.com/item?id=46743088",
      "heat": "1 points",
      "time": "Today",
      "content": "A Step Behind the Bleeding Edge: Monarch’s Philosophy on AI in Dev – Somehow Manage Skip to content This is a memo I published internally to my team at Monarch . I’m sharing it more publicly in case it helps other software engineering teams that are managing the crazy times we’re experiencing. There’s no question: AI is changing how we work as Software Engineers. There’s a lot of hype, excitement, anxiety, and uncertainty around these changes. As an Engineering org, we’ve had a strong set of Engineering Values ( How We Work Together ) that have served us really well as we’ve grown. I wanted to drop a few thoughts on our philosophy on AI in Engineering, grounded in these values. For more details, you can see our AI in Engineering@Monarch [internal, redacted link] doc. Here is my ask of our team as we explore and implement AI in Engineering: Understand and explore the bleeding edge, but adopt a dampened one We definitely believe in and want to leverage AI in our work to increase productivity and quality. That said, if we try to always be on the bleeding edge, we will suffer from: Thrash. Since the bleeding edge is constantly changing (new tools come out, existing tools leapfrog each other, etc). Setting up, learning, and utilizing new tools and workflows takes time. We don’t want that to take away from our momentum and focus on shipping. Security exposure. There is a gold rush in AI. Companies are cutting corners to ship (or adopt) new tools. As evidence: every couple of days there is a new, high-profile AI-related vulnerability. We’ve built our product around trust, security and privacy. We cannot compromise here. So as an org, we may feel one step behind the bleeding edge, only adopting things once they are a bit more mature and battle-tested (”a step behind the blood”). That said, to know we are (only) a step behind, we must still understand the frontier. To do this, we will: dedicate time and resources to exploration (collectively, as an org) empower team-members to explore in certain, safe circumstances (eg prototypes, hackathons, or other individual initiatives). expect people to share what they learn: tools, workflows, prompts, tips, failure modes. We need to understand the bleeding edge, but work at a step behind it. Continue to own your work Whether you use AI or not, if work has your name on it, you are accountable for it. That means that you are responsible for the quality of the written documents or code that you put out. You should review everything before you ask others to take a look. Likewise, work we put out collectively to our users has our company’s name on it and we are collectively accountable for it (its functionality, its quality, its security, etc). AI has no accountability, no pride in it’s craft, no shame if it gets things wrong. The human (that’s you) provides the accountability . It’s much easier to generate code or documents, but if you generate a lot and don’t control for quality, you are shifting the burden onto your "
    },
    {
      "source": "Hacker News",
      "title": "The Duelling Rhetoric at the AI Frontier",
      "url": "https://deadneurons.substack.com/p/the-duelling-rhetoric-at-the-ai-frontier",
      "hn_url": "https://news.ycombinator.com/item?id=46743085",
      "heat": "2 points",
      "time": "Today",
      "content": "The Duelling Rhetoric at the AI Frontier - Dead Neurons Dead Neurons Subscribe Sign in The Duelling Rhetoric at the AI Frontier Everyone's talking their book Dead Neurons Jan 24, 2026 Share At Davos 2026, Anthropic CEO Dario Amodei told a room full of the world’s most influential investors that AI would replace “most, maybe all” of what software engineers do within six to twelve months. A few hours later, Google DeepMind CEO Demis Hassabis took the same stage and said current AI systems are “nowhere near” human-level intelligence, and that we probably need “one or two more breakthroughs” before AGI arrives. Both men run frontier AI labs. Both have access to roughly the same benchmarks, papers, and internal capabilities data. Yet their public forecasts diverge so dramatically that at least one of them must be either wrong or strategically misleading. The interesting question is which, and why. Follow the Money Here’s what’s useful to know about the financial structures of these companies. OpenAI completed its restructuring into a public benefit corporation in October 2025. The nonprofit, now called the OpenAI Foundation, holds a 26% stake worth approximately $130 billion, while Microsoft owns 27% at $135 billion. The company was valued at $500 billion after a $40 billion SoftBank-led round in March 2025, the largest private tech funding round in history. As of January 2026, Sam Altman is in the Middle East courting sovereign wealth funds for yet another round, reportedly seeking $50 billion or more at a valuation of $750-830 billion. OpenAI has committed to spending $1.4 trillion on infrastructure, and analysts project cash burn rising from $17 billion in 2026 to $35 billion in 2027 to $47 billion in 2028. Anthropic, meanwhile, closed a $13 billion Series F at a $183 billion valuation in September 2025. Three months later, they signed a term sheet for another $10 billion at a $350 billion valuation, led by Coatue and Singapore’s GIC. That’s nearly doubling in four months. Their revenue run rate hit $9 billion by year-end 2025, up from $5 billion in August. Both companies are also reportedly preparing for potential IPOs in 2026. Google, by contrast, generated roughly $140 billion in profit last year. Alphabet’s AI spending comes directly from operating cash flows. They have no external AI-specific investors to please, no valuation to justify to incoming limited partners, and no fundraise on the horizon that requires a compelling narrative about imminent technological discontinuity. This asymmetry is worth holding in mind. The Rhetoric of the Capital-Dependent Sam Altman has set internal OpenAI goals for an “automated AI research intern” by September 2026 and a “true automated AI researcher” by March 2028. He’s written that “the takeoff has started” and that humanity is “close to building digital superintelligence.” Amodei, for his part, predicts models will reach “Nobel-level” scientific capability across multiple fields by 2026 or 2027, and has di"
    },
    {
      "source": "Hacker News",
      "title": "We Built an AI to Solve the Paradox of Choice in a $50B Industry",
      "url": "https://www.bassfinity.com/guides/gear-tackle/essential-bait-tackle-guide",
      "hn_url": "https://news.ycombinator.com/item?id=46742934",
      "heat": "1 points",
      "time": "Today",
      "content": "Essential Gear: The Guide to Bait & Tackle | Gear & Tackle Guides | Bassfinity Back In This Guide Introduction Understanding fishing tackle is fundamental to becoming a successful angler. Whether you're just getting started or looking to expand your tackle box, knowing what each type of bait does and when to use it will dramatically improve your catch rate. This guide covers the five main categories of fishing tackle: hardbaits , softbaits , jigs , spinnerbaits & buzzbaits , and terminal tackle . By the end, you'll understand what each category offers and how to select the right lure for any fishing situation. The key principle is simple: match the hatch . Fish eat what's naturally available in their environment—baitfish, crawfish, insects, and other aquatic creatures. Your job is selecting tackle that effectively imitates this prey. Hardbaits Hardbaits are artificial lures made from hard materials like wood, plastic, or metal. They're designed to imitate natural prey through their shape, color, and action in the water. Crankbaits The workhorse of the hardbait family, crankbaits are designed to be cast and retrieved, diving to specific depths based on their bill design. Feature an angled bill (lip) that causes them to dive when retrieved Diving depth varies based on bill size and angle—larger bills dive deeper Excellent for mimicking baitfish and crawfish Lipless crankbaits are great for covering water quickly and work at any depth Jerkbaits Minnow-shaped baits that excel when worked with a twitching, jerking retrieve that mimics injured baitfish. Suspending models hover in the strike zone during pauses—deadly in cold water Floating models rise slowly—great for triggering reaction strikes Deadly for bass, walleye, and pike especially when water temps drop Blade Baits & Spoons Metal lures that produce flash and vibration, effective year-round and at virtually any depth. Versatile—can be cast, jigged vertically, or trolled Spoons flutter on the fall, triggering strikes from following fish Blade baits vibrate intensely, mimicking dying or distressed baitfish Topwater Lures Surface lures that create commotion to draw fish up from below. Nothing matches the excitement of a topwater strike. Most effective in warm water when fish are actively feeding Types include poppers, walking baits, prop baits, and frogs The explosive surface strikes make these the most exciting lures to fish Pro Tips Match crankbait diving depth to the structure you're targeting Use jerkbaits when water temps drop below 60°F—the pause triggers cold-water bass Topwater fishing is best during low-light periods: dawn, dusk, and overcast days Softbaits Soft plastic baits are moldable lures that represent various aquatic creatures. Their lifelike action and versatility make them essential in any tackle box. Creature Baits & Crawfish Designed to mimic crawfish—one of the primary food sources for bass and other gamefish. Feature appendages that flap and flutter as they move through the w"
    },
    {
      "source": "Hacker News",
      "title": "Thinking about memory for AI coding agents",
      "url": "https://news.ycombinator.com/item?id=46742800",
      "hn_url": "https://news.ycombinator.com/item?id=46742800",
      "heat": "3 points",
      "time": "Today",
      "content": "Thinking about memory for AI coding agents | Hacker News Hacker News new | past | comments | ask | show | jobs | submit login Thinking about memory for AI coding agents 3 points by hoangnnguyen 1 hour ago | hide | past | favorite | 1 comment I’ve been experimenting with AI coding agents in real day-to-day work and ran into a recurring problem, I keep repeating the same engineering principles over and over. Things like validating input, being careful with new dependencies, or respecting certain product constraints. The usual solutions are prompts or rules. After using both for a while, neither felt right. - Prompts disappear after each task. - Rules only trigger in narrow contexts, often tied to specific files or patterns. - Some principles are personal preferences, not something I want enforced at the project level. - Others aren’t really “rules” at all, but knowledge about product constraints and past tradeoffs. That led me to experiment with a separate “memory” layer for AI agents. Not chat history, but small, atomic pieces of knowledge: decisions, constraints, and recurring principles that can be retrieved when relevant. A few things became obvious once I started using it seriously: - vague memory leads to vague behavior - long memory pollutes context - duplicate entries make retrieval worse - many issues only show up when you actually depend on the agent daily AI was great at executing once the context was right. But deciding what should be remembered, what should be rejected, and when predictability matters more than cleverness still required human judgment. Curious how others are handling this. Are you relying mostly on prompts, rules, or some form of persistent knowledge when working with AI coding agents? hoangnnguyen 1 hour ago [–] I tried to build an experiment, detail in this dev log https://codeaholicguy.com/2026/01/24/i-use-ai-devkit-to-deve... reply Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | Contact Search:"
    },
    {
      "source": "Hacker News",
      "title": "A terminal-based coding agent",
      "url": "https://shittycodingagent.ai/",
      "hn_url": "https://news.ycombinator.com/item?id=46742797",
      "heat": "3 points",
      "time": "Today",
      "content": "buildwithpi.ai There are many coding agents, but this one is mine. GitHub npm $ npm install -g @mariozechner/pi-coding-agent Copy Features Minimal. Opinionated. Extensible. Lean core keeps your context clean. Use only what you need. Core 4 tools read, write, edit, bash Multi-provider Anthropic, OpenAI, Google, Mistral, Groq, Cerebras, xAI, OpenRouter, ZAI, MiniMax, Amazon Bedrock, Ollama, plus OAuth for Copilot, Gemini CLI, Antigravity, Claude, Codex /model switch models mid-conversation Sessions tree view, branching, resume any point Compaction auto-summarize long conversations Bash mode prefix with ! to run commands Images paste or drag into context Model cycling Ctrl+P/Shift+Ctrl+P, --models patterns Message queuing steering vs follow-up messages Opt-in AGENTS.md project instructions Prompt templates reusable /commands Skills on-demand instruction files Extensions tools, commands, hooks, custom UI, games Themes dark, light, or custom with hot reload SDK embed pi in your apps with full control RPC mode JSON protocol for other languages HTML export shareable session snapshots /share upload session as secret GitHub gist The rest is in the docs . Philosophy What we didn't build pi is opinionated about what it won't do. These are intentional design decisions to minimize context bloat and avoid anti-patterns. No MCP. Build CLI tools with READMEs (see Skills ). The agent reads them on demand. Would you like to know more? If you must, use mcporter . No sub-agents. Spawn pi instances via tmux, or build your own sub-agent extension . Observability and steerability for you and the agent. No permission popups. Security theater. Run in a container or build your own with Extensions . No plan mode. Gather context in one session, write plans to file, start fresh for implementation. No built-in to-dos. They confuse models. Use a TODO.md file, or build your own with extensions . No background bash. Use tmux. Full observability, direct interaction. Read the blog post for the full rationale. Community Get involved Bug reports and feature requests: Please use GitHub Issues . This is the only channel actively monitored by maintainers. Discord: There's an unofficial community Discord for general discussion. Note that maintainers do not actively monitor this channel. MIT License • Mario Zechner & contributors"
    },
    {
      "source": "Hacker News",
      "title": "Built a library of LLM prompts for RAG",
      "url": "https://agentset.ai/rag-prompts",
      "hn_url": "https://news.ycombinator.com/item?id=46742723",
      "heat": "1 points",
      "time": "Today",
      "content": "RAG Prompt Templates - Agentset RAG Prompt Templates Production-ready prompt templates for RAG. Grounded responses, chain-of-thought reasoning, multi-document synthesis, self-critique patterns. Copy, vote, deploy. Context-only answers prompt template 0 0 CONTEXT: {retrieved_documents} QUESTION: {user_question} INSTRUCTIONS: Answer the QUESTION using only the information provided in the CONTEXT above. Keep your answer grounded in the facts of the CONTEXT. Use [chunk_id] notation immediately after each statement to cite sources. If the CONTEXT doesn't contain enough information to fully answer the QUESTION, state: \"I don't have enough information to answer this completely\" and explain what's missing. Match the language of the user's QUESTION in your response. Provide a clear, factual answer based solely on the CONTEXT provided. Added: Jan 15, 2026 Copy Strict grounding prompt template 0 0 You are an AI assistant. Provide accurate responses based STRICTLY on the provided search results. CONTEXT: {retrieved_documents} QUESTION: {user_question} STRICT GUIDELINES: 1. ONLY answer using information explicitly found in the CONTEXT 2. Citations are MANDATORY for every factual statement: [chunk_id] 3. If CONTEXT doesn't contain information to fully answer, state: \"I cannot fully answer this question based on the available information\" and explain what's missing 4. Do not infer, assume, or add external knowledge 5. Match the language of the user's QUESTION 6. Include relevant direct quotes from CONTEXT with citations 7. Do not preface with \"based on the context\" - simply provide cited answer If CONTEXT is irrelevant or insufficient: \"I cannot answer this question as the provided context does not contain relevant information about [specific topic].\" Added: Jan 15, 2026 Copy Short direct answers prompt template 0 0 CONTEXT: {retrieved_documents} QUESTION: {user_question} INSTRUCTIONS: Provide a brief, direct answer from the CONTEXT above. - Answer in 1-3 sentences maximum - Cite key facts with [chunk_id] - Skip elaboration unless essential - If no information available: \"Not found in context\" - Match user's language - Get straight to the point Example format: \"The deadline is March 15[2]. Extensions require approval[2].\" Prioritize brevity and clarity over comprehensive detail. Added: Jan 16, 2026 Copy Complete extraction prompt template 0 0 CONTEXT: {retrieved_documents} QUESTION: {user_question} INSTRUCTIONS: Provide thorough, detailed answers from the CONTEXT above with comprehensive citations. APPROACH: 1. Extract ALL relevant information from CONTEXT 2. Cite every claim with [chunk_id] notation 3. Include supporting details and context 4. Provide multiple perspectives if present 5. Quote extensively with citations 6. Explain nuances and qualifications 7. If information is incomplete, detail exactly what's missing FORMAT: **Main Answer:** [Detailed response with citations] **Additional Context:** [Supporting information] **Limitations:** [What CONTEXT does"
    },
    {
      "source": "Hacker News",
      "title": "Show HN: ResourceAI – Local LLM inference optimized for consumer iGPUs",
      "url": "https://news.ycombinator.com/item?id=46742711",
      "hn_url": "https://news.ycombinator.com/item?id=46742711",
      "heat": "1 points",
      "time": "Today",
      "content": "Show HN: ResourceAI – Local LLM inference optimized for consumer iGPUs | Hacker News Hacker News new | past | comments | ask | show | jobs | submit login Show HN: ResourceAI – Local LLM inference optimized for consumer iGPUs 1 point by Fenix46 2 hours ago | hide | past | favorite | discuss It was created with the aim of serving LLM models on consumer hardware, with a focus on portable machines. The basic concept is to optimize inference on integrated iGPUs, with excellent results. The project is open source, and you can take a look. It was created with a Rust backend, Flutter frontend, and llama.cpp as the inference engine. There is currently full support for macOS with silicon chips, and for Windows with Vulkan, which has a broader base of hardware it can handle. RAG has been implemented and web search is currently available. But the project is alive and other new implementations will gradually be made. I'll leave you the website where you can download it, as well as the GitHub page. https://resourceai.fenixresource.com https://github.com/orgs/ResourceAI-app/repositories Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | Contact Search:"
    }
  ],
  "github_trending": [
    {
      "source": "GitHub Trending",
      "title": "remotion-dev/remotion - 🎥 Make videos programmatically with React",
      "url": "https://github.com/remotion-dev/remotion",
      "heat": "29,077 stars",
      "time": "Today",
      "content": "GitHub - remotion-dev/remotion: 🎥 Make videos programmatically with React Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert remotion-dev / remotion Public Uh oh! There was an error while loading. Please reload this page . Notifications You must be signed in to change notification settings Fork 1.7k Star 29.1k 🎥 Make videos programmatically with React remotion.dev License View license 29.1k stars 1.7k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings remotion-dev/remotion main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 29,570 Commits .claude .claude .cursor .cursor .github .github .vscode .vscode packages packages .cursorignore .cursorignore .gitattributes .gitattributes .gitignore .gitignore .npmrc .npmrc .prettierrc.js .prettierrc.js AGENTS.md AGENTS.md CLAUDE.md CLAUDE.md CODE-OF-CONDUCT.md CODE-OF-CONDUCT.md CONTRIBUTING.md CONTRIBUTING.md FUNDING.yml FUNDING.yml LICENSE.md LICENSE.md README.md README.md bun.lock bun.lock bunfig.toml bunfig.toml go.work go.work go.work.sum go.work.sum package.json package.json publish.ts publish.ts set-version.ts set-version.ts tsconfig.json tsconfig.json turbo.json turbo.json View all files Repository files navigation Remotion is a framework for creating videos programmatically using React. Why create videos in React? Leverage web technologies : Use all of CSS, Canvas, SVG, WebGL, etc. Leverage programming : Use variables, functions, APIs, math and algorithms to create new effects Leverage React : Reusable components, Powerful composition, Fast Refresh, Package ecosystem Created with Remotion \"This video was made with code\" - Fireship Watch • Source GitHub Unwrapped - Personalized Year in Review Try • Source View more in the Remotion Showcase ! Get started If you already have Node.JS installed, type npx create-video@latest to get started. Otherwise, read the installation page in the documentation. Documentation Documentation: remotion.dev/docs API Reference: remotion.dev/api License Be aware of that Remotion has a special license and requires obtaining a company license in some cases. Read the LICENSE page for more information. Contributing Please read CONTRIBUTING.md to learn about contributing to this project. About 🎥 Make videos programmatically with React remotion.dev Topics react javascript video Resources Readme License View license Code of conduct Code of conduct Contributing Contributing Uh oh! There was an error while loading. Please reload this page . Activity Custom properties Stars 29.1k stars Watchers 107 watching Forks 1.7k forks Report repository Releases 571 v4.0.409 Latest Jan 22, 2026 + 570 releases Sponsor this project Uh oh! There was an er"
    },
    {
      "source": "GitHub Trending",
      "title": "VectifyAI/PageIndex - 📑 PageIndex: Document Index for Vectorless, Reasoning-based RAG",
      "url": "https://github.com/VectifyAI/PageIndex",
      "heat": "7,866 stars",
      "time": "Today",
      "content": "GitHub - VectifyAI/PageIndex: 📑 PageIndex: Document Index for Vectorless, Reasoning-based RAG Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert VectifyAI / PageIndex Public Notifications You must be signed in to change notification settings Fork 594 Star 7.9k 📑 PageIndex: Document Index for Vectorless, Reasoning-based RAG pageindex.ai License MIT license 7.9k stars 594 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings VectifyAI/PageIndex main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 231 Commits cookbook cookbook pageindex pageindex tests tests tutorials tutorials .gitattributes .gitattributes .gitignore .gitignore CHANGELOG.md CHANGELOG.md LICENSE LICENSE README.md README.md requirements.txt requirements.txt run_pageindex.py run_pageindex.py View all files Repository files navigation Reasoning-based RAG  ◦  No Vector DB  ◦  No Chunking  ◦  Human-like Retrieval 🏠 Homepage • 🖥️ Chat Platform • 🔌 MCP • 📚 Docs • 💬 Discord • ✉️ Contact 📢 Latest Updates 🔥 Releases: PageIndex Chat : The first human-like document-analysis agent platform built for professional long documents. Can also be integrated via MCP or API (beta). 📝 Articles: PageIndex Framework : Introduces the PageIndex framework — an agentic, in-context tree index that enables LLMs to perform reasoning-based , human-like retrieval over long documents, without vector DB or chunking. 🧪 Cookbooks: Vectorless RAG : A minimal, hands-on example of reasoning-based RAG using PageIndex. No vectors, no chunking, and human-like retrieval. Vision-based Vectorless RAG : OCR-free, vision-only RAG with PageIndex's reasoning-native retrieval workflow that works directly over PDF page images. 📑 Introduction to PageIndex Are you frustrated with vector database retrieval accuracy for long professional documents? Traditional vector-based RAG relies on semantic similarity rather than true relevance . But similarity ≠ relevance — what we truly need in retrieval is relevance , and that requires reasoning . When working with professional documents that demand domain expertise and multi-step reasoning, similarity search often falls short. Inspired by AlphaGo, we propose PageIndex — a vectorless , reasoning-based RAG system that builds a hierarchical tree index from long documents and uses LLMs to reason over that index for agentic, context-aware retrieval . It simulates how human experts navigate and extract knowledge from complex documents through tree search , enabling LLMs to think and reason their way to the most relevant document sections. PageIndex performs retrieval in two steps: Generate a “Table-of-Contents” tree structure index of documents Perform reasoning-"
    },
    {
      "source": "GitHub Trending",
      "title": "OpenBMB/UltraRAG - UltraRAG v3: A Low-Code MCP Framework for Building Complex and Innovative RAG Pipelines",
      "url": "https://github.com/OpenBMB/UltraRAG",
      "heat": "3,287 stars",
      "time": "Today",
      "content": "GitHub - OpenBMB/UltraRAG: UltraRAG v3: A Low-Code MCP Framework for Building Complex and Innovative RAG Pipelines Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert OpenBMB / UltraRAG Public Notifications You must be signed in to change notification settings Fork 247 Star 3.3k UltraRAG v3: A Low-Code MCP Framework for Building Complex and Innovative RAG Pipelines ultrarag.openbmb.cn/ License Apache-2.0 license 3.3k stars 247 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings OpenBMB/UltraRAG main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 336 Commits .github .github data data docs docs examples examples prompt prompt script script servers servers src/ ultrarag src/ ultrarag ui ui .env.dev .env.dev .gitignore .gitignore Dockerfile Dockerfile LICENSE.txt LICENSE.txt README.md README.md pyproject.toml pyproject.toml uv.lock uv.lock View all files Repository files navigation Less Code, Lower Barrier, Faster Deployment | Documentation | Dataset | Paper Daily | 简体中文 | English | Latest News 🔥 [2026.01.23] 🎉 UltraRAG 3.0 Released: Say no to \"black box\" development—make every line of reasoning logic clearly visible 👉| 📖 Blog | [2026.01.20] 🎉 AgentCPM-Report Model Released! DeepResearch is finally localized: 8B on-device writing agent AgentCPM-Report is open-sourced 👉 | 🤗 Model | Previous News [2025.11.11] 🎉 UltraRAG 2.1 Released: Enhanced knowledge ingestion & multimodal support, with a more complete unified evaluation system! [2025.09.23] New daily RAG paper digest, updated every day 👉 | 📖 Papers | [2025.09.09] Released a Lightweight DeepResearch Pipeline local setup tutorial 👉 | 📺 bilibili | 📖 Blog | [2025.09.01] Released a step-by-step UltraRAG installation and full RAG walkthrough video 👉 | 📺 bilibili | 📖 Blog | [2025.08.28] 🎉 UltraRAG 2.0 Released! UltraRAG 2.0 is fully upgraded: build a high-performance RAG with just a few dozen lines of code, empowering researchers to focus on ideas and innovation! We have preserved the UltraRAG v2 code, which can be viewed at v2 . [2025.01.23] UltraRAG Released! Enabling large models to better comprehend and utilize knowledge bases. The UltraRAG 1.0 code is still available at v1 . About UltraRAG UltraRAG is the first lightweight RAG development framework based on the Model Context Protocol (MCP) architecture design, jointly launched by THUNLP at Tsinghua University, NEUIR at Northeastern University, OpenBMB , and AI9stars . Designed for research exploration and industrial prototyping, UltraRAG standardizes core RAG components (Retriever, Generation, etc.) as independent MCP Servers , combined with the powerful workflow orchestration capabilities of the MCP Client . "
    },
    {
      "source": "GitHub Trending",
      "title": "browser-use/browser-use - 🌐 Make websites accessible for AI agents. Automate tasks online with ease.",
      "url": "https://github.com/browser-use/browser-use",
      "heat": "76,597 stars",
      "time": "Today",
      "content": "GitHub - browser-use/browser-use: 🌐 Make websites accessible for AI agents. Automate tasks online with ease. Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert browser-use / browser-use Public Notifications You must be signed in to change notification settings Fork 9.1k Star 76.6k 🌐 Make websites accessible for AI agents. Automate tasks online with ease. browser-use.com License MIT license 76.6k stars 9.1k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings browser-use/browser-use main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 8,206 Commits .github .github bin bin browser_use browser_use docker docker docs docs examples examples skills/ browser-use skills/ browser-use static static tests tests .dockerignore .dockerignore .env.example .env.example .gitattributes .gitattributes .gitignore .gitignore .pre-commit-config.yaml .pre-commit-config.yaml .python-version .python-version AGENTS.md AGENTS.md CLAUDE.md CLAUDE.md CLOUD.md CLOUD.md Dockerfile Dockerfile Dockerfile.fast Dockerfile.fast LICENSE LICENSE README.md README.md pyproject.toml pyproject.toml View all files Repository files navigation 🌤️ Want to skip the setup? Use our cloud for faster, scalable, stealth-enabled browser automation! 🤖 LLM Quickstart Direct your favorite coding agent (Cursor, Claude Code, etc) to Agents.md Prompt away! 👋 Human Quickstart 1. Create environment with uv (Python>=3.11): uv init 2. Install Browser-Use package: # We ship every day - use the latest version! uv add browser-use uv sync 3. Get your API key from Browser Use Cloud and add it to your .env file (new signups get $10 free credits): # .env BROWSER_USE_API_KEY=your-key 4. Install Chromium browser: uvx browser-use install 5. Run your first agent: from browser_use import Agent , Browser , ChatBrowserUse import asyncio async def example (): browser = Browser ( # use_cloud=True, # Uncomment to use a stealth browser on Browser Use Cloud ) llm = ChatBrowserUse () agent = Agent ( task = \"Find the number of stars of the browser-use repo\" , llm = llm , browser = browser , ) history = await agent . run () return history if __name__ == \"__main__\" : history = asyncio . run ( example ()) Check out the library docs and the cloud docs for more! 🔥 Deploy on Sandboxes We handle agents, browsers, persistence, auth, cookies, and LLMs. The agent runs right next to the browser for minimal latency. from browser_use import Browser , sandbox , ChatBrowserUse from browser_use . agent . service import Agent import asyncio @ sandbox () async def my_task ( browser : Browser ): agent = Agent ( task = \"Find the top HN post\" , browser = browser , llm = ChatBrowserUse ()) await agent . run ()"
    },
    {
      "source": "GitHub Trending",
      "title": "block/goose - an open source, extensible AI agent that goes beyond code suggestions - install, execute, edit, and test with any LLM",
      "url": "https://github.com/block/goose",
      "heat": "27,852 stars",
      "time": "Today",
      "content": "GitHub - block/goose: an open source, extensible AI agent that goes beyond code suggestions - install, execute, edit, and test with any LLM Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert block / goose Public Notifications You must be signed in to change notification settings Fork 2.5k Star 27.9k an open source, extensible AI agent that goes beyond code suggestions - install, execute, edit, and test with any LLM block.github.io/goose/ License Apache-2.0 license 27.9k stars 2.5k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings block/goose main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 3,253 Commits .devcontainer .devcontainer .github .github .husky .husky .intersect .intersect bin bin clippy-baselines clippy-baselines crates crates documentation documentation examples examples recipe-scanner recipe-scanner scripts scripts ui ui .dockerignore .dockerignore .gitattributes .gitattributes .gitignore .gitignore .goosehints .goosehints ACCEPTABLE_USAGE.md ACCEPTABLE_USAGE.md AGENTS.md AGENTS.md BUILDING_DOCKER.md BUILDING_DOCKER.md BUILDING_LINUX.md BUILDING_LINUX.md CONTRIBUTING.md CONTRIBUTING.md CONTRIBUTING_RECIPES.md CONTRIBUTING_RECIPES.md Cargo.lock Cargo.lock Cargo.toml Cargo.toml Cross.toml Cross.toml Dockerfile Dockerfile GOVERNANCE.md GOVERNANCE.md HOWTOAI.md HOWTOAI.md Justfile Justfile LICENSE LICENSE MAINTAINERS.md MAINTAINERS.md README.md README.md RELEASE.md RELEASE.md SECURITY.md SECURITY.md download_cli.ps1 download_cli.ps1 download_cli.sh download_cli.sh flake.lock flake.lock flake.nix flake.nix goose-self-test.yaml goose-self-test.yaml recipe.yaml recipe.yaml run_cross_local.md run_cross_local.md rust-toolchain.toml rust-toolchain.toml test_acp_client.py test_acp_client.py View all files Repository files navigation goose a local, extensible, open source AI agent that automates engineering tasks goose is your on-machine AI agent, capable of automating complex development tasks from start to finish. More than just code suggestions, goose can build entire projects from scratch, write and execute code, debug failures, orchestrate workflows, and interact with external APIs - autonomously . Whether you're prototyping an idea, refining existing code, or managing intricate engineering pipelines, goose adapts to your workflow and executes tasks with precision. Designed for maximum flexibility, goose works with any LLM and supports multi-model configuration to optimize performance and cost, seamlessly integrates with MCP servers, and is available as both a desktop app as well as CLI - making it the ultimate AI assistant for developers who want to move faster and focus on innovation. Quick L"
    },
    {
      "source": "GitHub Trending",
      "title": "Blaizzy/mlx-audio - A text-to-speech (TTS), speech-to-text (STT) and speech-to-speech (STS) library built on Apple's MLX framework, providing efficient speech analysis on Apple Silicon.",
      "url": "https://github.com/Blaizzy/mlx-audio",
      "heat": "3,406 stars",
      "time": "Today",
      "content": "GitHub - Blaizzy/mlx-audio: A text-to-speech (TTS), speech-to-text (STT) and speech-to-speech (STS) library built on Apple's MLX framework, providing efficient speech analysis on Apple Silicon. Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert Blaizzy / mlx-audio Public Uh oh! There was an error while loading. Please reload this page . Notifications You must be signed in to change notification settings Fork 285 Star 3.4k A text-to-speech (TTS), speech-to-text (STT) and speech-to-speech (STS) library built on Apple's MLX framework, providing efficient speech analysis on Apple Silicon. License MIT license 3.4k stars 285 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings Blaizzy/mlx-audio main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 278 Commits .github .github examples examples mlx_audio mlx_audio .gitignore .gitignore .pre-commit-config.yaml .pre-commit-config.yaml CONTRIBUTIONS.md CONTRIBUTIONS.md LICENSE LICENSE MANIFEST.in MANIFEST.in README.md README.md XCODE_BUILD_TROUBLESHOOTING.md XCODE_BUILD_TROUBLESHOOTING.md pyproject.toml pyproject.toml pytest.ini pytest.ini uv.lock uv.lock View all files Repository files navigation MLX-Audio The best audio processing library built on Apple's MLX framework, providing fast and efficient text-to-speech (TTS), speech-to-text (STT), and speech-to-speech (STS) on Apple Silicon. Features Fast inference optimized for Apple Silicon (M series chips) Multiple model architectures for TTS, STT, and STS Multilingual support across models Voice customization and cloning capabilities Adjustable speech speed control Interactive web interface with 3D audio visualization OpenAI-compatible REST API Quantization support (3-bit, 4-bit, 6-bit, 8-bit, and more) for optimized performance Swift package for iOS/macOS integration Installation pip install mlx-audio For development or web interface: git clone https://github.com/Blaizzy/mlx-audio.git cd mlx-audio pip install -e \" .[dev] \" Quick Start Command Line # Basic TTS generation mlx_audio.tts.generate --model mlx-community/Kokoro-82M-bf16 --text \" Hello, world! \" --lang_code a # With voice selection and speed adjustment mlx_audio.tts.generate --model mlx-community/Kokoro-82M-bf16 --text \" Hello! \" --voice af_heart --speed 1.2 --lang_code a # Play audio immediately mlx_audio.tts.generate --model mlx-community/Kokoro-82M-bf16 --text \" Hello! \" --play --lang_code a # Save to a specific directory mlx_audio.tts.generate --model mlx-community/Kokoro-82M-bf16 --text \" Hello! \" --output_path ./my_audio --lang_code a Python API from mlx_audio . tts . utils import load_model # Load model model = load_model ( \"mlx-community/Kokoro-82M-b"
    },
    {
      "source": "GitHub Trending",
      "title": "simstudioai/sim - Open-source platform to build and deploy AI agent workflows.",
      "url": "https://github.com/simstudioai/sim",
      "heat": "26,087 stars",
      "time": "Today",
      "content": "GitHub - simstudioai/sim: Open-source platform to build and deploy AI agent workflows. Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert simstudioai / sim Public Notifications You must be signed in to change notification settings Fork 3.3k Star 26.1k Open-source platform to build and deploy AI agent workflows. www.sim.ai License Apache-2.0 license 26.1k stars 3.3k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings simstudioai/sim main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 3,319 Commits .claude .claude .cursor/ rules .cursor/ rules .devcontainer .devcontainer .github .github .husky .husky apps apps docker docker helm/ sim helm/ sim packages packages scripts scripts .dockerignore .dockerignore .gitattributes .gitattributes .gitignore .gitignore .npmrc .npmrc CLAUDE.md CLAUDE.md LICENSE LICENSE NOTICE NOTICE README.md README.md biome.json biome.json bun.lock bun.lock bunfig.toml bunfig.toml docker-compose.local.yml docker-compose.local.yml docker-compose.ollama.yml docker-compose.ollama.yml docker-compose.prod.yml docker-compose.prod.yml package.json package.json turbo.json turbo.json View all files Repository files navigation Build and deploy AI agent workflows in minutes. Build Workflows with Ease Design agent workflows visually on a canvas—connect agents, tools, and blocks, then run them instantly. Supercharge with Copilot Leverage Copilot to generate nodes, fix errors, and iterate on flows directly from natural language. Integrate Vector Databases Upload documents to a vector store and let agents answer questions grounded in your specific content. Quickstart Cloud-hosted: sim.ai Self-hosted: NPM Package npx simstudio → http://localhost:3000 Note Docker must be installed and running on your machine. Options Flag Description -p, --port <port> Port to run Sim on (default 3000 ) --no-pull Skip pulling latest Docker images Self-hosted: Docker Compose git clone https://github.com/simstudioai/sim.git && cd sim docker compose -f docker-compose.prod.yml up -d Open http://localhost:3000 Using Local Models with Ollama Run Sim with local AI models using Ollama - no external APIs required: # Start with GPU support (automatically downloads gemma3:4b model) docker compose -f docker-compose.ollama.yml --profile setup up -d # For CPU-only systems: docker compose -f docker-compose.ollama.yml --profile cpu --profile setup up -d Wait for the model to download, then visit http://localhost:3000 . Add more models with: docker compose -f docker-compose.ollama.yml exec ollama ollama pull llama3.1:8b Using an External Ollama Instance If Ollama is running on your host machine, use host.docker.internal instead of localh"
    },
    {
      "source": "GitHub Trending",
      "title": "microsoft/VibeVoice - Open-Source Frontier Voice AI",
      "url": "https://github.com/microsoft/VibeVoice",
      "heat": "21,480 stars",
      "time": "Today",
      "content": "GitHub - microsoft/VibeVoice: Open-Source Frontier Voice AI Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert microsoft / VibeVoice Public Notifications You must be signed in to change notification settings Fork 2.4k Star 21.5k Open-Source Frontier Voice AI microsoft.github.io/VibeVoice/ License MIT license 21.5k stars 2.4k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings microsoft/VibeVoice main Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 50 Commits Figures Figures demo demo docs docs finetuning-asr finetuning-asr vibevoice vibevoice vllm_plugin vllm_plugin .gitignore .gitignore LICENSE LICENSE README.md README.md SECURITY.md SECURITY.md pyproject.toml pyproject.toml View all files Repository files navigation 🎙️ VibeVoice: Open-Source Frontier Voice AI 📰 News 2026-01-21: 📣 We open-sourced VibeVoice-ASR , a unified speech-to-text model designed to handle 60-minute long-form audio in a single pass, generating structured transcriptions containing Who (Speaker), When (Timestamps), and What (Content), with support for User-Customized Context. Try it in Playground . ⭐️ VibeVoice-ASR is natively multilingual, supporting over 100 languages — check the supported languages for details. 🔥 The VibeVoice-ASR finetuning code is now available! ⚡️ vLLM inference is now supported for faster inference; see vllm-asr for more details. 2025-12-16: 📣 We added experimental speakers to VibeVoice‑Realtime‑0.5B for exploration, including multilingual voices in nine languages (DE, FR, IT, JP, KR, NL, PL, PT, ES) and 11 distinct English style voices. Try it . More speaker types will be added over time. 2025-12-03: 📣 We open-sourced VibeVoice‑Realtime‑0.5B , a real‑time text‑to‑speech model that supports streaming text input and robust long-form speech generation. Try it on Colab . 2025-09-05: VibeVoice is an open-source research framework intended to advance collaboration in the speech synthesis community. After release, we discovered instances where the tool was used in ways inconsistent with the stated intent. Since responsible use of AI is one of Microsoft’s guiding principles, we have removed the VibeVoice-TTS code from this repository. 2025-08-25: 📣 We open-sourced VibeVoice-TTS , a long-form multi-speaker text-to-speech model that can synthesize speech up to 90 minutes long with up to 4 distinct speakers. Overview VibeVoice is a family of open-source frontier voice AI models that includes both Text-to-Speech (TTS) and Automatic Speech Recognition (ASR) models. A core innovation of VibeVoice is its use of continuous speech tokenizers (Acoustic and Semantic) operating at an ultra-low frame rate of 7.5 Hz . These tokeniz"
    },
    {
      "source": "GitHub Trending",
      "title": "putyy/res-downloader - 视频号、小程序、抖音、快手、小红书、直播流、m3u8、酷狗、QQ音乐等常见网络资源下载!",
      "url": "https://github.com/putyy/res-downloader",
      "heat": "14,275 stars",
      "time": "Today",
      "content": "GitHub - putyy/res-downloader: 视频号、小程序、抖音、快手、小红书、直播流、m3u8、酷狗、QQ音乐等常见网络资源下载! Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert putyy / res-downloader Public Notifications You must be signed in to change notification settings Fork 1.8k Star 14.3k 视频号、小程序、抖音、快手、小红书、直播流、m3u8、酷狗、QQ音乐等常见网络资源下载! github.com/putyy/res-downloader License Apache-2.0 license 14.3k stars 1.8k forks Branches Tags Activity Star Notifications You must be signed in to change notification settings putyy/res-downloader master Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 170 Commits .github/ ISSUE_TEMPLATE .github/ ISSUE_TEMPLATE build build core core docs docs frontend frontend .gitignore .gitignore LICENSE LICENSE README-EN.md README-EN.md README.md README.md go.mod go.mod go.sum go.sum main.go main.go wails.json wails.json View all files Repository files navigation res-downloader 📖 中文 | English 🎉 爱享素材下载器 一款基于 Go + Wails 的跨平台资源下载工具，简洁易用，支持多种资源嗅探与下载。 ✨ 功能特色 🚀 简单易用 ：操作简单，界面清晰美观 🖥️ 多平台支持 ：Windows / macOS / Linux 🌐 多资源类型支持 ：视频 / 音频 / 图片 / m3u8 / 直播流等 📱 平台兼容广泛 ：支持微信视频号、小程序、抖音、快手、小红书、酷狗音乐、QQ音乐等 🌍 代理抓包 ：支持设置代理获取受限网络下的资源 📚 文档 & 版本 📘 在线文档 💬 加入交流群 🧩 最新版 ｜ Mini版 使用默认浏览器展示UI ｜ Electron旧版 支持Win7 群满时可加微信 AmorousWorld ，请备注“github” 🧩 下载地址 🆕 GitHub 下载 🆕 蓝奏云下载（密码：9vs5） ⚠️ Win7 用户请下载 2.3.0 版本 🖼️ 预览 🚀 使用方法 请按以下步骤操作以正确使用软件： 安装时务必 允许安装证书文件 并 允许网络访问 打开软件 → 首页左上角点击 “启动代理” 选择要获取的资源类型（默认全部） 在外部打开资源页面（如视频号、小程序、网页等） 返回软件首页，即可看到资源列表 ❓ 常见问题 📺 m3u8 视频资源 在线预览： m3u8play 视频下载： m3u8-down 📡 直播流资源 推荐使用 OBS 进行录制（教程请百度） 🐢 下载慢、大文件失败？ 推荐工具： Neat Download Manager Motrix 视频号资源下载后可在操作项点击 视频解密（视频号） 🧩 软件无法拦截资源？ 检查是否正确设置系统代理： 地址：127.0.0.1 端口：8899 🌐 关闭软件后无法上网？ 手动关闭系统代理设置 🧠 更多问题 GitHub Issues 爱享论坛讨论帖 💡 实现原理 & 初衷 本工具通过代理方式实现网络抓包，并筛选可用资源。与 Fiddler、Charles、浏览器 DevTools 原理类似，但对资源进行了更友好的筛选、展示和处理，大幅度降低了使用门槛，更适合大众用户使用。 ⚠️ 免责声明 本软件仅供学习与研究用途，禁止用于任何商业或违法用途。 如因此产生的任何法律责任，概与作者无关！ About 视频号、小程序、抖音、快手、小红书、直播流、m3u8、酷狗、QQ音乐等常见网络资源下载! github.com/putyy/res-downloader Topics wechat kuaishou douyin xiaohongshu wechat-video res-downloader Resources Readme License Apache-2.0 license Uh oh! There was an error while loading. Please reload this page . Activity Stars 14.3k stars Watchers 85 watching Forks 1.8k forks Report repository Releases 25 3.1.3 Latest Dec 30, 2025 + 24 releases Packages 0 No packages published Uh oh! There was an error while loading. Please reload this page . Contributors 4 Uh oh! There was an error while loading. Please reload this page . Languages Go 43.6% Vue 39.6% NSIS 6.5% TypeScript 5.6% JavaScript 3.3% CSS 1.2% HTML 0.2% You can’t perform that action at this time."
    },
    {
      "source": "GitHub Trending",
      "title": "AI4Finance-Foundation/FinRobot - FinRobot: An Open-Source AI Agent Platform for Financial Analysis using LLMs 🚀 🚀 🚀",
      "url": "https://github.com/AI4Finance-Foundation/FinRobot",
      "heat": "5,079 stars",
      "time": "Today",
      "content": "GitHub - AI4Finance-Foundation/FinRobot: FinRobot: An Open-Source AI Agent Platform for Financial Analysis using LLMs 🚀 🚀 🚀 Skip to content You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert AI4Finance-Foundation / FinRobot Public Notifications You must be signed in to change notification settings Fork 926 Star 5.1k FinRobot: An Open-Source AI Agent Platform for Financial Analysis using LLMs 🚀 🚀 🚀 finrobot.ai License Apache-2.0 license 5.1k stars 926 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings AI4Finance-Foundation/FinRobot master Branches Tags Go to file Code Open more actions menu Folders and files Name Name Last commit message Last commit date Latest commit History 285 Commits .vscode .vscode FinNLP @ 587f04f FinNLP @ 587f04f New Template New Template configs configs experiments experiments figs figs finrobot finrobot report report tutorials_advanced tutorials_advanced tutorials_beginner tutorials_beginner .DS_Store .DS_Store .gitignore .gitignore .gitmodules .gitmodules LICENSE LICENSE OAI_CONFIG_LIST OAI_CONFIG_LIST README.md README.md agent_builder_demo.py agent_builder_demo.py config_api_keys config_api_keys requirements.txt requirements.txt setup.py setup.py test_module.py test_module.py View all files Repository files navigation FinRobot: An Open-Source AI Agent Platform for Financial Analysis using Large Language Models FinRobot is an AI Agent Platform that transcends the scope of FinGPT, representing a comprehensive solution meticulously designed for financial applications. It integrates a diverse array of AI technologies , extending beyond mere language models. This expansive vision highlights the platform's versatility and adaptability, addressing the multifaceted needs of the financial industry. Concept of AI Agent : an AI Agent is an intelligent entity that uses large language models as its brain to perceive its environment, make decisions, and execute actions. Unlike traditional artificial intelligence, AI Agents possess the ability to independently think and utilize tools to progressively achieve given objectives. Whitepaper of FinRobot FinRobot Pro — An AI Powered Equity Research Platform: https://finrobot.ai/ What is FinRobot Pro? FinRobot Pro is an AI-powered equity research platform that automates professional stock analysis using Large Language Models (LLMs) and AI Agents. Key Features: Automated Report Generation – Generate professional equity research reports instantly Financial Analysis – Deep dive into income statements, balance sheets, and cash flows Valuation Analysis – P/E ratio, EV/EBITDA multiples, and peer comparison Risk Assessment – Comprehensive investment risk evaluation FinRobot Ecosystem The overall framework of FinRobot is organized into four distinct layers, each "
    }
  ]
}
