[
  {
    "source": "V2EX",
    "title": "你们会选择什么 AI 作为自己的主力辅助工具？",
    "url": "https://www.v2ex.com/t/1186955",
    "heat": "113 replies",
    "time": "Hot",
    "content": "你们会选择什么 AI 作为自己的主力辅助工具？ - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 • 请不要在回答技术问题时复制粘贴 AI 生成的内容 V2EX › 程序员 你们会选择什么 AI 作为自己的主力辅助工具？ sn0wdr1am · 13 小时 36 分钟前 · 7981 次点击 Gemini GPT Claude Qwen DeepSeek GLM Doubao ... 第 1 条附言  · 12 小时 49 分钟前 我现在感觉离开 AI ，就写不了代码了。 第 2 条附言  · 11 小时 57 分钟前 vscode github copliot 给我送了一段时间会员。 现在用 Google antigravity 。 平常咨询聊天用 Copilot 网页版本。 感觉离不开 AI 了。 AI assistant tools 113 条回复 • 2026-01-20 21:43:57 +08:00 1 2 ❮ ❯ 1 oma1989 13 小时 30 分钟前 kiro 2 xeme 13 小时 28 分钟前 Claude + Gemini 3 ifoto 13 小时 28 分钟前 Claude + Gemini 4 NASK 13 小时 28 分钟前 2 cursor +Claude opus 4.5 5 Alias4ck 13 小时 27 分钟前 Codex first 6 z1645444 13 小时 27 分钟前 Claude + Gemini 7 JackyCDK 13 小时 20 分钟前 Claude Opus Plan and Codex codeagent 8 tengyoou 13 小时 15 分钟前 Claude + Gemini 9 GGPlayer 13 小时 15 分钟前 Claude + Gemini 10 gongym 13 小时 13 分钟前 想问问前排 Gemini 是怎么用的，网页嘛还是有 Google 的 CLI 11 HankYao 13 小时 13 分钟前 同时用 4 个工具，各有各的特长 12 markyzy 13 小时 11 分钟前 Claude+Codex 13 kalixi 13 小时 6 分钟前 codex 14 cxsz 13 小时 6 分钟前 @ gongym 谷歌提供了 cli ，用起来和 claude cli 基本一样 15 nilaoda 13 小时 5 分钟前 Trae ，因为免费 16 wxyrrcj 13 小时 5 分钟前 chatgpt.com 17 oiii 13 小时 4 分钟前 Claude + Gemini 18 shil949 13 小时 4 分钟前 @ xeme 比原生 Gemini CLI 更牛吗 19 xwhxbg 13 小时 3 分钟前 codex 5.2 让你体验一下代码之神的感觉 20 gotonull 13 小时 3 分钟前 请问前面说 Claude +Gemini ，gemini 是免费的吗 21 herbloo 13 小时 2 分钟前 如果只是网页版的后，可以借助工具同时提问： https://xmy-ai.cn/ ，Github: https://github.com/HerbLuo/xmy-ai 22 guanhui07 13 小时 1 分钟前 Claude + Gemini 23 abolast 13 小时 0 分钟前 豆包，没事问问一些事实文档 24 yeccc 12 小时 58 分钟前 各位大佬 claude + gemini 用的 Antigravity 吗 25 stinkytofux 12 小时 53 分钟前 opencode + GLL4.7 便宜, 能用. 26 stinkytofux 12 小时 53 分钟前 @ stinkytofux #25 GLM 27 gogozs 12 小时 52 分钟前 AI 不叫主力辅助工具，AI 就是主力工具 28 Kenmin 12 小时 49 分钟前 Claude Opus 4.5 太贵啦只用来辅助，主力还是 Claude Sonnet 4.5 29 tomcrowley 12 小时 49 分钟前 Claude + Gemini 30 sharpy 12 小时 47 分钟前 codex + claude(glm) 31 jonsmith 12 小时 40 分钟前 via Android Antigravity+Claude opus 4.5 Google 大气，pro 免费用。 32 sanbucat 12 小时 40 分钟前 盲选 gemini 33 archxm 12 小时 38 分钟前 via Android 免费的东西，都是初期推广阶段，良心产品。 等到大家普遍接受之后，就开始收费，也可能免费，但给你掺点 shit ，你吃吗？ 34 hydyy 12 小时 35 分钟前 好奇 ai 写完你们怎么审查代码的，总是心力交瘁，搞东丢西 35 gongym 12 小时 33 分钟前 @ cxsz 非常感谢，已经使用上了 36 stinkytofux 12 小时 32 分钟前 @ hydyy #34 先用 plan 模式规划, 确定细节再实现. 37 NoString 12 小时 30 分钟前 AI 是主力工具，ClaudeCode+Copliot ，因为 Copliot 是公司买的，不用白不用。 38 fairytale110 12 小时 29 分钟前 via Android cursor ，公司提供，不花钱 39 avenger 12 小时 27 分钟前 Claude + Cursor 写 Codex Review 40 avenger 12 小时 26 分钟前 @ fairytale110 头像能不能改下啊，眼睛瞎了 41 tuchuanw 12 小时 25 分钟前 opencode + opus 42 sn0wdr1am OP 12 小时 12 分钟前 @ fairytale110 羡慕。公司不担心代码泄露吗？ 43 ghm2mail 12 小时 9 分钟前 windsurf,gpt5.2+薅羊毛 feeback,黑币 40 充 500 点能顶大半个月 44 mandex 12 小时 8 分钟前 Claude + Gemini 45 MaxwellX 12 小时 1 分钟前 cc+glm/minimax gemini pro 网页版 46 makem 11 小时 54 分钟前 via Android Gemini+Cc 47 hezhongfeng 11 小时 53 分钟前 @ mandex 请问是 Claudecli+ Gemini 模型一起使用？ 48 kezi 11 小时 52 分钟前 krio 企业版 49 kldd529 11 小时 47 分钟前 这两天 Antigravity 一直报错，有碰到的伙伴吗 Something went wrong [internal] marshal message: string "
  },
  {
    "source": "V2EX",
    "title": "01 把妹心态篇：吸引的底层代码",
    "url": "https://www.v2ex.com/t/1186960",
    "heat": "110 replies",
    "time": "Hot",
    "content": "01 把妹心态篇：吸引的底层代码 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 29.39 V2EX › 把妹 01 把妹心态篇：吸引的底层代码 1 tthem · 13 小时 19 分钟前 · 9815 次点击 前言 很早就想写这方面的文章，一方面是看到 v 站论坛中很多朋友在情感方面的认知都太过于初级，以至于在两性关系中处于一个很被动的局面。另一方面，我自己在学习和实践把妹的过程中也总结出了不少的经验，很多都是我自己亲自踩的坑，我算不上什么把妹达人或者高手，但是经历的挺多了，至少很多两性关系中的问题，能看得清，拿得下。因此创建了“把妹节点”，我希望自己的文字可以给论坛中的兄弟们一些我自己的思考，能帮到尽量多的人自然是我所期望的。 当然，我自己的拖延症实在是很严重，最近公司加班严重，实行了 996 制度，抽不出时间写。今天收到了 v 友 @ Clannad0708 的催更，我心想，写吧，摸鱼也要写出来，另外也不要有完美主义。论坛的价值就在于思维碰撞。没有放之四海而皆准的‘把妹圣经’，只有在实践中摔打出来的经验才最珍贵。 好了，说了那么多铺垫的东西，接下来上点干货，这个文章的标题叫做: 《把妹心态篇：吸引的底层代码》，心态是十分核心的东西，贯穿在把妹的全流程，包括搭讪（或其他认识女生途径）、聊天、约会、私密空间操作，相当于是两性情感中的地基，地基不稳，学再多话术也是危房。 以下是构建强大心态的三个支柱： 把女人当人看。 感受 > 理性。 在边界附近摩擦。 一、把女人当人看：去神圣化与去物化 是的，没错。女人是人，会吃喝拉撒，也同样有心理需求和生理需求，看上去似乎是一个很简单的客观事实，很多兄弟却在两性关系中没有意识到，要么神话女人，要么贬低物化女人。 神圣化女人，实则是将女人放在高价值位，而把自己放在低位，一旦得到女人的“好反馈”了，就得意忘形，以为自己“得到”她了，似乎默认女人就喜欢上你了，对女人提出要求，要索要更多的情绪价值，陪伴价值。实则是一种越界行为，下头行为，不一致行为。 神圣化女人的另一个弊端，就是会变得无法耐受女人的“消极反馈”，即不好的评价和反应（或者说是和你预期不一致的反馈）。 情况 1： 女人一旦没有给你好反馈，就会开始自我攻击，心想：”啊，是不是我刚才哪句话说错了啊？是不是我做错了什么让她下头了啊？是我不够好吗？“，可能在没有接收到女人负反馈之前，你们之间的沟通都是正常且平淡的，而一旦收到负反馈了，你会给自己找补，给自己辩解开脱，以为这样能扭转女人对自己的负面看法，实则你正在逐渐失去自我。 情况 2 （少部分巨婴心态的人）：在收到负面评价的时候，会开始气急败坏，觉得这是一个坏女人，没有眼光的坏女人，觉得她的负反馈是对你的一种攻击，因此你想要反击回去，开始攻击女人，然后就开始走拉黑删除的流程。 正确的心态，是把女人当人，把女人当成是一个有七情六欲的人，平等的和女人相处，去掉女神滤镜，不要在女人面前卑躬屈膝，不要害怕说错话，想象你是怎么和兄弟聊天的，那是一种松弛的有弹性的状态。在和女人相处的时候也同样要保持自我，尊重对方边界，同时保持自我的边界，想说什么就说什么，不害怕冒犯到她（在尊重的前提下），也不害怕失去她。 二、感受 > 理性：切断逻辑，连接情绪 男人习惯用理性和逻辑，尤其在 v 站，大多数都是程序员，更是习惯用逻辑思维去和他人辩驳，而理性的氛围对于关系的升温，没有任何帮助。 所谓感性，其实就是调动你的同理心，站到对方的视角去想，她会是什么样的感受，她会有什么样的需求，在这个基础上，当你抓住了对方感受的点了以后，你去撬动她，扰动她的情绪。这里我说一句，我自己在和女生聊天的时候，非常喜欢发语音，也特别喜欢打语音电话，因为语音能传达很多的情绪，如果只是文字+表情， 其实很死板，同样的文字用语音和文字发出去，对方的感受就是不一样的，语音更有活人感，更能达到情绪同频的效果，大家可以多尝试。 给大家看一下我在去年中旬搭讪的一个女生的第二天晚上的聊天 ，女生一开始和我说觉得我像海王，觉得我不正经，当时我的聊天其实也没有处理很好，还在解释，但是后面我感受到，其实说我像海王，其实变相是在夸我，那我就挑逗一下她， 说我是老实人巴拉巴拉的，瞎几把聊，让情绪流动起来，最后索性承认自己是海王，是一个 sea god 。反倒让她哈哈大笑破防了，第二天主动给我发消息。 这是微信聊天上的情绪流动，聊天很容易升温也很好学，而线下约会是相对难度高一点的，因为你要面对的不仅是一个手机，你面对的是一个活生生的人，你要展现的是完全的你自己，而不是你的言语你的文字，你要和一个真正的人进行交互。限于篇幅，有关于约会部分的干货以后抽空再写吧。 三、在边界附近摩擦：安全感与张力的博弈 边界的摩擦，其实就是试探两个人的边界，双方都心照不宣对对方有好感，但是不点明，言语中莫名其妙突然暗示一下，挑逗一下对方，你也不确定对方是和你说着玩，还是真的喜欢你，这种不确定的感觉就是暧昧的阶段。 有个 v 友给我发了一些他的聊天案例让我分析，我看完，只觉得：这个天聊的没有意思，很平淡，可以升级的窗口没有抓住，v 友聊天的方向也都是尽量往自己感兴趣的领域熟悉的领域去引，没有任何两性暧昧的氛围。放一些经典的截图（已打码）： 以下是我的点评分析： 其实这个兄弟的聊天在我看来，不算糟糕，至少是正常人之间的聊天，但是呢，我感觉他过于想要暴露自己，展现自己的生活习惯和品味，聊的都是一些朋友之间也可以聊的话题，而不敢去升级。其实这才是大多数兄弟的常态，大家在已经成为了一个正常人以后，我们都遵循社会规训我们的规则和礼貌，对待女人要绅士一点，不能越界，一些“骚”话题不敢去聊，可能是因为害怕受到女人的白眼，或者害怕说了以后会让气氛变得尴尬，会失去这个女人。 怎么练习自己的推拉，还是那句话，多聊，别怕失去女人，这个世界上女人多的很，我们有很多练手的机会。 融会贯通——打造“吸引力闭环” 这三个心态不是割裂的，它们是一个 动态的铁三角 。缺少任何一角，吸引力都会瞬间崩塌。我们需要理解它们是如何互相支撑、互相制衡的。 为什么缺一不可？因为 真正的把妹高手，是让这三个心态在体内 流动 起来的： 因为你做到了 ①（平常心），所以你敢做 ③（摩擦）。当你不再把她当神，你就不怕失去她。因为不怕失去，你才敢开玩笑、敢推拉、敢在言语上挑战她。 因为你做到了 ②（重感受），所以你的 ③（摩擦）才会精准。什么时候该推进关系？什么时候该调情？不是靠逻辑分析出来的，是靠“感觉”抓出来的。当你沉浸在感受中，你能敏锐捕捉到她眼神迷离的那一瞬间，这时候的“边界摩擦”就是水到渠成，而不是性骚扰。 因为你一直在 ③（摩擦），反过来验证了 ①（平等）。只有地位平等甚至略高的人，才敢去逗弄对方。你的每一次推拉和调侃，都在潜意识里告诉她：“我不怕你，我是那个可以掌控局面的人。”这会让你的心态更加稳固。 总结 把女人当人看 = 敢玩 （你有入场券）。 感受 > 理性 = 会玩 （你懂游戏规则）。 在边界摩擦 = 玩得嗨 （你能拿到结果）。 终于码完了，希望你看完这篇文章能有收获！ 第 1 条附言"
  },
  {
    "source": "V2EX",
    "title": "证券低佣开户万 0.854 免 5，评论抽奖送五常大米 10 斤！ [大笑脸开户]",
    "url": "https://www.v2ex.com/t/1186954",
    "heat": "104 replies",
    "time": "Hot",
    "content": "证券低佣开户万 0.854 免 5，评论抽奖送五常大米 10 斤！ [大笑脸开户] - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 5.19 V2EX › 推广 证券低佣开户万 0.854 免 5，评论抽奖送五常大米 10 斤！ [大笑脸开户] daxiaolian · PRO · 13 小时 49 分钟前 · 1330 次点击 ⚠️回帖抽五常大米，每 20 楼抽 1 个 ⚠️开户送五常大米，推荐朋友有红包 ⚠️低佣开户介绍： Y 河证券，ETF 万 0.5 免 5 [ETF,LOF ，免五费率最低，适合 etf ，lof ，打新，纳指，宽基玩家。新手必备！] HB 证券， 万 0.854 免 5 [上市券商，股票 etf 费率都很低] 国泰海通 ，万 0.8 免 5 [头部龙头券商，费率最优惠，大客户专享，综合费率最低] ⚠️我的联系方式和最新券商表格清单，随时更新 www.daxiaolian.com 第 1 条附言  · 9 小时 3 分钟前 网站维护中，我的联系方式和最新券商表格清单，随时更新 https://shimo.im/docs/rp3OMVG1KaCV6Lkm/read 证券 开户 五常大米 104 条回复 • 2026-01-20 21:02:05 +08:00 1 2 ❮ ❯ 1 fuckyoudolphin 13 小时 46 分钟前 3 之前开了银河，用着挺好，参与下 2 langsansan 13 小时 45 分钟前 分子 3 delubon 13 小时 43 分钟前 分子 4 mopengfei 13 小时 41 分钟前 分子分子 5 jtu227 13 小时 41 分钟前 4 笑脸哥，我又来了，银河真不错，点赞！ 6 moody1997 13 小时 24 分钟前 yh 可以 7 l0ng 13 小时 21 分钟前 可以，资持一下 8 wwppp 13 小时 19 分钟前 分母 9 jaytang 13 小时 14 分钟前 分子, 分母我全都要 10 eephee 13 小时 12 分钟前 via iPhone 3 同开了银河，参与一下 11 apnic 13 小时 0 分钟前 分子 12 der99wer 12 小时 51 分钟前 已报名 银河 分母 13 adagiolee 12 小时 47 分钟前 分子 14 russ44 12 小时 42 分钟前 我来 15 seesonchan 12 小时 36 分钟前 分子 16 seesonchan 12 小时 36 分钟前 希望中奖了 17 herofire 12 小时 33 分钟前 分子 18 daxiaolian OP PRO 12 小时 30 分钟前 @ fuckyoudolphin 谢谢支持 19 daxiaolian OP PRO 12 小时 30 分钟前 @ jtu227 谢谢老哥支持 20 Scevola 12 小时 27 分钟前 分子 参与下 21 richardson 12 小时 21 分钟前 分之 22 richardson 12 小时 21 分钟前 有中信建投找我 23 kennykam 12 小时 16 分钟前 分子分子 24 acsanorsworthy 12 小时 10 分钟前 via iPhone 支持一下 25 SimpleSS 12 小时 7 分钟前 支持 26 wufahuoquabcd 12 小时 6 分钟前 继续支持 27 Quaan 12 小时 4 分钟前 我爱你 爱着你 就像老鼠爱大米 28 daxiaolian OP PRO 12 小时 4 分钟前 @ richardson 好的老哥 29 daxiaolian OP PRO 12 小时 4 分钟前 @ Quaan 谢谢支持 @ wufahuoquabcd 谢谢老哥 30 SherlockHolmes2 12 小时 3 分钟前 via iPhone 分母报道 31 wann 12 小时 0 分钟前 我要当分子分子 32 southlink 12 小时 0 分钟前 开了，分子 33 yzf555 12 小时 0 分钟前 分母 or 34 Rrrrrr 11 小时 47 分钟前 希望中一次 35 guava 11 小时 46 分钟前 分子 36 guava 11 小时 46 分钟前 该中了 37 zhanglanr 11 小时 38 分钟前 分子 38 pdone 11 小时 32 分钟前 21 年的时候想买点场内基金，被同事推荐到他朋友那开户，提供完资料后，手机收到一大堆证券公司的短信，大概几十个，同时支付宝借呗、京东金条等都被风控额度清空，当时还不清楚咋回事，想请教下 v 友，有一大堆小证券公司的账户，没使用过，对我有啥影响吗 39 hyjlzz 11 小时 24 分钟前 分子 40 daxiaolian OP PRO 11 小时 22 分钟前 1 @ pdone 就是有人把你的信息卖了呗，影响没啥，就是不能新开证券了。可以注销的，你微信登录中国结算中心营业部，可以查到有哪些，用豆包搜索下怎么注销就行 41 wangluleicn 11 小时 14 分钟前 分子 42 Sunyin 11 小时 13 分钟前 分母分母 43 Howfar 11 小时 1 分钟前 分母 44 Howfar 11 小时 1 分钟前 快点中 45 sodesga 10 小时 55 分钟前 来一发 46 huangchendz 10 小时 41 分钟前 分母 47 huangchendz 10 小时 40 分钟前 给我中 48 eightyfive 10 小时 27 分钟前 考虑银河 49 willxiang 10 小时 23 分钟前 分子 50 Vans 9 小时 52 分钟前 分子 51 daxiaolian OP PRO 9 小时 51 分钟前 @ Howfar 谢谢支持 52 SherlockHolmes2 9 小时 38 分钟前 via iPhone 量化有除了私募以外公募多吗？ 53 yunkki1874 9 小时 28 分钟前 分子 54 wangkaiwwk 9 小时 11 分钟前 参与下 55 KaGaMi7 9 小时 6 分钟前 分子 56 sneijher 8 小时 55 分钟前 分母 57 bigbigpark 8 小时 55 分钟前 骑士参与*3 58 linxl 8 小时 50 分钟前 大米 59 EricYuan1 8 小时 47 分钟前 分子 60 EricYuan1 8 小时 47 分钟前 牛逼 61 EricYuan1 8 小时 41 分钟前 我不太懂，现在还有股票账户免五的吗？ 62 daxiaolian OP PRO 8 小时 35 分钟前 @ EricYuan1 有的呀，现在有的 63 lixingcai 8 小时 30 分钟前 我可以中吗？ 64 SapLot 8 小时 16 分钟前 分子 65 BFInWR 8 小时 15 分钟前 分子 66 icp 8 小时 0 分钟前 分子 67 wanminny "
  },
  {
    "source": "V2EX",
    "title": "有没有那种看似成本低廉，等你接触一段时间后，发现耗资巨大的兴趣爱好？",
    "url": "https://www.v2ex.com/t/1187021",
    "heat": "96 replies",
    "time": "Hot",
    "content": "有没有那种看似成本低廉，等你接触一段时间后，发现耗资巨大的兴趣爱好？ - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 V2EX › 问与答 有没有那种看似成本低廉，等你接触一段时间后，发现耗资巨大的兴趣爱好？ mode171 · 10 小时 59 分钟前 · 5584 次点击 观“成本低廉”一贴有感 有没有那种看似成本低廉，等你接触一段时间后，发现投入了远超预计的成本，而且还没有获得什么回报的爱好？ 低成本 高成本 兴趣爱好 97 条回复 • 2026-01-20 22:37:17 +08:00 1 peteretep 10 小时 56 分钟前 等一个标准答案：钓鱼 2 ansemz 10 小时 46 分钟前 所有的兴趣爱好都是这样吧。从入门到破产。 3 goodryb 10 小时 41 分钟前 hifi 、耳机、音箱这种 ，看别人说烧到最后都是百万起步 4 zbinlin 10 小时 26 分钟前 2 炒股 5 hezhongxian777 10 小时 7 分钟前 via Android 2 健身，完全改变了我的作息，饮食。每天吃牛肉，蛋白粉，维生素，鱼油，各种补品，增肌期还得大幅增加碳水。再加上健身的一些辅助器材，健身房的年卡，巴啦巴啦 6 Lowlife 10 小时 1 分钟前 via iPhone 22 打飞机，刚接触的时候 0 成本，后面每天都打，营养跟不上，要买补品，后面买各种飞机杯，三上悠亚倒膜，买 NAS 买硬盘装 AV ，后面找技师帮忙打飞机，一开始不花钱，后面都是钱。 7 Yuanlaoer 9 小时 51 分钟前 @ Lowlife 对人类那么抵触么？ 8 anubu 9 小时 32 分钟前 发烧不限制领域，烧到最后都是烧钱。 9 dcsuibian 9 小时 29 分钟前 三千预算进卡吧,加钱加到八万八 反着就是图吧 10 villivateur 9 小时 22 分钟前 @ Lowlife 为什么最近老看到你，三句不离打飞机…… 11 89adc64 9 小时 19 分钟前 2 对抗性运动，如篮球、足球。成本低廉，但是很容易：半月板撕裂、前/后交叉韧带撕裂、崴脚、肌肉拉伤 12 panlatent 9 小时 10 分钟前 木工 13 chen1210 9 小时 4 分钟前 在家自己做咖啡 14 letwewell 8 小时 58 分钟前 炒股 15 conky 8 小时 55 分钟前 @ Yuanlaoer 后面不是说技师了吗 16 htfcuddles 8 小时 35 分钟前 爱好到最后没有不烧钱的。比如摄影、天文、滑雪、无人机等。刚入门觉得装备很贵，入坑后发现装备只是各项费用的小头。 17 iniMeow 8 小时 32 分钟前 充电头 18 zyc6666 8 小时 30 分钟前 等 pc 哥 19 RandomJoke 8 小时 30 分钟前 感觉是所有兴趣爱好。。。也就电子竞技看起来花钱，实际上按小时精算下极度省钱 20 freeup 8 小时 29 分钟前 之前看到过一个超出我认知的烧钱爱好，收藏手帐，那个视频我看完，我深深认识到我的眼界还是不够 21 skyemin 8 小时 27 分钟前 羽毛球 22 freeup 8 小时 27 分钟前 @ freeup https://www.bilibili.com/video/BV12amkB7EaP 有兴趣可以看看 23 onepox1140 8 小时 25 分钟前 @ hezhongxian777 有个题外话想问，摄入这么多东西身体能否承受呢（关于吃的部分）。 24 ghm2mail 8 小时 24 分钟前 钓鱼:台钓->路亚->黑坑->海钓->海钓装备->买船 25 evan9527 8 小时 23 分钟前 @ villivateur 看来是真喜欢啊 26 muluc 8 小时 19 分钟前 @ Lowlife #6 几把哥还是依旧的牛 27 brave6 8 小时 16 分钟前 3 羽毛球，我之前接触成本超级低廉，球几块钱，拍几十块。 越打，拍换成几千的了，球 20 多一颗！一桶球现在 240+，你能信一颗羽毛球等于一顿猪脚饭，学球又花了几万块。 28 amoSjiang 8 小时 2 分钟前 烧钱才能提高门槛，拉出跟外行拉出差距，才能彰显品味与不同 29 Blanca30 8 小时 1 分钟前 水草鱼缸，金丝熊 30 poic 8 小时 0 分钟前 咖啡，手冲起步，然后零件器具越来越多，豆子越买越好，喝的越来越多 31 taqingqiuu 7 小时 45 分钟前 路由器、nas 32 gxy2825 7 小时 37 分钟前 @ brave6 +1 ，最近开始从红超换成碳音，意外的还行，但是球拍真的很难忍住不买高端拍 33 Kudos 7 小时 37 分钟前 3 @ Lowlife 34 Gilfoyle26 7 小时 32 分钟前 @ Kudos #33 专业 35 Gilfoyle26 7 小时 28 分钟前 户外吧。后续投入巨大，而且装备有使用年限和意外损耗 36 hayabusa01 7 小时 20 分钟前 @ brave6 还有场地，80/h 37 wu67 7 小时 4 分钟前 @ Lowlife 细说三上倒膜 38 HK560 6 小时 59 分钟前 抽卡手游（已退坑 39 coldmonkeybit 6 小时 52 分钟前 @ brave6 22 年的时候打亚 3 一场 A 下来 20+，现在基本 4-50 。 练球练了 100+学时，各种技术基本都有点基础，现在不找教练了，找空闲的大学生给发多球，100/2 小时，每周一练，省很多哈哈哈。 40 rawburuser 6 小时 51 分钟前 健身，刚好在看性价比高的蛋白粉，价格再涨下去就吃不起了 41 htsuki 6 小时 46 分钟前 @ Lowlife 飞机哥推荐点飞机杯，话说三上悠亚倒模真的是她本人倒模出来的吗 42 EdmondGUO 6 小时 43 分钟前 1 @ brave6 天杀的 yy 不当人了，羽毛球翻了两三倍的价钱了 43 agriphar 6 小时 42 分钟前 炒股，投资 44 spcablast7 6 小时 41 分钟前 @ panlatent 哥们你买啥装备了 45 micolore 6 小时 36 分钟前 2025 年打篮球，一周两场，偶尔三场，一年花了预计 5K 多。 46 mrhunhun 6 小时 34 分钟前 via iPhone 打飞机，刚接触的时候 0 成本，后面每天都打，营养跟不上，要买补品，后面买各种飞机杯，三上悠亚倒膜，买 NAS 买硬盘装 AV ，后面找技师帮忙打飞机，一开始不花钱，后面都是钱。 47 zjw7sky 6 小时 32 分钟前 @ ghm2mail #24 看来我才到第一阶段 48 QFDMY 6 小时 15 分钟前 相机，看着也不低廉，哈哈 49 ovovovovo 6 小时 15 分钟前 3 公路车。小时候骑过山地车，最多就买个头盔。23 年同事带我骑公路车，一开始买"
  },
  {
    "source": "V2EX",
    "title": "评价一下我应该怎么办？",
    "url": "https://www.v2ex.com/t/1186961",
    "heat": "81 replies",
    "time": "Hot",
    "content": "评价一下我应该怎么办？ - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 V2EX › 生活 评价一下我应该怎么办？ byranb · 13 小时 13 分钟前 · 8824 次点击 事情是这样的，我的车买了车位，车位旁边两个空车位，一个因为后面有个鼓风机，一个因为尺寸不够，都没有卖出去。 最近左侧车位无缘无故停了一辆车，已经一个多月了，且之前跟物业聊过是什么情况，为什么没有买车位可以一直在地库里停车，物业没回复，我因为忙也忘了。 本来右侧没有车停，我的车停车还比较顺利（因为右侧比较窄的缘故，如果停车会导致中间车位比较难入库），昨晚右侧突然也停了一辆，我费劲把我车停进去之后，彻底忍不了了。 于是就找物业讨要说法，我说感觉物业费白交了（交房到现在没有不交物业费过），车位管理费白交了（车位管理费 90 一个月），车辆管控形同虚设。物业目前在核实，还没有给出结论。想问问 v 友们有遇到这种情况不？ 如果两辆车还是停着不走，我应该如何应对？ 据了解，有的是在负 3 楼买的便宜车位，然后找到负 2 楼的空车位停，但是左侧的车一个月都没见过开一次，我只能猜测这个车是赖在这不走的。 第 1 条附言  · 9 小时 2 分钟前 更新下后续， 物业给回复了，左侧的车没车位，联系几次都没联系上，基本确定就是赖在那里不走的类型。 看了 v 友的回复，总结，还是不能贪小便宜... 物业 车位 停车 81 条回复 • 2026-01-20 21:31:14 +08:00 1 nevin47 13 小时 11 分钟前 没卖出去的车位都认为是公共车位，可以查一下各地的行政发文，有比较明确的约束。没有任何法规说买了车位就不能停公共车位了吧？ 2 byranb OP 13 小时 8 分钟前 @ nevin47 现在还不确定他们买没买车位，另外一个就是，物业把右侧的车位卖给一个车位公司了，之前他们说卖出去的那种不允许停其他车辆。 3 liu731 PRO 13 小时 8 分钟前 如果左右 2 个车交了停车费，还真没有义务挪走。 4 byranb OP 13 小时 6 分钟前 @ liu731 嗯 我想看看物业怎么个说法 5 nightlight9 13 小时 5 分钟前 4 没占你的车位，你管不着的 6 cdwyd 13 小时 4 分钟前 via Android 楼主多少有点聪明反被聪明误了，想着能临近车位卖不出去，自己好停车还不容易出现车门刮擦的情况。结果不但有车停在那，还因为距离不够影响了自己的便利性。。。便宜没占到还吃了亏 7 sojourner 13 小时 4 分钟前 如果没有占到你的车位，即使物业不鸟你，好像你也没办法。出个馊主意，如果你不怕剐蹭，把车子稍微靠某一边多停一点。 8 byranb OP 13 小时 2 分钟前 @ cdwyd 是有点这样了现在，前几年小区人少，非常好停车，最近有莫名其妙的车乱停，只能投诉一下乱停... 9 byranb OP 13 小时 1 分钟前 感觉这样确实可以 10 cryptovae 12 小时 59 分钟前 52 我帮 OP 直说了把 我旁边两个车位，都有缺陷，在我看来肯定是卖不掉的，所以这三个车位都是我的，现在我另外两个车位都被别人停了车，我有点不爽，怎么才能让他们不要停在我车位上，求助 盲猜 OP ，理想车主（ BGM:理想进行曲 噠 噠噠 噠噠噠） 11 xhyzidane 12 小时 59 分钟前 其他车老老实实停在线内且留够开门空间，就不用管 12 byranb OP 12 小时 57 分钟前 @ cryptovae 哈哈哈 是有点这个意思 大方承认 现在看 确实太理想了 13 byranb OP 12 小时 57 分钟前 @ xhyzidane 平常心 14 er567 12 小时 49 分钟前 你可以选择把主驾驶这边留宽一点，下次你右边的车就不会停了 15 bestie 12 小时 47 分钟前 1 其实我买的车位跟 OP 类似，三个车位，最左边是人防铁门占了车位的 1/5 ，压根停不了车，所以我买了中间车位。 但是右边车位有个车主总是压线停车或者离线很近，导致我必须往左边压到最左边车位的 1/5 才能停，并且能给右边车主留一点开门的位置。 后来我实在受不了了，我也贴着右边线停，跟右边的车门紧贴着，完全开不了门只能从副驾上车这种。 后来右边的车主就老实了，会靠着右边的柱子停车了。 那我也就稍微让他一点，反正我左边空间大。 16 make115 12 小时 47 分钟前 物业费管理费不交不就是了， 不解决我就就不交 17 MXMF 12 小时 44 分钟前 我买车位的时候情况和你这个差不多，有一个车位旁边车位消防柜伸出来一部分侵入车位了，非常不好停，我就想不会有人买这个车位，那我就买它隔壁的车位，就相当于花一份钱买两个车位了。 但是最终我没这样搞，我担心物业把这个不好停的车位打折卖了，还真有人买了，我就比较尴尬了，因为这个车挺好之后，基本上就贴着旁边车位了。 18 byranb OP 12 小时 43 分钟前 @ bestie 感同身受，这种事情理性一点就是投诉核查，感性一点就是互相照顾下感受，哎 19 byranb OP 12 小时 43 分钟前 @ MXMF 还是你比较明智，贪小便宜吃大亏，还是有道理 20 byranb OP 12 小时 42 分钟前 @ make115 小区确实有很多不交的，有时候会觉得按时交物业费是大冤种... 21 cbythe434 12 小时 39 分钟前 菜就多练 22 byranb OP 12 小时 39 分钟前 @ cbythe434 ... 23 jadewant 12 小时 37 分钟前 多练车技 24 jrtzxh020 12 小时 36 分钟前 换比亚迪，自动泊车剐蹭车企兜底。 25 byranb OP 12 小时 34 分钟前 @ jrtzxh020 🤦‍♂️ 26 nevin47 12 小时 31 分钟前 @ byranb #2 不现实的，你的车位如果被停了，可以让物业去清理。隔壁两个都不是你的车位，你没法管。。 而且这种车位有时候可以买下来然后修成一个储物间，到时候你不是更蛋疼 27 nzynzynzy 12 小时 30 分钟前 我替 lz 翻译一下： 我车位买贵了，旁边空的车位现在停的车貌似不是买的车位，我有点不爽但是没有办法，想给物业上眼药但是仍然在寻找立场。 我替 lz 解答一下： 只有买下两个车位才能赶他们走:( 28 mengdu 12 小时 29 分钟前 一般是一个月交几百就能停没卖出去的车位的。 29 byranb OP 12 小时 29 分钟前 @ nevin47 还有修成储物间这种骚操作...着实没想到 30 lumia1020 12 小时 28 分钟前 感觉你说的没什么违规，只要停到车位中没占公共空间、没压线就没问题。要是离你太近，就沟通一下。 我的情况比你严重，我这是开发商把没卖掉的车位都加了地锁。有的车位主人为了省钱一个车位绑定两个车，两个车都进来后就有一个车横着停开发商没卖掉的车位前面，这样车"
  },
  {
    "source": "V2EX",
    "title": "今天生日，五个人跟我说生日快乐",
    "url": "https://www.v2ex.com/t/1186932",
    "heat": "80 replies",
    "time": "Hot",
    "content": "今天生日，五个人跟我说生日快乐 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 V2EX › 生活 今天生日，五个人跟我说生日快乐 hartlee · 23 小时 55 分钟前 via Android · 2867 次点击 老婆孩子爸妈丈母娘 是不是很失败 生日 失落 失败 80 条回复 • 2026-01-20 22:00:55 +08:00 1 o0DoO0o 23 小时 54 分钟前 还没到 24 点 生日快乐，现在 6 个了 2 jchonc 23 小时 54 分钟前 Happy Birthday! 3 starlight98 23 小时 52 分钟前 生日快乐！ 4 shawnsh 23 小时 52 分钟前 via Android 7 你又来炫耀了 5 isbase PRO 23 小时 51 分钟前 via iPhone 不然你预期应该如何？ 6 kkwa56188 23 小时 36 分钟前 1 不错了, 比只有手机里的各种 app 说生日快乐强 7 ShenZhen 23 小时 34 分钟前 很不错了，生日快乐🎂 8 SodaPopBoy 23 小时 29 分钟前 不应该啊，有孩子了还会在意这个吗。习惯就好，有了家庭以后，社交自然越来越少 9 yeeli 23 小时 13 分钟前 1 同天生日, 和我说生日快乐的只有支付宝和银行 APP 10 shiny PRO 23 小时 12 分钟前 生日快乐 11 darkengine 23 小时 0 分钟前 那我比你强，我收到了各大银行的祝福 😂 12 ferock PRO 22 小时 59 分钟前 via Android 生日快乐 13 explon 22 小时 53 分钟前 不对吧，还有银行跟运营商 14 ovtfkw 22 小时 47 分钟前 via iPhone 你想预期什么？ 15 suyp 22 小时 47 分钟前 生日快乐🎂 16 levelworm 22 小时 46 分钟前 via iPhone 除了我妈其他人都不记得，楼主你这不错了。生日快乐。 17 gordon96 22 小时 36 分钟前 生日快乐！ 18 YFZZ PRO 21 小时 55 分钟前 生日快乐。 已经很不错了，我现在祝我生日快乐的人数是 0 ，因为人到中年，我都不过生日了。 19 wnpllrzodiac 14 小时 41 分钟前 via Android 竟然还有人记得生日，不错了 20 Yllnice 14 小时 24 分钟前 via Android 生日快乐 21 ysxb1145 14 小时 0 分钟前 via Android 不错了兄弟生日快乐，我今年只收到了联通和支付宝的 22 cander0815 13 小时 48 分钟前 生日快乐 23 imnpc 13 小时 44 分钟前 生日快乐 24 cxe2v 13 小时 40 分钟前 确实挺失败的，我至少有上万人给我庆生 25 jtu227 13 小时 38 分钟前 生日快乐生日快乐生日快乐生日快乐生日快乐生日快乐生日快乐生日快乐 确实挺失败的，我至少有上万人给我庆生 哈哈哈 26 dddd1919 13 小时 37 分钟前 失败，我都是各大行轮班慰问 27 hnnxn 13 小时 36 分钟前 via Android 生日快乐，🎂 28 JoeJoeJoe PRO 13 小时 25 分钟前 @ jtu227 @ cxe2v 兄弟们还得加把劲 我要是国庆过生日 全国都得给我庆生 ps：op 生日快乐 29 lihua 13 小时 24 分钟前 via iPhone 生日快乐🎂 30 lepig 13 小时 23 分钟前 加我一个 生日快乐 🎂 31 ChengHaha 13 小时 22 分钟前 生日快乐 32 raydied 13 小时 21 分钟前 牛皮， 生日快乐。 33 kenshinhu 13 小时 18 分钟前 昨天生日，仅有儿子老婆女儿说了，还有一堆 APP 的生日祝贺 34 mrxiehuang 13 小时 17 分钟前 很好了，我一般只有妈妈，老婆有时候都忘记我生日 35 acisky 13 小时 16 分钟前 生日快乐，已经很幸福了 36 liangcj 13 小时 15 分钟前 生日快乐🎉 37 E263AFF275EE4117 13 小时 14 分钟前 生日快乐！ 38 jeffhtli 13 小时 14 分钟前 生日快乐！ 知足常乐～ 39 BeforeTooLate 13 小时 10 分钟前 有啥失败的，有一年，所有人都忘记我生日了，包括我自己，过了一个月突然想起来自己生日忘过了。 40 duck2u 13 小时 10 分钟前 路明非呀 41 ergouli848 13 小时 9 分钟前 没屁搁楞嗓子 42 AirBai2 13 小时 5 分钟前 有这五个人就够了 43 piller 12 小时 52 分钟前 我只有父母，你已经很幸福了佬，生日快乐，开开心心 44 moyuanjun925 12 小时 45 分钟前 我父母都忘记我生日了，是不是开心了 🐶 45 liangzhh25 12 小时 34 分钟前 真巧，我昨天也生日 hhh 身边就俩朋友，上个月提到所以记得，其他人包括爸妈都不记得。但因为我也不记得他们生日，所以挺无所谓的 hhh 46 dongQQ 12 小时 33 分钟前 生日快乐 47 cnliuxq 12 小时 31 分钟前 你又来炫耀了 48 rttds 11 小时 42 分钟前 已经很好啦 知足常乐 49 yianing 11 小时 41 分钟前 又来炫耀了 50 Blanke 11 小时 39 分钟前 via Android 说实话有点多，炫耀的吧? 51 lixingcai 10 小时 50 分钟前 你这已经很成功了，元旦过生日，我自己都忘记了，22 点大晚上回到出租屋才想起今天是生日。 52 muluc 10 小时 40 分钟前 生日快乐！ 53 hfaskf 10 小时 35 分钟前 生日快乐，爱自己哦 54 dejavv 10 小时 33 分钟前 生日快乐，自己开心是最重要的 55 asAnotherJack 10 小时 20 分钟前 这有啥失败的，这么多人记得你生日 56 programMrxu 9 小时 13 分钟前 生日快乐 57 blackjack4587 8 小时 55 分钟前 生日快乐！所以检讨一下为什么没多几个情人这样就会有多几个跟你说生日快乐的人了…… 58 yryc 8 小时 49 分钟前 生日快乐！ 59 NoKey 8 小时 36 分钟前 难道没有大量的短信？ 60 MonkeyJon 8 小时 29 分钟前 生日快乐，bro 61 unco020511 8 小时 3 分钟前 平安保险,招商银行没和你说生日快乐吗? 62 hartlee OP 7 小时 4 分钟前 感谢各位，谢谢 着真的是个社会普遍现象我就放心了 前几天收拾东西的时候翻出好多生日贺卡，都是小学的，看了好久 63 yzf555 6 小时 54 分钟前 "
  },
  {
    "source": "V2EX",
    "title": "想买个全自动咖啡机,有没有推荐的",
    "url": "https://www.v2ex.com/t/1186985",
    "heat": "75 replies",
    "time": "Hot",
    "content": "想买个全自动咖啡机,有没有推荐的 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 V2EX › 咖啡 想买个全自动咖啡机,有没有推荐的 MiHwAppleTslFan · 12 小时 16 分钟前 · 2540 次点击 预算 2-10k,只考虑全自动,我自己目前每天一杯瑞幸,想自己做替代 全自动咖啡机 预算2-10k 瑞幸 75 条回复 • 2026-01-20 21:41:04 +08:00 1 boringwheat 12 小时 14 分钟前 推荐买半自动，全自动容易生蟑螂 2 v00O 12 小时 11 分钟前 每天自家一杯咖啡，咖啡机清洗半小时，最重要的自己做的还不一定有买的好喝～～ 3 MisakaTang 12 小时 9 分钟前 买了德龙 ECAM22.110SB 2199 因为不追求打奶泡之类的目前用了一个月感觉还可以 4 FengMubai 12 小时 8 分钟前 @ v00O 豆子的稳定性占大头 5 mengdu 12 小时 3 分钟前 咖啡机的尽头是胶囊咖啡机。。 6 gam2046 12 小时 1 分钟前 1 推荐买半自动的，全自动，我用过德龙的，当时四千多，很容易出故障，售后也走过一次，一会说我用的水不行，一会说我应该每个月送过来保养，感觉这不像一个咖啡机，像买了个爹。几十万的车都不用每个月都送来保养。 随后拼多多 200 买了个半自动意式的，无非就是自己磨豆子，稳定至今，啥毛病没有，还便宜。 7 willygeek007 12 小时 1 分钟前 咖啡机有维护成本，出品最佳。瑞幸没有维护成本，但单杯成本略高。折中方案我选挂耳，懒人打开冲一杯就完事 8 CSGO 12 小时 0 分钟前 二手瑞幸 9 MiHwAppleTslFan OP 11 小时 58 分钟前 @ gam2046 公司以前是全自动德龙,每天一杯,用了半年感觉没出过啥问题啊 10 livc 11 小时 53 分钟前 买的 delong 的全自动咖啡机，应该是使用率最高的产品之一，和 iPhone 的使用频率差不多，很值 11 alei814 11 小时 51 分钟前 飞利浦的 EP3146 ，可能有新款了，购入时 2800 ，用三四年了，定期清洗机身内部，感觉很方便 12 youyouzi 11 小时 44 分钟前 1 楼下瑞幸不超过 9 快 9 ，库迪更狠，自提美式最便宜是 2 块 5 ，现在涨价了到 3 块了。要什么自行车 13 skylerr 11 小时 43 分钟前 去年双十一买的德龙 emax ，抖音买的，2300 多 14 ghost3281 11 小时 42 分钟前 德龙的感觉还不错，公司的咖啡机天天高强度使用也没啥问题，自家也买了个 15 maolon 11 小时 34 分钟前 德龙的没毛病，我现在就在用，而且全自动出品全靠豆子，选对豆子比调参数重要多了，另外比起飞利浦的机芯德龙的机芯清理起来简单的多 16 goodSleep 11 小时 33 分钟前 自己家买的格米莱半自动，另外还买了磨豆机 咖啡机是带个锅炉那种，然后水沸腾了，有个阀门会顶起来，阀门上有个胶圈垫，顶起来后就密封了；用时间长了，阀门顶起来会密封不严，然后有些跑气，比较烦。 17 liu731 PRO 11 小时 33 分钟前 感觉不如瑞幸，咖啡机沉没成本太高了（豆子不好喝、咖啡喝腻了...） 18 cominghome 11 小时 30 分钟前 不是意式浓缩爱好者的话，买个摩卡壶新鲜一下好了，一天一杯这个量相比机器的购入和维护成本不是一个级别。 如果对香气和油脂没有需求的话，胶囊或者挂耳就可以了。 19 nevin47 11 小时 24 分钟前 如果时间不是特别紧，强烈推荐买磨豆机+半自动机。现在国产大刀盘的磨豆机好用的一批，然后咖啡机只要压力不虚标，自己做出来的比外面的咖啡店好喝一个档次 全自动机最大的问题并不是做出来不好喝，而是清洁。里面的萃取模块定期要拿来洗，这个还算不麻烦，真正麻烦的是机身里面的空隙和下粉的管路，只能用吸尘器和长刷子去定期刷，非常麻烦。如果偷懒不搞，北方的话一般是生霉，南方的话那真的是容易生小强。。。。 20 MiHwAppleTslFan OP 11 小时 15 分钟前 早上上班出门前用半自动做一杯太赶了吧,总不能下班回家再弄吧 21 bghtyu 11 小时 11 分钟前 早上出门前做一杯，我用的胶囊，确实很省事 22 remarrexxar 11 小时 6 分钟前 双十一买的德龙 S2 ，每天早上一杯挺方便的，功能简单浓缩-咖啡-美式三种，没有奶缸但是有蒸汽头。工作日就直接美式，周末打个奶泡做拿铁。 23 TrembleBeforeMe 11 小时 0 分钟前 之前打开小红书发现气动咖啡机价格打到 200-300 了，买了一个当玩具，感觉还是有点意思 24 Midnight 10 小时 59 分钟前 我用小米的胶囊咖啡机，胶囊用星巴克。一杯成本才 3 块不到 25 Shaaaadow 10 小时 57 分钟前 全自动就不是家用的，使用场景基本都是办公室这种多人使用的场景 要快还要省心的话，就直接胶囊吧 26 yuwangG 10 小时 57 分钟前 买了，做了两回，目前吃灰中了。。。 还是外面花钱的好喝 27 autumncry 10 小时 46 分钟前 1 之前浅调研了一下，夏天如果有冷萃需求的话，真冷翠目前德隆只有两款支持，450.86 和 630.75 ，前者 6k+，后者 11k+，后者是新款。个人建议后者 28 darkengine 10 小时 39 分钟前 @ gam2046 我家的也是德龙全自动，水质警告灯一直亮，不管它就行，照常打。已经服役快 7 年了。 29 limbo0 10 小时 22 分钟前 原来也自己做, 现在懒了, 咖啡液加牛奶冰块基本就可以了 30 deepbytes 10 小时 20 分钟前 via iPhone 手磨咖啡，加瑞幸送的弯嘴壶，买个强烈推荐的山姆的铂金咖啡豆 800 克一袋那款，绝对爽过瑞幸！算下来每杯成本 3 块多，要啥瑞幸啊哈哈 31 lsls618 9 小时 38 分钟前 德龙全自动做活动的时候价格还可以的，买个 19bar 的 32 loading 9 小时 30 分钟前 via Android 我买了 nespresso 胶囊机，查过全自动的维护是噩梦，op 一天也就才一杯，全自动我认为应该是给一天合计起码 10 杯的多人场景才适用。 胶囊机实在太方便了。记住是 nespresso 的胶囊。 33 heyjei 9 小时 20 分钟前 折腾了一圈，最后还是用胶囊咖啡机 34 ruidoBlanco 9 小时 1 分钟前 1 家里有手动咖啡机，在外面喝过很多全自动咖啡机的咖啡，很负责的告诉你全自动咖啡机大部分出来的就是渣。稍微能喝一点，可能机器就会贵到爆了。 如果想喝好的，预算有限想试水，买 aeropress ，奶泡用淘宝 10 块左右的那种手持奶泡器就好。我这样用了三年才买的咖啡机，这样做出来的咖啡口感好过市面上大部分自动咖啡机，甚至不"
  },
  {
    "source": "V2EX",
    "title": "一醒来就吃了个大瓜",
    "url": "https://www.v2ex.com/t/1187058",
    "heat": "60 replies",
    "time": "Hot",
    "content": "一醒来就吃了个大瓜 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 V2EX › 职场话题 一醒来就吃了个大瓜 1 mk3s · 8 小时 29 分钟前 · 7639 次点击 公司的 im 有水印，就不发图了，简单总结一下 大数据/医疗部门因使用 ai 生成代码导致生产环境服务器负载拉爆且历史数据被大范围覆盖 it 部门排查开发电脑的 ai 相关软件，禁止 ai 自动代码生成 所有研发部门安排时间重新 review 近半年所有代码 对应研发部门的开发和测试绩效当月为 D(意味着 2026 年没有年终奖了，但是 2025 还是可以有的) 哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈（先笑一下🤣 他们怎么敢的啊，又不是自己的项目，我用 ai 都只拿当搜索引擎，代码都是我自己的测试确认后才写到项目里面去 我一直强调，ai 真的不能帮你背 D 绩效啊喂！ 大数据 AI 绩效 60 条回复 • 2026-01-20 22:25:58 +08:00 1 meteora0tkvo 8 小时 26 分钟前 1 用 ai 的代码没问题，但是用完之后也是要走流程去做软件测试，而不是随便测测就直接部署上去了 2 k9982874 8 小时 25 分钟前 via Android 这事 ai 不被锅，ai 敢拉 leader 敢合才是问题根源 3 reter 8 小时 22 分钟前 跟 ai 又没什么关系。纯粹自己偷懒，盲目相信 ai 输出的结果 4 EastLord 8 小时 21 分钟前 用 AI 写完代码，不 review 吗？ 5 xz410236056 8 小时 8 分钟前 AI 写代码要多 AI 交叉验证，并要求说明改动点和影响范围，人类约束是必须的，有测试覆盖最好。上线还要灰度+feature flag 开关。 这不是 AI 的问题，纯纯该部门开发流程草台班子 6 sn0wdr1am 8 小时 0 分钟前 公司代码没人 Review 是吧，随便一写一提交，对吧。 7 AstroProfundis 7 小时 59 分钟前 用 AI 写代码是把工作量从编码转移到 code review 了，确实能省很多事，但前提是最终背绩效的人要有能力审核 AI 生成的代码 或者说所有 AI 生成工具想用好的大前提就是要有能力核实产出内容正确性 8 valley 7 小时 48 分钟前 前端用用还好，后端怎么敢的？ 9 54xavier 7 小时 43 分钟前 在工作项目上我一直不敢用 ai ，出问题它是真的不能帮我背锅的，老老实实自己写，自己对自己的产出负责 10 lavvrence 7 小时 42 分钟前 5 你应该感谢他们。因为他们的行为和结果满足了你和更广大的手写代码的原教旨主义程序员的预期。 11 GuLuDaDuiZhang 7 小时 41 分钟前 没测试么，至于 review ，我见识的不多但就见过的，所谓 review 就是走走流程形式，没人认真看都是直接点了，最后都是靠测试去测。 不过也辛苦测试了，降本增效+AI ，测试人力减少+研发效率提升，现在排期都压力测试。 12 jaff 7 小时 37 分钟前 5 这算不算因噎废食？ 13 jjwjiang 7 小时 37 分钟前 这跟 AI 有什么关系呢？进来一个神人写几句致命代码不是有一样的效果？ 14 HENQIGUAI 7 小时 36 分钟前 hhh,AI 不会被扣年终奖，但是用 AI 的人会。 15 dongQQ 7 小时 36 分钟前 用 AI 没问题，但是得经过专业测试才能上线 16 SchwarzeR 7 小时 35 分钟前 能捅这么大篓子的大概率是全自动模式自己不带看的，帮忙写体力活和啃文档很好用，但自己看不懂的代码 review 都不 review 就推上生产环境怎么敢的，敢大撒把全自动提交就敢网上复制一段代码看都不看直接贴上去提交 17 Promtheus 7 小时 33 分钟前 我之前说 ai 生成的代码我都会看的 还有人觉得这样效率低 。这不就来例子了 不过真的人的水平良莠不齐 有的沙雕真的就不看的 。ai 生成的代码只要能编译通过就敢往正式更新 18 remarrexxar 7 小时 31 分钟前 这和 AI 有什么关系，不测试不 review ，逻辑上缺乏预警和保护，没有额外环境做验证，草台班子在 AI 时代之前该炸一样炸，AI 只是给不专业的人背锅罢了。 19 cxh116 7 小时 29 分钟前 6 有些公司都强制指标，AI 比例过低还会被警告，有校招生给的理由就是 AI 比例过低没转正。 不过这个和 AI 关系不大，自己没用好而已。 在 Anthropic （ Claude 的开发公司）发布的官方课程 《 AI Fluency: Framework & Foundations 》（ AI 素养：框架与基础） 中，提到的 4D 原则（或称 4D 框架），这个码农用 AI 的明显没有把第 3 和 第 4 原则给做好。 维度\t核心问题\t关键行动 Delegation (委派)\t我该把什么交给 AI ？\t任务分析、能力匹配 Description (描述)\t我该如何指挥 AI ？\t提供语境、设定规则、给示例 Discernment (判别)\t这个结果真的能用吗？\t逻辑审查、质量评估 Diligence (勤勉)\t我尽到审核责任了吗？\t事实核查、伦理检查、人工润色 20 ismysheller 7 小时 29 分钟前 这锅 AI 不背 21 tinyfry 7 小时 28 分钟前 好笑吗？ 22 sanshanrk 7 小时 27 分钟前 有依赖性，一开始还耐得下性子审查，后面 AI 代码越写越多，就有点得过且过。把工作甩给测试 23 northernsongy2 7 小时 25 分钟前 有没有可能哪怕他们自己写，也会是同样的问题，可能更大... 24 Gilfoyle26 7 小时 21 分钟前 2 典型的因噎废食，出了问题就一刀切，管理能力低下的典型表现 25 abigeater 7 小时 20 分钟前 AI 写代码一点毛病没有，但 review 和细节把控是关键，有些完全依赖 AI 的同事只描述了问题让 AI 解决，完全没有细节，像请求第三方接口的需求没描述给 AI AI 也完全不做限流和频率，同事也不看； 然后每个月的请求额度 月初就被他跑完了... 26 Felldeadbird 6 小时 43 分钟前 ai 生成代码，导致历史数据被覆盖。review 没做，测试没做。AI 真不背锅。 27 haoswil 6 小时 40 分钟前 把锅丢到 AI 头上不合适，在 AI 之前，大部分 copy/paste 的代码，也没人说不允许使用。You own your code, 一棒子打死 AI ，不合适，禁止 AI 自动代码生成更是在倒退。 28 lpf0309 6 小时 38 分钟前 1 我现在看到别人给我甩 AI 回答我都不想看，很烦，自己不测试一下就把 AI 的答案作为真题，我难道不会用 AI 么？ 29 JoeDH 6 小时 15 分钟前 "
  },
  {
    "source": "V2EX",
    "title": "开发了一个“做了么”APP，欢迎大家下载使用",
    "url": "https://www.v2ex.com/t/1186963",
    "heat": "54 replies",
    "time": "Hot",
    "content": "开发了一个“做了么”APP，欢迎大家下载使用 - V2EX 首页 注册 登录 V2EX = way to explore V2EX 是一个关于分享和探索的地方 现在注册 已注册用户请 登录 V2EX › 推广 开发了一个“做了么”APP，欢迎大家下载使用 1 linweijian · 13 小时 6 分钟前 · 6221 次点击 最近“死了么” APP 爆火，上次又看到一个 “撸了么（ https://github.com/sky22333/luleme ）”， 现在小弟也想蹭一下热点，于是花了几个小时开发了一个“做了么” APP （帮助情侣，夫妻，情人起飞的 APP ），抛砖引玉。欢迎大家打包使用，支持 Ios ，Android ，Windows ，Macos 等 github 地址： https://github.com/Chenfyuan/zuoleme 技术栈 .NET 10.0 C# MAUI 等 做了么 情侣 App 54 条回复 • 2026-01-20 22:30:11 +08:00 1 linnsh 13 小时 4 分钟前 好家伙，留给各位开发者的 \"*了么\"已经不多了。 2 Lowlife 13 小时 0 分钟前 via iPhone 9 不错啊，操逼记录起来，老了鸡巴硬不起来了，也可以用来回忆。 3 ZDaYu 13 小时 0 分钟前 你这更像是🦌了吗 4 hanggoing 13 小时 0 分钟前 没有编译好的安卓版本吗 5 BigPiggggg 12 小时 59 分钟前 加个配合智能手表记录心率的功能 6 debuggerx 12 小时 58 分钟前 为受便秘困扰的小仙女们开发个“屙了么”吧💩 7 linweijian OP 12 小时 56 分钟前 @ debuggerx 可以可以，开发一个拉了么 APP ，寻找全国公共厕所，给出公共厕所评级 8 linweijian OP 12 小时 56 分钟前 @ Lowlife 老哥 666 9 linweijian OP 12 小时 56 分钟前 @ hanggoing 后续加上，大佬 10 linweijian OP 12 小时 55 分钟前 @ BigPiggggg 有道理，后续考虑推出 wearos 版本 11 byranb 12 小时 53 分钟前 笑死 哈哈哈 12 nilaoda 12 小时 45 分钟前 难得见到 C# 的项目 13 snakejia 12 小时 44 分钟前 你是人才 14 mengdu 12 小时 42 分钟前 15 HotieCutie 12 小时 42 分钟前 怎么做 16 michealzh 12 小时 41 分钟前 厉害了 17 MarkP 12 小时 37 分钟前 一天三次还适中？可要了老命了 18 xmsl 12 小时 35 分钟前 那不用说，为了尊严肯定无效打卡 19 zhuangzhuang1988 12 小时 34 分钟前 难得看到用 maui 做的 20 boringwheat 12 小时 24 分钟前 改名 [硬了么] 可能会更好一点 21 Kirkcong 12 小时 19 分钟前 @ Livid 推广或分享创造 22 AkinoKaedeChan 12 小时 17 分钟前 1 推荐改成这样，记录的时候要拿两个手机 NFC 碰一下，或者扫码确认（ x 23 crc8 12 小时 16 分钟前 吃了么？ 24 glacer 12 小时 15 分钟前 三天没做自动匹配附近的人 🐶 25 AkinoKaedeChan 12 小时 15 分钟前 另外既然有 luleme ，可以写个 kouleme 26 ddzm 11 小时 59 分钟前 人才，我也做了一个网页版本的，哈哈 27 littiefish 11 小时 58 分钟前 via iPhone @ glacer 三天没做推荐✈️杯 28 cat9life 11 小时 57 分钟前 做核酸检测？ 29 runtime0 11 小时 51 分钟前 牛逼牛逼牛逼！！！！ 30 nuomi196500 11 小时 43 分钟前 苹果系统自带，安卓难变现 31 idihs 11 小时 37 分钟前 再加个匹配模式🥵 32 f 11 小时 31 分钟前 这不是早就有的 app 吗，姿势，地点啥的都记录，搜一搜，以前有这玩意 33 boyzhang 11 小时 19 分钟前 不错，以后打飞机全部记作操逼。 34 mywaiting 11 小时 10 分钟前 难得一见 C# 项目，挺好 最近用 C# 做了不少东西，这货真是被低估的大杀器，底层/管道/界面一个代码栈搞定，真能一次编译全平台分发 35 whitehack 11 小时 3 分钟前 @ mywaiting #34 但是这玩意的硬伤是,对 app 基本无保护. 如果需要在客户端做一些加密解密之类的东西.就不要用 c#了. 基本就是明文. 36 poic 10 小时 41 分钟前 搞个赢了么 37 johnbobby 10 小时 37 分钟前 不如思路放开，写一个通用的 x 了么，任何事件都可以记录 38 leegradyllljjjj 9 小时 23 分钟前 via iPhone 难得一见，没想到 xmarin 这玩意儿还有用户 39 FreeGuy 8 小时 32 分钟前 现在流行 AI Girlfriend ，宅男神器... 40 0631Alex 8 小时 26 分钟前 @ Lowlife #2 老哥说话太直接了 41 opticalproperti 8 小时 19 分钟前 这玩意在 qq 群传播了 42 peteretep 7 小时 48 分钟前 1 一定要加上排行榜！ 同小区排行！ 43 panfenglai 7 小时 28 分钟前 @ linweijian 这个好像已经有很多了吧 44 windorz 7 小时 5 分钟前 一般情况下用美柚, 完事还有时都忘记记. 45 zhenizhui 5 小时 50 分钟前 牛逼 46 SomeMore 5 小时 42 分钟前 搞个，附近的人排行榜 47 nancyii 5 小时 41 分钟前 coloros 系统下部分文字显示会乱码。 48 k1eran 5 小时 40 分钟前 @ Lowlife 硬了吗 49 cwcc 5 小时 38 分钟前 苹果的健康下面原生就有这个功能的。 50 linweijian OP 5 小时 28 分钟前 @ nancyii 好的，等下修复 51 taqingqiuu 4 小时 33 分钟前 舔了吗 52 royzxq 1 小时 15 分钟前 没有自动匹配吗？ 53 sakujo 51 分钟前 弄个单人版撸了么 54 lizhenda 6 分钟前 厉害了啊，C# 用来开发跨平台应用看起来不错啊 关于 · 帮助文档 · 自助推广系统 · 博客 · API · FAQ · Solana · 2886 人在线 最高记录 6679 · Select Language 创意工作者们的社区 World is powered by solitude VERSION: 3.9.8.5 · 26ms · "
  }
]
